-- phpMyAdmin SQL Dump
-- version 4.8.2
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1
-- Généré le :  Dim 18 oct. 2020 à 15:11
-- Version du serveur :  10.1.34-MariaDB
-- Version de PHP :  7.2.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données :  `snsh`
--

-- --------------------------------------------------------

--
-- Structure de la table `alerte`
--

CREATE TABLE `alerte` (
  `id_msg` int(11) NOT NULL,
  `id` int(11) NOT NULL,
  `nom` varchar(50) NOT NULL,
  `from_id` int(11) NOT NULL,
  `from_nom` varchar(50) NOT NULL,
  `objet` text NOT NULL,
  `dat` datetime NOT NULL,
  `body` text,
  `active` varchar(20) NOT NULL,
  `vue` varchar(20) NOT NULL,
  `f_pj` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Structure de la table `commune`
--

CREATE TABLE `commune` (
  `CODE_W` int(11) NOT NULL,
  `COMMUNE` varchar(100) DEFAULT NULL,
  `COMMUNEA` varchar(100) DEFAULT NULL,
  `CODE_C` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `commune`
--

INSERT INTO `commune` (`CODE_W`, `COMMUNE`, `COMMUNEA`, `CODE_C`) VALUES
(1, 'Adrar', 'أدرار', 101),
(1, 'Tamest', 'تامست', 102),
(1, 'Charouine', 'شروين', 103),
(1, 'Reggane', 'رقان', 104),
(1, 'Inozghmir', 'إن زغمير', 105),
(1, 'Tit', 'تيت', 106),
(1, 'Ksar Kaddour', 'قصر قدور', 107),
(1, 'Tsabit', 'تسابيت', 108),
(1, 'Timimoun', 'تيميمون', 109),
(1, 'Ouled Said', 'أولادالسعيد', 110),
(1, 'Zaouiet Kounta', 'زاوية كنتة', 111),
(1, 'Aoulef', 'أولف', 112),
(1, 'Timokten', 'تيمقتن', 113),
(1, 'Tamentit', 'تامنطيط', 114),
(1, 'Fenoughil', 'فنوغيل', 115),
(1, 'Tinerkouk', 'تينركوك', 116),
(1, 'Deldoul', 'دلدول', 117),
(1, 'Sali', 'سالي', 118),
(1, 'Akabli', 'أقبلي', 119),
(1, 'Metarfa', 'المطارفة', 120),
(1, 'O Ahmed Timmi', 'أولاد أحمد تيمي', 121),
(1, 'Bouda', 'بودة', 122),
(1, 'Aougrout', 'أوقروت', 123),
(1, 'Talmine', 'طالمين', 124),
(1, 'B Badji Mokhtar', 'برج باجي مختار', 125),
(1, 'Sbaa', 'السبع', 126),
(1, 'Ouled Aissa', 'أولاد عيسى', 127),
(1, 'Timiaouine', 'تيمياوين', 128),
(2, 'Chlef', 'الشلف', 201),
(2, 'Tenes', 'تنس', 202),
(2, 'Benairia', 'بنايرية', 203),
(2, 'El Karimia', 'الكريمية', 204),
(2, 'Tadjna', 'تاجنة', 205),
(2, 'Taougrite', 'تاوقريت', 206),
(2, 'Beni Haoua', 'بني حوات', 207),
(2, 'Sobha', 'صبحة', 208),
(2, 'Harchoun', 'حرشون', 209),
(2, 'Ouled Fares', 'أولاد فارس', 210),
(2, 'Sidi Akacha', 'سيدي عكاشة', 211),
(2, 'Boukadir', 'بوقادير', 212),
(2, 'Beni Rached', 'بني راشد', 213),
(2, 'Talassa', 'تلعصة', 214),
(2, 'Herenfa', 'الهرنافة', 215),
(2, 'Oued Goussine', 'وادي قوسين', 216),
(2, 'Dahra', 'الظهرة', 217),
(2, 'Ouled Abbes', 'أولاد عباس', 218),
(2, 'Sendjas', 'السنجاس', 219),
(2, 'Zeboudja', 'الزبوجة', 220),
(2, 'Oued Sly', 'وادي سلي', 221),
(2, 'Abou El Hassen', 'أبو الحسن', 222),
(2, 'El Marsa', 'المرسى', 223),
(2, 'Chettia', 'الشطية', 224),
(2, 'Sidi Abderrahmane', 'سيدي عبد الرحمن', 225),
(2, 'Moussadek', 'مصدق', 226),
(2, 'El Hadjadj', 'الحجاج', 227),
(2, 'Labiod Medjadja', 'الابيض مجاجة', 228),
(2, 'Oued Fodda', 'وادي الفضة', 229),
(2, 'Ouled Ben Abdelkader', 'أولاد بن عبد القادر', 230),
(2, 'Bouzghaia', 'بوزغاية', 231),
(2, 'Ain Merane', 'عين مران', 232),
(2, 'Oum Drou', 'أم الدروع', 233),
(2, 'Breira', 'بريرة', 234),
(2, 'Ben Boutaleb', 'بني بوعتاب', 235),
(3, 'Laghouat', 'الاغواط', 301),
(3, 'Ksar El Hirane', 'قصر الحيران', 302),
(3, 'Benacer Ben Chohra', 'بناصر بن شهرة', 303),
(3, 'Sidi Makhlouf', 'سيدي مخلوف', 304),
(3, 'Hassi Delaa', 'حاسي دلاعة', 305),
(3, 'Hassi R Mel', 'حاسي الرمل', 306),
(3, 'Ain Mahdi', 'عين ماضي', 307),
(3, 'Tadjmout', 'تاجموت', 308),
(3, 'Kheneg', 'الخنق', 309),
(3, 'Gueltat Sidi Saad', 'قلتة سيدي سعد', 310),
(3, 'Ain Sidi Ali', 'عين سيدي علي', 311),
(3, 'Beidha', 'البيضاء', 312),
(3, 'Brida', 'بريدة', 313),
(3, 'El Ghicha', 'الغيشة', 314),
(3, 'Hadj Mechri', 'الحاج المشري', 315),
(3, 'Sebgag', 'سبقاق', 316),
(3, 'Taouiala', 'تاويالة', 317),
(3, 'Tadjrouna', 'تاجرونة', 318),
(3, 'Aflou', 'افلو', 319),
(3, 'El Assafia', 'العسافية', 320),
(3, 'Oued Morra', 'واد مرة', 321),
(3, 'Oued M Zi', 'واد مزي', 322),
(3, 'El Haouaita', 'الحويطة', 323),
(3, 'Sidi Bouzid', 'سيدي بوزيد', 324),
(4, 'Oum El Bouaghi', 'أم البواقي', 401),
(4, 'Ain Beida', 'عين البيضات', 402),
(4, 'Ainmlila', 'عين مليلة', 403),
(4, 'Behir Chergui', 'بحير الشقي', 404),
(4, 'El Amiria', 'العامرية', 405),
(4, 'Sigus', 'سيقوس', 406),
(4, 'El Belala', 'البلالة', 407),
(4, 'Ain Babouche', 'عين بابوش', 408),
(4, 'Berriche', 'بريش', 409),
(4, 'Ouled Hamla', 'أولاد حملة', 410),
(4, 'Dhala', 'الضلعة', 411),
(4, 'Ain Kercha', 'عين كرشة', 412),
(4, 'Hanchir Toumghani', 'هنشير تومغاني', 413),
(4, 'El Djazia', 'الجازية', 414),
(4, 'Ain Diss', 'عين الديس', 415),
(4, 'Fkirina', 'فكيرينة', 416),
(4, 'Souk Naamane', 'سوق نعمان', 417),
(4, 'Zorg', 'الزرق', 418),
(4, 'El Fedjoudj Boughrar', 'الفجوج بوغرارة سعودي', 419),
(4, 'Ouled Zouai', 'أولاد زاوي', 420),
(4, 'Bir Chouhada', 'بئر الشهدات', 421),
(4, 'Ksar Sbahi', 'قصر الصباحي', 422),
(4, 'Oued Nini', 'وادي نيني', 423),
(4, 'Meskiana', 'مسكيانة', 424),
(4, 'Ain Fekroune', 'عين فكرون', 425),
(4, 'Rahia', 'الراحية', 426),
(4, 'Ain Zitoun', 'عين الزيتون', 427),
(4, 'Ouled Gacem', 'أولاد قاسم', 428),
(4, 'El Harmilia', 'الحرملية', 429),
(5, 'Batna', 'باتنة', 501),
(5, 'Ghassira', 'غسيرة', 502),
(5, 'Maafa', 'معافة', 503),
(5, 'Merouana', 'مروانة', 504),
(5, 'Seriana', 'سريانة', 505),
(5, 'Menaa', 'منعة', 506),
(5, 'El Madher', 'المعذر', 507),
(5, 'Tazoult', 'تازولت', 508),
(5, 'Ngaous', 'نقاوس', 509),
(5, 'Guigba', 'قيقبة', 510),
(5, 'Inoughissen', 'إينوغيسن', 511),
(5, 'Ouyoun El Assafir', 'عيون العصافير', 512),
(5, 'Djerma', 'جرمة', 513),
(5, 'Bitam', 'بيطام', 514),
(5, 'Metkaouak', 'المتكوك', 515),
(5, 'Arris', 'أريس', 516),
(5, 'Kimmel', 'كيمل', 517),
(5, 'Tilatou', 'تيلاطو', 518),
(5, 'Ain Djasser', 'عين جاسر', 519),
(5, 'Ouled Selam', 'أولاد سالم', 520),
(5, 'Tigherghar', 'تغرغار', 521),
(5, 'Ain Yagout', 'عين ياقوت', 522),
(5, 'Fesdis', 'فسديس', 523),
(5, 'Sefiane', 'سفيان', 524),
(5, 'Rahbat', 'الرحبات', 525),
(5, 'Tighanimine', 'تغانمين', 526),
(5, 'Lemsane', 'لمسان', 527),
(5, 'Ksar Belezma', 'قصر بلزمة', 528),
(5, 'Seggana', 'سقانة', 529),
(5, 'Ichmoul', 'أشمول', 530),
(5, 'Foum Toub', 'فم الطوب', 531),
(5, 'Beni Foudhala El Hakania', 'بني فضالة الحقانية', 532),
(5, 'Oued El Ma', 'وادي المات', 533),
(5, 'Talkhamt', 'تالغمت', 534),
(5, 'Bouzina', 'بوزينة', 535),
(5, 'Chemora', 'شمرة', 536),
(5, 'Oued Chaaba', 'وادي الشعبة', 537),
(5, 'Taxlent', 'تاكسلانة', 538),
(5, 'Gosbat', 'القصبات', 539),
(5, 'Ouled Aouf', 'أولاد عوف', 540),
(5, 'Boumagueur', 'بومقر', 541),
(5, 'Barika', 'بريكة', 542),
(5, 'Djezzar', 'الجزار', 543),
(5, 'Tkout', 'تكوت', 544),
(5, 'Ain Touta', 'عين التوتة', 545),
(5, 'Hidoussa', 'حيدوسة', 546),
(5, 'Teniet El Abed', 'ثنية العابد', 547),
(5, 'Oued Taga', 'وادي الطاقة', 548),
(5, 'Ouled Fadel', 'أولاد فاضل', 549),
(5, 'Timgad', 'تيمقاد', 550),
(5, 'Ras El Aioun', 'رأس العيون', 551),
(5, 'Chir', 'النوادر', 552),
(5, 'Ouled Si Slimane', 'أولاد سي سليمان', 553),
(5, 'Zanat El Beida', 'زانة البيضات', 554),
(5, 'Amdoukal', 'مدوكال', 555),
(5, 'Ouled Ammar', 'أولاد عمار', 556),
(5, 'El Hassi', 'الحاسي', 557),
(5, 'Lazrou', 'لازرو', 558),
(5, 'Boumia', 'بومية', 559),
(5, 'Boulhilat', 'بوالحيلات', 560),
(5, 'Larbaa', 'لرباع', 561),
(6, 'Bejaia', 'بجاية', 601),
(6, 'Amizour', 'أميزور', 602),
(6, 'Ferraoun', 'فرعون', 603),
(6, 'Taourirt Ighil', 'تاوريرت إغيل', 604),
(6, 'Chelata', 'شلاطة', 605),
(6, 'Tamokra', 'تامقرة', 606),
(6, 'Timzrit', 'تيمزريت', 607),
(6, 'Souk El Thenine', 'سوق الاثنين', 608),
(6, 'Mcisna', 'سيدي السعيد', 609),
(6, 'Thinabdher', 'تينبذار', 610),
(6, 'Tichi', 'تيشي', 611),
(6, 'Semaoun', 'سمعون', 612),
(6, 'Kendira', 'كنديرة', 613),
(6, 'Tifra', 'تيفرة', 614),
(6, 'Ighram', 'إغرم', 615),
(6, 'Amalou', 'آمالو', 616),
(6, 'Ighil Ali', 'إغيل علي', 617),
(6, 'Ifelain Ilmathen', 'فلاين الماثن', 618),
(6, 'Toudja', 'توجة', 619),
(6, 'Darguina', 'درقينة', 620),
(6, 'Sidi Ayad', 'سيدي عياد', 621),
(6, 'Aokas', 'أوقاس', 622),
(6, 'Beni Djellil', 'بني جليل', 623),
(6, 'Adekar', 'أدكار', 624),
(6, 'Akbou', 'أقبو', 625),
(6, 'Seddouk', 'صدوق', 626),
(6, 'Tazmalt', 'تزمالت', 627),
(6, 'Ait Rizine', 'آيت رزين', 628),
(6, 'Chemini', 'شميني', 629),
(6, 'Souk Oufella', 'السوق أوفلا', 630),
(6, 'Taskriout', 'تاسكريوت', 631),
(6, 'Tibane', 'طيبان', 632),
(6, 'Tala Hamza', 'تالة حمزة', 633),
(6, 'Barbacha', 'برباشة', 634),
(6, 'Beni Ksila', 'بني كسيلة', 635),
(6, 'Ouzallaguen', 'أوزلاقن', 636),
(6, 'Bouhamza', 'بوحمزة', 637),
(6, 'Beni Melikeche', 'بني مليكش', 638),
(6, 'Sidi Aich', 'سيدي عيش', 639),
(6, 'El Kseur', 'القصر', 640),
(6, 'Melbou', 'مالبو', 641),
(6, 'Akfadou', 'أكفادو', 642),
(6, 'Leflaye', 'لفلاي', 643),
(6, 'Kherrata', 'خراطة', 644),
(6, 'Draa Kaid', 'ذراع القايد', 645),
(6, 'Tamridjet', 'تامريجت', 646),
(6, 'Ait Smail', 'آيت إسماعيل', 647),
(6, 'Boukhelifa', 'بوخليفة', 648),
(6, 'Tizi Nberber', 'تيزي بربر', 649),
(6, 'Beni Maouch', 'بني معوش', 650),
(6, 'Oued Ghir', 'وادي غير', 651),
(6, 'Boudjellil', 'بوجليل', 652),
(7, 'Biskra', 'بسكرة', 701),
(7, 'Oumache', 'أوماش', 702),
(7, 'Branis', 'البرانس', 703),
(7, 'Chetma', 'شتمة', 704),
(7, 'Ouled Djellal', 'أولاد جلال', 705),
(7, 'Ras El Miaad', 'رأس الميعاد', 706),
(7, 'Besbes', 'اولاد حركات', 707),
(7, 'Sidi Khaled', 'سيدي خالد', 708),
(7, 'Doucen', 'الدوسن', 709),
(7, 'Ech Chaiba', 'الشعيبة', 710),
(7, 'Sidi Okba', 'سيدي عقبة', 711),
(7, 'Mchouneche', 'مشونش', 712),
(7, 'El Haouch', 'الحوش', 713),
(7, 'Ain Naga', 'عين الناقة', 714),
(7, 'Zeribet El Oued', 'زريبة الوادي', 715),
(7, 'El Feidh', 'الفيض', 716),
(7, 'El Kantara', 'القنطرة', 717),
(7, 'Ain Zaatout', 'عين زعطوط', 718),
(7, 'El Outaya', 'الوطاية', 719),
(7, 'Djemorah', 'جمورة', 720),
(7, 'Tolga', 'طولقة', 721),
(7, 'Lioua', 'لوات', 722),
(7, 'Lichana', 'لشانة', 723),
(7, 'Ourlal', 'أورلال', 724),
(7, 'Mlili', 'مليلي', 725),
(7, 'Foughala', 'فوغالة', 726),
(7, 'Bordj Ben Azzouz', 'برج بن عزوز', 727),
(7, 'Meziraa', 'المزيرعة', 728),
(7, 'Bouchagroun', 'بوشقرون', 729),
(7, 'Mekhadma', 'مخادمة', 730),
(7, 'El Ghrous', 'الغروس', 731),
(7, 'El Hadjab', 'الحاجب', 732),
(7, 'Khanguet Sidinadji', 'خنقة سيدي ناجي', 733),
(8, 'Bechar', 'بشار', 801),
(8, 'Erg Ferradj', 'عرق فراج', 802),
(8, 'Ouled Khoudir', 'أولاد خضير', 803),
(8, 'Meridja', 'مريجة', 804),
(8, 'Timoudi', 'تمودي', 805),
(8, 'Lahmar', 'الأحمر', 806),
(8, 'Beni Abbes', 'بني عباس', 807),
(8, 'Beni Ikhlef', 'بني يخلف', 808),
(8, 'Mechraa Houari B', 'مشروع هواري بومدين', 809),
(8, 'Kenedsa', 'قنادسة', 810),
(8, 'Igli', 'إيقلي', 811),
(8, 'Tabalbala', 'تبلبالة', 812),
(8, 'Taghit', 'تاغيت', 813),
(8, 'El Ouata', 'الوطات', 814),
(8, 'Boukais', 'بوقايس', 815),
(8, 'Mogheul', 'موغل', 816),
(8, 'Abadla', 'العبادلة', 817),
(8, 'Kerzaz', 'كرزاز', 818),
(8, 'Ksabi', 'قصابي', 819),
(8, 'Tamtert', 'تامترت', 820),
(8, 'Beni Ounif', 'بني ونيف', 821),
(9, 'Blida', 'البليدة', 901),
(9, 'Chebli', 'الشبلي', 902),
(9, 'Bouinan', 'بوعينان', 903),
(9, 'Oued El Alleug', 'وادي العلايق', 904),
(9, 'Ouled Yaich', 'أولاد يعيش', 905),
(9, 'Chrea', 'الشريعة', 906),
(9, 'El Affroun', 'العفرون', 907),
(9, 'Chiffa', 'الشفة', 908),
(9, 'Hammam Melouane', 'حمام ملوان', 909),
(9, 'Ben Khlil', 'بن خليل', 910),
(9, 'Soumaa', 'الصومعة', 911),
(9, 'Mouzaia', 'موزاية', 912),
(9, 'Souhane', 'سوحان', 913),
(9, 'Meftah', 'مفتاح', 914),
(9, 'Ouled Selama', 'أولاد سلامة', 915),
(9, 'Boufarik', 'بوفاريك', 916),
(9, 'Larbaa', 'الأربعات', 917),
(9, 'Oued Djer', 'وادي جر', 918),
(9, 'Beni Tamou', 'بني تامو', 919),
(9, 'Bouarfa', 'بوعرفة', 920),
(9, 'Beni Mered', 'بني مراد', 921),
(9, 'Bougara', 'بوقرة', 922),
(9, 'Guerrouaou', 'قرواو', 923),
(9, 'Ain Romana', 'عين الرمانة', 924),
(9, 'Djebabra', 'جبابرة', 925),
(10, 'Bouira', 'البويرة', 1001),
(10, 'El Asnam', 'الأسنام', 1002),
(10, 'Guerrouma', 'قرومة', 1003),
(10, 'Souk El Khemis', 'سوق الخميس', 1004),
(10, 'Kadiria', 'القادرية', 1005),
(10, 'Hanif', 'حنيف', 1006),
(10, 'Dirah', 'ديرة', 1007),
(10, 'Ait Laaziz', 'آيت لعزيز', 1008),
(10, 'Taghzout', 'تاغزوت', 1009),
(10, 'Raouraoua', 'روراوة', 1010),
(10, 'Mezdour', 'مزدور', 1011),
(10, 'Haizer', 'الحيزر', 1012),
(10, 'Lakhdaria', 'الأخضرية', 1013),
(10, 'Maala', 'معلة', 1014),
(10, 'El Hachimia', 'الهاشمية', 1015),
(10, 'Aomar', 'عمر', 1016),
(10, 'Chorfa', 'الشرفات', 1017),
(10, 'Bordj Oukhriss', 'برج أوخريص', 1018),
(10, 'El Adjiba', 'العجيبة', 1019),
(10, 'El Hakimia', 'الحاكمية', 1020),
(10, 'El Khebouzia', 'الخبوزية', 1021),
(10, 'Ahl El Ksar', 'أهل القصر', 1022),
(10, 'Bouderbala', 'بودربالة', 1023),
(10, 'Zbarbar', 'زبربر', 1024),
(10, 'Ain El Hadjar', 'عين الحجر', 1025),
(10, 'Djebahia', 'جباحية', 1026),
(10, 'Aghbalou', 'اغبالو', 1027),
(10, 'Taguedit', 'تاقديت', 1028),
(10, 'Ain Turk', 'عين الترك', 1029),
(10, 'Saharidj', 'الصهاريج', 1030),
(10, 'Dechmia', 'الدشمية', 1031),
(10, 'Ridane', 'ريدان', 1032),
(10, 'Bechloul', 'بشلول', 1033),
(10, 'Boukram', 'بوكرم', 1034),
(10, 'Ain Bessam', 'عين بسام', 1035),
(10, 'Bir Ghbalou', 'بئر غبالو', 1036),
(10, 'Mchedallah', 'مشداله', 1037),
(10, 'Sour El Ghozlane', 'سور الغزلان', 1038),
(10, 'Maamora', 'المعمورة', 1039),
(10, 'Ouled Rached', 'أولاد راشد', 1040),
(10, 'Ain Laloui', 'عين العلوي', 1041),
(10, 'Hadjera Zerga', 'الحجرة الزرقاء', 1042),
(10, 'Ath Mansour', 'تاوريرت', 1043),
(10, 'El Mokrani', 'المقراني', 1044),
(10, 'Oued El Berdi', 'وادي البردي', 1045),
(11, 'Tamanghasset', 'تامنغست', 1101),
(11, 'Abalessa', 'أباليسا', 1102),
(11, 'In Ghar', 'ان غار', 1103),
(11, 'In Guezzam', 'ان قزام', 1104),
(11, 'Idles', 'أدلس', 1105),
(11, 'Tazouk', 'تازروق', 1106),
(11, 'Tinzaouatine', 'تين زواتين', 1107),
(11, 'In Salah', 'ان صالح', 1108),
(11, 'In Amguel', 'ان امقل', 1109),
(11, 'Foggaret Ezzaouia', 'فقرات الزاوية', 1110),
(12, 'Tebessa', 'تبسة', 1201),
(12, 'Bir El Ater', 'بئر العاتر', 1202),
(12, 'Cheria', 'الشريعة', 1203),
(12, 'Stah Guentis', 'سطح قنطيس', 1204),
(12, 'El Aouinet', 'العوينات', 1205),
(12, 'Lahouidjbet', 'الحويجبات', 1206),
(12, 'Safsaf El Ouesra', 'صفصاف الوسرة', 1207),
(12, 'Hammamet', 'الحمامات', 1208),
(12, 'Negrine', 'نقرين', 1209),
(12, 'Bir El Mokadem', 'بئر المقدم', 1210),
(12, 'El Kouif', 'الكويف', 1211),
(12, 'Morsott', 'مرسط', 1212),
(12, 'El Ogla', 'العقلة', 1213),
(12, 'Bir Dheheb', 'بئرالذهب', 1214),
(12, 'El Ogla El Malha', 'العقلة المالحة', 1215),
(12, 'Gorriguer', 'قوريقر', 1216),
(12, 'Bekkaria', 'بكارية', 1217),
(12, 'Boukhadra', 'بوخضرة', 1218),
(12, 'Ouenza', 'الونزة', 1219),
(12, 'El Ma El Biodh', 'الماتالأبيض', 1220),
(12, 'Oum Ali', 'ام علي', 1221),
(12, 'Thlidjene', 'ثليجان', 1222),
(12, 'Ain Zerga', 'عين الزرقات', 1223),
(12, 'El Meridj', 'المريج', 1224),
(12, 'Boulhaf Dyr', 'بولحاف الدين', 1225),
(12, 'Bedjene', 'بجن', 1226),
(12, 'El Mazeraa', 'المزرعة', 1227),
(12, 'Ferkane', 'فركان', 1228),
(13, 'Tlemcen', 'تلمسان', 1301),
(13, 'Beni Mester', 'بني مستر', 1302),
(13, 'Ain Tallout', 'عين تالوت', 1303),
(13, 'Remchi', 'الرمشي', 1304),
(13, 'El Fehoul', 'الفحول', 1305),
(13, 'Sabra', 'صبرة', 1306),
(13, 'Ghazaouet', 'الغزوات', 1307),
(13, 'Souani', 'السواني', 1308),
(13, 'Djebala', 'جبالة', 1309),
(13, 'El Gor', 'القور', 1310),
(13, 'Oued Chouly', 'وادي الشولي', 1311),
(13, 'Ain Fezza', 'عين فزة', 1312),
(13, 'Ouled Mimoun', 'أولاد ميمون', 1313),
(13, 'Amieur', 'عمير', 1314),
(13, 'Ain Youcef', 'عين يوسف', 1315),
(13, 'Zenata', 'زناتة', 1316),
(13, 'Beni Snous', 'بني سنوس', 1317),
(13, 'Bab El Assa', 'باب العسة', 1318),
(13, 'Dar Yaghmouracene', 'دار يغمراسن', 1319),
(13, 'Fellaoucene', 'فلاوسن', 1320),
(13, 'Azails', 'العزايل', 1321),
(13, 'Sebbaa Chioukh', 'السبعة شيوخ', 1322),
(13, 'Terni Beni Hediel', 'تيرني بني هديل', 1323),
(13, 'Bensekrane', 'ابن سكران', 1324),
(13, 'Ain Nehala', 'عين نحالة', 1325),
(13, 'Hennaya', 'الحناية', 1326),
(13, 'Maghnia', 'مغنية', 1327),
(13, 'Hammam Boughrara', 'حمام بوغرارة', 1328),
(13, 'Souahlia', 'السواحلية', 1329),
(13, 'Msirda Fouaga', 'مسيردة الفواقة', 1330),
(13, 'Ain Fetah', 'عين فتاح', 1331),
(13, 'El Aricha', 'العريشة', 1332),
(13, 'Souk Thlata', 'سوق الثلاثات', 1333),
(13, 'Sidi Abdelli', 'سيدي عبداللي', 1334),
(13, 'Sebdou', 'سبدو', 1335),
(13, 'Beni Ouarsous', 'بني وارسوس', 1336),
(13, 'Sidi Medjahed', 'سيدي مجاهد', 1337),
(13, 'Beni Boussaid', 'بني بوسعيد', 1338),
(13, 'Marsa Ben Mhidi', 'مرسى بن مهيدي', 1339),
(13, 'Nedroma', 'ندرومة', 1340),
(13, 'Sidi Djillali', 'سيدي الجيلالي', 1341),
(13, 'Beni Bahdel', 'بني بهدل', 1342),
(13, 'El Bouihi', 'البويهي', 1343),
(13, 'Honaine', 'حنين', 1344),
(13, 'Tianet', 'تيانت', 1345),
(13, 'Ouled Riyah', 'أولاد رياح', 1346),
(13, 'Bouhlou', 'بوحلو', 1347),
(13, 'Souk El Khemis', 'بني راشد', 1348),
(13, 'Ain Ghoraba', 'عين الغرابة', 1349),
(13, 'Chetouane', 'شتوان', 1350),
(13, 'Mansourah', 'منصورة', 1351),
(13, 'Beni Semiel', 'بني صميل', 1352),
(13, 'Ain Kebira', 'العين الكبيرة', 1353),
(14, 'Tiaret', 'تيارت', 1401),
(14, 'Medroussa', 'مدروسة', 1402),
(14, 'Ain Bouchekif', 'عين بوشقيف', 1403),
(14, 'Sidi Ali Mellal', 'سيدي علي ملال', 1404),
(14, 'Ain Zarit', 'عين زاريت', 1405),
(14, 'Ain Deheb', 'عين الذهب', 1406),
(14, 'Sidi Bakhti', 'سيدي بختي', 1407),
(14, 'Medrissa', 'مديرسة', 1408),
(14, 'Zmalet El Emir Aek', 'زمالة الأمير عبد الق', 1409),
(14, 'Madna', 'مادنة', 1410),
(14, 'Sebt', 'السبت', 1411),
(14, 'Mellakou', 'ملاكو', 1412),
(14, 'Dahmouni', 'دحموني', 1413),
(14, 'Rahouia', 'رحوية', 1414),
(14, 'Mahdia', 'مهدية', 1415),
(14, 'Sougueur', 'السوقر', 1416),
(14, 'Sidi Abdelghani', 'سي عبد الغاني', 1417),
(14, 'Ain El Hadid', 'عين الحديد', 1418),
(14, 'Ouled Djerad', 'جبيلت الرصفات', 1419),
(14, 'Naima', 'النعيمة', 1420),
(14, 'Meghila', 'مغيلة', 1421),
(14, 'Guertoufa', 'قرطوفة', 1422),
(14, 'Sidi Hosni', 'سيدي الحسني', 1423),
(14, 'Djillali Ben Amar', 'جيلالي بن عمار', 1424),
(14, 'Sebaine', 'سبعين', 1425),
(14, 'Tousnina', 'توسنينة', 1426),
(14, 'Frenda', 'فرندة', 1427),
(14, 'Ain Kermes', 'عين كرمس', 1428),
(14, 'Ksar Chellala', 'قصر الشلالة', 1429),
(14, 'Rechaiga', 'الرشايقة', 1430),
(14, 'Nadorah', 'الناظورة', 1431),
(14, 'Tagdemt', 'تاقدمت', 1432),
(14, 'Oued Lilli', 'وادي ليلي', 1433),
(14, 'Mechraa Safa', 'مشروع الصفا', 1434),
(14, 'Hamadia', 'الحمادية', 1435),
(14, 'Chehaima', 'شحيمة', 1436),
(14, 'Takhemaret', 'تخمارت', 1437),
(14, 'Sidi Abderrahmane', 'أولاد جراد', 1438),
(14, 'Serghine', 'سرغين', 1439),
(14, 'Bougara', 'بوقرة', 1440),
(14, 'Faidja', 'الفايجة', 1441),
(14, 'Tidda', 'تيدة', 1442),
(15, 'Tizi Ouzou', 'تيزي وزو', 1501),
(15, 'Ain El Hammam', 'عين الحمام', 1502),
(15, 'Akbil', 'اقبيل', 1503),
(15, 'Freha', 'فريحة', 1504),
(15, 'Souamaa', 'الصوامع', 1505),
(15, 'Mechtrass', 'مشطراس', 1506),
(15, 'Irdjen', 'ارجن', 1507),
(15, 'Timizart', 'تيميزارت', 1508),
(15, 'Makouda', 'ماكودة', 1509),
(15, 'Draa El Mizan', 'ذراع الميزان', 1510),
(15, 'Tizi Ghenif', 'تيزي غنيف', 1511),
(15, 'Bounouh', 'بونوح', 1512),
(15, 'Ait Chaffaa', 'آيت شفعة', 1513),
(15, 'Frikat', 'فريقات', 1514),
(15, 'Beni Aissi', 'بني عيسى', 1515),
(15, 'Beni Zmenzer', 'بني زمنزر', 1516),
(15, 'Iferhounene', 'ايفرحونن', 1517),
(15, 'Azazga', 'عزازقة', 1518),
(15, 'Iloula Oumalou', 'ايلولة امالو', 1519),
(15, 'Yakouren', 'يعكورن', 1520),
(15, 'Larba Nait Irathen', 'الأربعات نايت ايرثن', 1521),
(15, 'Tizi Rached', 'تيزي راشد', 1522),
(15, 'Zekri', 'زكري', 1523),
(15, 'Ouaguenoun', 'واقنون', 1524),
(15, 'Ain Zaouia', 'عين الزاوية', 1525),
(15, 'Mkira', 'مكيرة', 1526),
(15, 'Ait Yahia', 'آيت يحي', 1527),
(15, 'Ait Mahmoud', 'آيت محمود', 1528),
(15, 'Maatka', 'المعاتقة', 1529),
(15, 'Ait Boumehdi', 'آيت بومهدي', 1530),
(15, 'Abi Youcef', 'أبي يوسف', 1531),
(15, 'Beni Douala', 'بني دوالة', 1532),
(15, 'Illilten', 'أليلتين', 1533),
(15, 'Bouzguen', 'بوزغن', 1534),
(15, 'Ait Aggouacha', 'آيت قواشة', 1535),
(15, 'Ouadhia', 'واضية', 1536),
(15, 'Azzefoun', 'أزفون', 1537),
(15, 'Tigzirt', 'تيقزيرت', 1538),
(15, 'Ait Aissa Mimoun', 'جبل عيسى ميمون', 1539),
(15, 'Boghni', 'بوغني', 1540),
(15, 'Ifigha', 'إيفيغات', 1541),
(15, 'Ait Oumalou', 'آيت اومالو', 1542),
(15, 'Tirmitine', 'تيرمتين', 1543),
(15, 'Akerrou', 'أقرو', 1544),
(15, 'Yatafen', 'ياطفان', 1545),
(15, 'Beni Ziki', 'بني زيكي', 1546),
(15, 'Draa Ben Khedda', 'ذراع بن خدة', 1547),
(15, 'Ouacif', 'واسيف', 1548),
(15, 'Idjeur', 'أجر', 1549),
(15, 'Mekla', 'مقلة', 1550),
(15, 'Tizi Nthlata', 'تيزي نثلاثة', 1551),
(15, 'Beni Yenni', 'بني يني', 1552),
(15, 'Aghrib', 'اغريب', 1553),
(15, 'Iflissen', 'افليسن', 1554),
(15, 'Boudjima', 'بوجيمة', 1555),
(15, 'Ait Yahia Moussa', 'وادي قصاري', 1556),
(15, 'Souk El Thenine', 'سوق الاثنين', 1557),
(15, 'Ait Khelil', 'آيت خليلي', 1558),
(15, 'Sidi Naamane', 'سيدي نعمان', 1559),
(15, 'Iboudraren', 'ابودرارن', 1560),
(15, 'Aghni Goughran', 'اقني قغران', 1561),
(15, 'Mizrana', 'مزرانة', 1562),
(15, 'Imsouhal', 'امسوحال', 1563),
(15, 'Tadmait', 'تادمايت', 1564),
(15, 'Ait Bouadou', 'آيت بوعد', 1565),
(15, 'Assi Youcef', 'أسي يوسف', 1566),
(15, 'Ait Toudert', 'أيت تودرت', 1567),
(16, 'Alger Centre', 'الجزائر الوسطى', 1601),
(16, 'Sidi Mhamed', 'سيدي امحمد', 1602),
(16, 'El Madania', 'المدنية', 1603),
(16, 'Hamma Anassers', 'بلوزداد', 1604),
(16, 'Bab El Oued', 'باب الوادي', 1605),
(16, 'Bologhine Ibn Ziri', 'بولوغين', 1606),
(16, 'Casbah', 'القصبة', 1607),
(16, 'Oued Koriche', 'وادي قريش', 1608),
(16, 'Bir Mourad Rais', 'بئر مراد رايس', 1609),
(16, 'El Biar', 'الأبيار', 1610),
(16, 'Bouzareah', 'بوزريعة', 1611),
(16, 'Birkhadem', 'بئر خادم', 1612),
(16, 'El Harrach', 'الحراش', 1613),
(16, 'Baraki', 'براقي', 1614),
(16, 'Oued Smar', 'وادي السمار', 1615),
(16, 'Bourouba', 'بوروبة', 1616),
(16, 'Hussein Dey', 'حسين داي', 1617),
(16, 'Kouba', 'القبة', 1618),
(16, 'Bachedjerah', 'باش جراح', 1619),
(16, 'Dar El Beida', 'الدار البيضاء', 1620),
(16, 'Bab Azzouar', 'باب الزوار', 1621),
(16, 'Ben Aknoun', 'بن عكنون', 1622),
(16, 'Dely Ibrahim', 'دالي إبراهيم', 1623),
(16, 'Bains Romains', 'الحمامات', 1624),
(16, 'Rais Hamidou', 'رايس حميدو', 1625),
(16, 'Djasr Kasentina', 'جسر قسنطينة', 1626),
(16, 'El Mouradia', 'المرادية', 1627),
(16, 'Hydra', 'حيدرة', 1628),
(16, 'Mohammadia', 'المحمدية', 1629),
(16, 'Bordj El Kiffan', 'برج الكيفان', 1630),
(16, 'El Magharia', 'المغارية', 1631),
(16, 'Beni Messous', 'بني مسوس', 1632),
(16, 'Les Eucalyptus', 'الكاليتوس', 1633),
(16, 'Birtouta', 'بئر توتة', 1636),
(16, 'Tassala El Merdja', 'تسالة المرجة', 1634),
(16, 'Ouled Chebel', 'أولاد شبل', 1635),
(16, 'Sidi Moussa', 'سيدي موسى', 1637),
(16, 'Ain Taya', 'عين طاية', 1641),
(16, 'Bordj El Bahri', 'برج البحري', 1642),
(16, 'Marsa', 'المرسى', 1643),
(16, 'Haraoua', 'هراوة', 1639),
(16, 'Rouiba', 'الرويبة', 1638),
(16, 'Reghaia', 'الرغاية', 1640),
(16, 'Ain Benian', 'عين البنيان', 1657),
(16, 'Staoueli', 'اسطاوالي', 1653),
(16, 'Zeralda', 'زرالدة', 1644),
(16, 'Mahelma', 'المحالمة', 1646),
(16, 'Rahmania', 'الرحمانية', 1650),
(16, 'Souidania', 'السويدانية', 1655),
(16, 'Cheraga', 'الشراقة', 1652),
(16, 'Ouled Fayet', 'اولاد فايت', 1651),
(16, 'El Achour', 'العاشور', 1654),
(16, 'Draria', 'الدرارية', 1649),
(16, 'Douera', 'الدويرة', 1648),
(16, 'Baba Hassen', 'باباحسن', 1647),
(16, 'Khracia', 'الخرايسية', 1656),
(16, 'Saoula', 'السحاولة', 1645),
(17, 'Djelfa', 'الجلفة', 1701),
(17, 'Moudjebara', 'مجبارة', 1702),
(17, 'El Guedid', 'القديد', 1703),
(17, 'Hassi Bahbah', 'حاسي بحبح', 1704),
(17, 'Ain Maabed', 'عين معبد', 1705),
(17, 'Sed Rahal', 'سد رحال', 1706),
(17, 'Feidh El Botma', 'فيض البطمة', 1707),
(17, 'Birine', 'بيرين', 1708),
(17, 'Bouira Lahdeb', 'بويرة الاحداب', 1709),
(17, 'Zaccar', 'زكار', 1710),
(17, 'El Khemis', 'الخميس', 1711),
(17, 'Sidi Baizid', 'سيدي بايزيد', 1712),
(17, 'Mliliha', 'مليليحة', 1713),
(17, 'El Idrissia', 'الادريسية', 1714),
(17, 'Douis', 'دويس', 1715),
(17, 'Hassi El Euch', 'حاسي العش', 1716),
(17, 'Messaad', 'مسعد', 1717),
(17, 'Guettara', 'قطارة', 1718),
(17, 'Sidi Ladjel', 'سيدي لعجال', 1719),
(17, 'Had Sahary', 'حد الصحاري', 1720),
(17, 'Guernini', 'قرنيني', 1721),
(17, 'Selmana', 'سلمانة', 1722),
(17, 'Ain Chouhada', 'عين الشهدات', 1723),
(17, 'Oum Laadham', 'ام لعظام', 1724),
(17, 'Dar Chouikh', 'دار الشيوخ', 1725),
(17, 'Charef', 'الشارف', 1726),
(17, 'Beni Yacoub', 'بن يعقوب', 1727),
(17, 'Zaafrane', 'زعفران', 1728),
(17, 'Deldoul', 'دلدول', 1729),
(17, 'Ain El Ibel', 'عين الابل', 1730),
(17, 'Ain Oussera', 'عين وسارة', 1731),
(17, 'Benhar', 'بنهار', 1732),
(17, 'Hassi Fedoul', 'حاسي فدول', 1733),
(17, 'Amourah', 'عمورة', 1734),
(17, 'Ain Fekka', 'عين فقة', 1735),
(17, 'Tadmit', 'تعظميت', 1736),
(18, 'Jijel', 'جيجل', 1801),
(18, 'Erraguene', 'أراقن', 1802),
(18, 'El Aouana', 'العوانة', 1803),
(18, 'Ziamma Mansouriah', 'زيامة منصورية', 1804),
(18, 'Taher', 'الطاهير', 1805),
(18, 'Emir Abdelkader', 'الأمير عبد القادر', 1806),
(18, 'Chekfa', 'الشقفة', 1807),
(18, 'Chahna', 'الشحنة', 1808),
(18, 'El Milia', 'الميلية', 1809),
(18, 'Sidi Maarouf', 'سيدي معروف', 1810),
(18, 'Settara', 'السطارة', 1811),
(18, 'El Ancer', 'العنصر', 1812),
(18, 'Sidi Abdelaziz', 'سيدي عبد العزيز', 1813),
(18, 'Kaous', 'قاوس', 1814),
(18, 'Ghebala', 'غبالة', 1815),
(18, 'Bouraoui Belhadef', 'بوراوي بلهادف', 1816),
(18, 'Djmila', 'جيملة', 1817),
(18, 'Selma Benziada', 'سلمى بن زياد', 1818),
(18, 'Boussif Ouled Askeur', 'بوسيف اولاد عسكر', 1819),
(18, 'El Kennar Nouchfi', 'القنار نوشفي', 1820),
(18, 'Ouled Yahia Khadrouch', 'اولاد يحي خدروش', 1821),
(18, 'Boudria Beni Yadjis', 'بوذريعة بن ياجيس', 1822),
(18, 'Kemir Oued Adjoul', 'خير وادي عجول', 1823),
(18, 'Texena', 'تاكسنة', 1824),
(18, 'Djemaa Beni Habibi', 'الجمعة بني حبيبي', 1825),
(18, 'Bordj Taher', 'برج الطاهر', 1826),
(18, 'Ouled Rabah', 'أولاد رابح', 1827),
(18, 'Ouadjana', 'وجانة', 1828),
(19, 'Setif', 'سطيف', 1901),
(19, 'Ain El Kebira', 'العين الكبيرة', 1902),
(19, 'Beni Aziz', 'بني عزيز', 1903),
(19, 'Ouled Sidi Ahmed', 'أولاد سي أحمد', 1904),
(19, 'Boutaleb', 'بوطالب', 1905),
(19, 'Ain Roua', 'عين الروي', 1906),
(19, 'Draa Kebila', 'ذراع قبلة', 1907),
(19, 'Bir El Arch', 'بئر العرش', 1908),
(19, 'Beni Chebana', 'بني شبانة', 1909),
(19, 'Ouled Tebben', 'أولاد تبان', 1910),
(19, 'Hamma', 'الحامة', 1911),
(19, 'Maaouia', 'معاوية', 1912),
(19, 'Ain Legraj', 'عين لقراج', 1913),
(19, 'Ain Abessa', 'عين عباسة', 1914),
(19, 'Dehamcha', 'الدهامشة', 1915),
(19, 'Babor', 'بابور', 1916),
(19, 'Guidjel', 'قجال', 1917),
(19, 'Ain Lahdjar', 'عين الحجر', 1918),
(19, 'Bousselam', 'بوسلام', 1919),
(19, 'El Eulma', 'العلمة', 1920),
(19, 'Djemila', 'جميلة', 1921),
(19, 'Beni Ouartilane', 'بني ورتيلان', 1922),
(19, 'Rosfa', 'الرصفة', 1923),
(19, 'Ouled Addouane', 'أولاد عدوان', 1924),
(19, 'Belaa', 'بلعة', 1925),
(19, 'Ain Arnat', 'عين ارنات', 1926),
(19, 'Amoucha', 'عموشة', 1927),
(19, 'Ain Oulmane', 'عين ولمان', 1928),
(19, 'Beidha Bordj', 'بيضات برج', 1929),
(19, 'Bouandas', 'بوعنداس', 1930),
(19, 'Bazer Sakhra', 'بازر الصخرة', 1931),
(19, 'Hammam Essokhna', 'حمام السخنة', 1932),
(19, 'Mezloug', 'مزلوق', 1933),
(19, 'Bir Haddada', 'بئر حدادة', 1934),
(19, 'Serdj El Ghoul', 'سرج الغول', 1935),
(19, 'Harbil', 'حربيل', 1936),
(19, 'El Ouricia', 'الوريسية', 1937),
(19, 'Tizi Nbechar', 'تيزي نبشار', 1938),
(19, 'Salah Bey', 'صالح باي', 1939),
(19, 'Ain Azal', 'عين ازال', 1940),
(19, 'Guenzet', 'قنزات', 1941),
(19, 'Talaifacene', 'تالة إيفاسن', 1942),
(19, 'Bougaa', 'بوقاعة', 1943),
(19, 'Beni Fouda', 'بني فودة', 1944),
(19, 'Tachouda', 'تاشودة', 1945),
(19, 'Beni Mouhli', 'بني موحلي', 1946),
(19, 'Ouled Sabor', 'أولادصابر', 1947),
(19, 'Guellal', 'قلال', 1948),
(19, 'Ain Sebt', 'عين السبت', 1949),
(19, 'Hammam Guergour', 'حمام قرقور', 1950),
(19, 'Ait Naoual Mezada', 'آيت نوال مزادة', 1951),
(19, 'Ksar El Abtal', 'قصر الابطال', 1952),
(19, 'Beni Hocine', 'بني حسين', 1953),
(19, 'Ait Tizi', 'آيت تيزي', 1954),
(19, 'Maouklane', 'ماوكلان', 1955),
(19, 'Guelta Zerka', 'القلتة الزرقات', 1956),
(19, 'Oued El Barad', 'وادي البارد', 1957),
(19, 'Taya', 'الطاية', 1958),
(19, 'El Ouldja', 'الولجة', 1959),
(19, 'Tella', 'التلة', 1960),
(20, 'Saida', 'سعيدة', 2001),
(20, 'Doui Thabet', 'دوي ثابت', 2002),
(20, 'Ain El Hadjar', 'عين الحجر', 2003),
(20, 'Ouled Khaled', 'أولا خالد', 2004),
(20, 'Moulay Larbi', 'مولاي العربي', 2005),
(20, 'Youb', 'يوب', 2006),
(20, 'Hounet', 'حنات', 2007),
(20, 'Sidi Amar', 'سيدي عمار', 2008),
(20, 'Sidi Boubekeur', 'سيدي بوبكر', 2009),
(20, 'El Hassasna', 'الحساسنة', 2010),
(20, 'Maamora', 'المعمورة', 2011),
(20, 'Sidi Ahmed', 'سيدي أحمد', 2012),
(20, 'Ain Sekhouna', 'عين السخونة', 2013),
(20, 'Ouled Brahim', 'أولاد إبراهيم', 2014),
(20, 'Tircine', 'تيرسين', 2015),
(20, 'Ain Soltane', 'عين السلطان', 2016),
(21, 'Skikda', 'سكيكدة', 2101),
(21, 'Ain Zouit', 'عين زويت', 2102),
(21, 'El Hadaik', 'الحدائق', 2103),
(21, 'Azzaba', 'عزابة', 2104),
(21, 'Djendel Saadi Mohamed', 'جندل سعدي محمد', 2105),
(21, 'Ain Cherchar', 'عين شرشار', 2106),
(21, 'Bekkouche Lakhdar', 'بكوش الاخضر', 2107),
(21, 'Benazouz', 'بن عزوز', 2108),
(21, 'Es Sebt', 'السبت', 2109),
(21, 'Collo', 'القل', 2110),
(21, 'Beni Zid', 'بني زيد', 2111),
(21, 'Kerkera', 'الكركرة', 2112),
(21, 'Ouled Attia', 'أولاد عطية', 2113),
(21, 'Oued Zehour', 'وادي الزهور', 2114),
(21, 'Zitouna', 'الزيتونة', 2115),
(21, 'El Harrouch', 'الحروش', 2116),
(21, 'Zerdazas', 'زردازة', 2117),
(21, 'Ouled Hebaba', 'أولاد حبابة', 2118),
(21, 'Sidi Mezghiche', 'سيدي مزغيش', 2119),
(21, 'Emdjez Edchich', 'مجاز الدشيش', 2120),
(21, 'Beni Oulbane', 'بني ولبان', 2121),
(21, 'Ain Bouziane', 'عين بوزيان', 2122),
(21, 'Ramdane Djamel', 'رمضان جمال', 2123),
(21, 'Beni Bachir', 'بني بشير', 2124),
(21, 'Salah Bouchaour', 'صالح بوالشعور', 2125),
(21, 'Tamalous', 'تمالوس', 2126),
(21, 'Ain Kechra', 'عين قشرة', 2127),
(21, 'Oum Toub', 'أم الطوب', 2128),
(21, 'Bein El Ouiden', 'بين الويدان', 2129),
(21, 'Fil Fila', 'فلفيلة', 2130),
(21, 'Cheraia', 'الشرائع', 2131),
(21, 'Kanoua', 'قنواع', 2132),
(21, 'El Ghedir', 'الغدير', 2133),
(21, 'Bouchtata', 'بوشطاطة', 2134),
(21, 'Ouldja Boulbalout', 'الولجة بولبلوط', 2135),
(21, 'Kheneg Mayoum', 'خنق مايون', 2136),
(21, 'Hamadi Krouma', 'حمادي كرومة', 2137),
(21, 'El Marsa', 'المرسى', 2138),
(22, 'Sidi Bel Abbes', 'سيدي بلعباس', 2201),
(22, 'Tessala', 'تسالة', 2202),
(22, 'Sidi Brahim', 'سيدي إبراهيم', 2203),
(22, 'Mostefa Ben Brahim', 'مصطفى بن إبراهيم', 2204),
(22, 'Telagh', 'تلاغ', 2205),
(22, 'Mezaourou', 'مزوارو', 2206),
(22, 'Boukhanafis', 'بوخنيفيس', 2207),
(22, 'Sidi Ali Boussidi', 'سيدي علي بوسيدي', 2208),
(22, 'Badredine El Mokrani', 'بدر الدين المقراني', 2209),
(22, 'Marhoum', 'مرحوم', 2210),
(22, 'Tafissour', 'تافيسور', 2211),
(22, 'Amarnas', 'امرناس', 2212),
(22, 'Tilmouni', 'تلموني', 2213),
(22, 'Sidi Lahcene', 'سيدي لحسن', 2214),
(22, 'Ain Thrid', 'عين الثريد', 2215),
(22, 'Makedra', 'مقدرة', 2216),
(22, 'Tenira', 'تنيرة', 2217),
(22, 'Moulay Slissen', 'مولاي سليسن', 2218),
(22, 'El Hacaiba', 'الحصيبة', 2219),
(22, 'Hassi Zehana', 'حاسي زهانة', 2220),
(22, 'Tabia', 'طابية', 2221),
(22, 'Merine', 'مرين', 2222),
(22, 'Ras El Ma', 'راس المات', 2223),
(22, 'Ain Tindamine', 'عين تندمين', 2224),
(22, 'Ain Kada', 'عين قادة', 2225),
(22, 'Mcid', 'مسيد', 2226),
(22, 'Sidi Khaled', 'سيدي خالد', 2227),
(22, 'Ain El Berd', 'عين البرد', 2228),
(22, 'Sfissef', 'الزفيزف', 2229),
(22, 'Ain Adden', 'عين عدان', 2230),
(22, 'Oued Taourira', 'وادي توريرة', 2231),
(22, 'Dhaya', 'الضاية', 2232),
(22, 'Zerouala', 'زروالة', 2233),
(22, 'Lamtar', 'لمطار', 2234),
(22, 'Sidi Chaib', 'سيدي شعيب', 2235),
(22, 'Sidi Dahou Dezairs', 'سيدي دحو الزاير', 2236),
(22, 'Oued Sbaa', 'وادي السبع', 2237),
(22, 'Boudjebaa El Bordj', 'بوجبع البرج', 2238),
(22, 'Sehala Thaoura', 'سحالة ثاورة', 2239),
(22, 'Sidi Yacoub', 'سيدي يعقوب', 2240),
(22, 'Sidi Hamadouche', 'سيدي حمادوش', 2241),
(22, 'Belarbi', 'بلعربي', 2242),
(22, 'Oued Sefioun', 'وادي سفيون', 2243),
(22, 'Teghalimet', 'تغليمت', 2244),
(22, 'Ben Badis', 'ابن باديس', 2245),
(22, 'Sidi Ali Benyoub', 'سيدي علي بن يوب', 2246),
(22, 'Chetouane Belaila', 'شتوان بليلة', 2247),
(22, 'Bir El Hammam', 'بئر الحمام', 2248),
(22, 'Taoudmout', 'تاودموت', 2249),
(22, 'Redjem Demouche', 'رجم دموش', 2250),
(22, 'Benachiba Chelia', 'بن عشيبة شيلة', 2251),
(22, 'Hassi Dahou', 'حاسي دحو', 2252),
(23, 'Annaba', 'عنابة', 2301),
(23, 'Berrahel', 'برحال', 2302),
(23, 'El Hadjar', 'الحجار', 2303),
(23, 'Eulma', 'العلمة', 2304),
(23, 'El Bouni', 'البوني', 2305),
(23, 'Oued El Aneb', 'وادي العنب', 2306),
(23, 'Cheurfa', 'الشرفات', 2307),
(23, 'Seraidi', 'سرايدي', 2308),
(23, 'Ain Berda', 'العين الباردة', 2309),
(23, 'Chetaibi', 'شطايبي', 2310),
(23, 'Sidi Amer', 'سيد عامر', 2311),
(23, 'Treat', 'التريعات', 2312),
(24, 'Guelma', 'قالمة', 2401),
(24, 'Nechmaya', 'نشماية', 2402),
(24, 'Bouati Mahmoud', 'بوعاطي محمد', 2403),
(24, 'Oued Zenati', 'وادي الزناتي', 2404),
(24, 'Tamlouka', 'تاملوكة', 2405),
(24, 'Oued Fragha', 'وادي فراغا', 2406),
(24, 'Ain Sandel', 'عين صندل', 2407),
(24, 'Ras El Agba', 'رأس العقبة', 2408),
(24, 'Dahouara', 'الدهوارة', 2409),
(24, 'Belkhir', 'بلخير', 2410),
(24, 'Ben Djarah', 'بن جراح', 2411),
(24, 'Bou Hamdane', 'بوحمدان', 2412),
(24, 'Ain Makhlouf', 'عين مخلوف', 2413),
(24, 'Ain Ben Beida', 'عين بيضات', 2414),
(24, 'Khezara', 'خزارة', 2415),
(24, 'Beni Mezline', 'بني مزلين', 2416),
(24, 'Bou Hachana', 'بوحشانة', 2417),
(24, 'Guelaat Bou Sbaa', 'قلعة بوصبع', 2418),
(24, 'Hammam Maskhoutine', 'حمام دباغ', 2419),
(24, 'El Fedjoudj', 'الفجوج', 2420),
(24, 'Bordj Sabat', 'برج الصباط', 2421),
(24, 'Hamman Nbail', 'حمام النبايل', 2422),
(24, 'Ain Larbi', 'عين العربي', 2423),
(24, 'Medjez Amar', 'مجاز عمار', 2424),
(24, 'Bouchegouf', 'بوشقوف', 2425),
(24, 'Heliopolis', 'هيليو بوليس', 2426),
(24, 'Ain Hessania', 'عين الحساينية', 2427),
(24, 'Roknia', 'الركنية', 2428),
(24, 'Salaoua Announa', 'سلاوة عنوية', 2429),
(24, 'Medjez Sfa', 'مجار الصفات', 2430),
(24, 'Boumahra Ahmed', 'بومهرة احمد', 2431),
(24, 'Ain Reggada', 'عين رقادة', 2432),
(24, 'Oued Cheham', 'وادي الشحم', 2433),
(24, 'Djeballah Khemissi', 'جبالة الخميسي', 2434),
(25, 'Constantine', 'قسنطينة', 2501),
(25, 'Hamma Bouziane', 'حامة بوزيان', 2502),
(25, 'El Haria', 'الهرية', 2503),
(25, 'Zighoud Youcef', 'زيغود يوسف', 2504),
(25, 'Didouche Mourad', 'ديدوش مراد', 2505),
(25, 'El Khroub', 'الخروب', 2506),
(25, 'Ain Abid', 'عين عبيد', 2507),
(25, 'Beni Hamiden', 'بني حميدان', 2508),
(25, 'Ouled Rahmoune', 'أولاد رحمون', 2509),
(25, 'Ain Smara', 'عين السمارة', 2510),
(25, 'Mesaoud Boudjeriou', 'عين الكرمة', 2511),
(25, 'Ibn Ziad', 'ابن زياد', 2512),
(26, 'Medea', 'المدية', 2601),
(26, 'Ouzera', 'وزرة', 2602),
(26, 'Ouled Maaref', 'أولاد معرف', 2603),
(26, 'Ain Boucif', 'عين بوسيف', 2604),
(26, 'Aissaouia', 'العيساوية', 2605),
(26, 'Ouled Deide', 'أولاد دايد', 2606),
(26, 'El Omaria', 'العمرية', 2607),
(26, 'Derrag', 'دراق', 2608),
(26, 'El Guelbelkebir', 'القلب الكبير', 2609),
(26, 'Bouaiche', 'بوعيش', 2610),
(26, 'Mezerena', 'مزغنة', 2611),
(26, 'Ouled Brahim', 'أولاد إبراهيم', 2612),
(26, 'Damiat', 'دميات', 2613),
(26, 'Sidi Ziane', 'سيدي زيان', 2614),
(26, 'Tamesguida', 'تمسقيدة', 2615),
(26, 'El Hamdania', 'الحمدانية', 2616),
(26, 'Kef Lakhdar', 'الكاف الاخضر', 2617),
(26, 'Chelalet El Adhaoura', 'شلالة العذاورة', 2618),
(26, 'Bouskene', 'بوسكن', 2619),
(26, 'Rebaia', 'الربعية', 2620),
(26, 'Bouchrahil', 'بوشراحيل', 2621),
(26, 'Ouled Hellal', 'أولاد هلال', 2622),
(26, 'Tafraout', 'تفراوت', 2623),
(26, 'Baata', 'بعطة', 2624),
(26, 'Boghar', 'بوغار', 2625),
(26, 'Sidi Naamane', 'سيدي نعمان', 2626),
(26, 'Ouled Bouachra', 'أولاد بوعشرة', 2627),
(26, 'Sidi Zahar', 'سيدي زهار', 2628),
(26, 'Oued Harbil', 'وادي حربيل', 2629),
(26, 'Benchicao', 'بن شكاو', 2630),
(26, 'Sidi Damed', 'سيدي دامد', 2631),
(26, 'Aziz', 'عزيز', 2632),
(26, 'Souagui', 'السواقي', 2633),
(26, 'Zoubiria', 'الزبيرية', 2634),
(26, 'Ksar El Boukhari', 'قصر البخاري', 2635),
(26, 'El Azizia', 'العزيزية', 2636),
(26, 'Djouab', 'جواب', 2637),
(26, 'Chahbounia', 'الشهبونية', 2638),
(26, 'Meghraoua', 'مغراوة', 2639),
(26, 'Cheniguel', 'شنيقل', 2640),
(26, 'Ain Ouksir', 'عين القصير', 2641),
(26, 'Oum El Djalil', 'أم الجليل', 2642),
(26, 'Ouamri', 'عوامري', 2643),
(26, 'Si Mahdjoub', 'سي المحجوب', 2644),
(26, 'Tlatet Eddoair', 'ثلاثة دوائر', 2645),
(26, 'Beni Slimane', 'بني سليمان', 2646),
(26, 'Berrouaghia', 'البرواقية', 2647),
(26, 'Seghouane', 'سغوان', 2648),
(26, 'Meftaha', 'مفتاح', 2649),
(26, 'Mihoub', 'ميهوب', 2650),
(26, 'Boughezoul', 'بوغزول', 2651),
(26, 'Tablat', 'تابلاط', 2652),
(26, 'Deux Bassins', 'الحوضان', 2653),
(26, 'Draa Essamar', 'ذراع السمار', 2654),
(26, 'Sidi Errabia', 'سيدي الربيع', 2655),
(26, 'Bir Ben Laabed', 'بئر بن عابد', 2656),
(26, 'El Ouinet', 'العوينات', 2657),
(26, 'Ouled Antar', 'أولاد عنتر', 2658),
(26, 'Bouaichoune', 'بوعيشون', 2659),
(26, 'Hannacha', 'حناشة', 2660),
(26, 'Sedraia', 'سدراية', 2661),
(26, 'Medjebar', 'مجبر', 2662),
(26, 'Khams Djouamaa', 'خمس جوامع', 2663),
(26, 'Saneg', 'السانق', 2664),
(27, 'Mostaganem', 'مستغانم', 2701),
(27, 'Sayada', 'صيادة', 2702),
(27, 'Fornaka', 'فرناكة', 2703),
(27, 'Stidia', 'ستيدية', 2704),
(27, 'Ain Nouissy', 'عين نويسي', 2705),
(27, 'Hassi Maameche', 'حاسي ماماش', 2706),
(27, 'Ain Tadles', 'عين تادلس', 2707),
(27, 'Sour', 'الصور', 2708),
(27, 'Oued El Kheir', 'واد الخير', 2709),
(27, 'Sidi Bellater', 'سيدي بلعطار', 2710),
(27, 'KheiredineÂ ', 'خير الدين', 2711),
(27, 'Sidi Ali', 'سيد علي', 2712),
(27, 'Abdelmalek Ramdane', 'عبدالمالك رمضان', 2713),
(27, 'Hadjadj', 'حجاج', 2714),
(27, 'Nekmaria', 'نكمارية', 2715),
(27, 'Sidi Lakhdar', 'سيدي لخضر', 2716),
(27, 'Achaacha', 'عشعاشة', 2717),
(27, 'Khadra', 'خضرة', 2718),
(27, 'Bouguirat', 'بوقيراط', 2719),
(27, 'Sirat', 'سيرات', 2720),
(27, 'Ain Sidi Cherif', 'عين سيدي الشريف', 2721),
(27, 'Mesra', 'ماسرة', 2722),
(27, 'Mansourah', 'منصورة', 2723),
(27, 'Souaflia', 'السوافلية', 2724),
(27, 'Ouled Boughalem', 'أولاد بوغالم', 2725),
(27, 'Ouled Maallah', 'أولاد مع اللّه', 2726),
(27, 'Mezghrane', 'مزغران', 2727),
(27, 'Ain Boudinar', 'عين بودينار', 2728),
(27, 'Tazgait', 'تزقايت', 2729),
(27, 'Safsaf', 'الصفصاف', 2730),
(27, 'Touahria', 'الطواهرية', 2731),
(27, 'El Hassiane', 'الحسيان', 2732),
(28, 'Msila', 'المسيلة', 2801),
(28, 'Maadid', 'المعاضيد', 2802),
(28, 'Hammam Dhalaa', 'حمام الضلعة', 2803),
(28, 'Ouled Derradj', 'أولاد دراج', 2804),
(28, 'Tarmount', 'تارمونت', 2805),
(28, 'Mtarfa', 'المطارفة', 2806),
(28, 'Khoubana', 'خبانة', 2807),
(28, 'Mcif', 'مصيف', 2808),
(28, 'Chellal', 'شلال', 2809),
(28, 'Ouled Madhi', 'اولاد ماضي', 2810),
(28, 'Magra', 'مقرة', 2811),
(28, 'Berhoum', 'برهوم', 2812),
(28, 'Ain Khadra', 'عين خضرات', 2813),
(28, 'Ouled Addi Guebala', 'أولاد عدي قبالة', 2814),
(28, 'Belaiba', 'بلعايبة', 2815),
(28, 'Sidi Aissa', 'سيدي عيسى', 2816),
(28, 'Ain El Hadjel', 'عين الحجل', 2817),
(28, 'Sidi Hadjeres', 'سيدي هجرس', 2818),
(28, 'Ouanougha', 'ونوغة', 2819),
(28, 'Bou Saada', 'بوسعادة', 2820),
(28, 'Ouled Sidi Brahim', 'أولاد سيدي إبراهيم', 2821),
(28, 'Sidi Ameur', 'سيدي عامر', 2822),
(28, 'Tamsa', 'تامسة', 2823),
(28, 'Ben Srour', 'إبن سرور', 2824),
(28, 'Ouled Slimane', 'أولاد سليمان', 2825),
(28, 'El Houamed', 'الخوامد', 2826),
(28, 'El Hamel', 'الهامل', 2827),
(28, 'Ouled Mansour', 'أولاد منصور', 2828),
(28, 'Maarif', 'معاريف', 2829),
(28, 'Dehahna', 'دهاهنة', 2830),
(28, 'Bouti Sayah', 'بوطي السياح', 2831),
(28, 'Khettouti Sed Djir', 'ختوتي سد الجير', 2832),
(28, 'Zarzour', 'زرزور', 2833),
(28, 'Oued Chair', 'وادي الشعير', 2834),
(28, 'Benzouh', 'بن زوح', 2835),
(28, 'Bir Foda', 'بئر الفضة', 2836),
(28, 'Ain Fares', 'عين فارس', 2837),
(28, 'Sidi Mhamed', 'سيدي محمد', 2838),
(28, 'Ouled Atia', 'أولاد عطية', 2839),
(28, 'Souamaa', 'الصوامع', 2840),
(28, 'Ain El Melh', 'عين الملح', 2841),
(28, 'Medjedel', 'مجدل', 2842),
(28, 'Slim', 'سليم', 2843),
(28, 'Ain Errich', 'عين الريش', 2844),
(28, 'Beni Ilmane', 'بني يلمان', 2845),
(28, 'Oultene', 'ولتام', 2846),
(28, 'Djebel Messaad', 'جبل مسعد', 2847),
(29, 'Mascara', 'معسكر', 2901),
(29, 'Bou Hanifia', 'بوحنيفية', 2902),
(29, 'Tizi', 'تيزي', 2903),
(29, 'Hacine', 'حسين', 2904),
(29, 'Maoussa', 'ماوسة', 2905),
(29, 'Teghennif', 'تيغنيف', 2906),
(29, 'El Hachem', 'الهاشم', 2907),
(29, 'Sidi Kada', 'سيدي قادة', 2908),
(29, 'Zelmata', 'امحاميد', 2909),
(29, 'Oued El Abtal', 'وادي الابطال', 2910),
(29, 'Ain Ferah', 'عين فراح', 2911),
(29, 'Ghriss', 'غريس', 2912),
(29, 'Froha', 'فروحة', 2913),
(29, 'Matemore', 'المطمور', 2914),
(29, 'Makdha', 'ماقضنة', 2915),
(29, 'Sidi Boussaid', 'سيدي بوسعيد', 2916),
(29, 'El Bordj', 'البرج', 2917),
(29, 'Ain Fekan', 'عين فكان', 2918),
(29, 'Benian', 'بنيان', 2919),
(29, 'Khalouia', 'خلوية', 2920),
(29, 'El Menaouer', 'المنور', 2921),
(29, 'Oued Taria', 'وادي تاغية', 2922),
(29, 'Aouf', 'عوف', 2923),
(29, 'Ain Fares', 'عين فارس', 2924),
(29, 'Ain Frass', 'عين فرس', 2925),
(29, 'Sig', 'سيق', 2926),
(29, 'Oggaz', 'عكاز', 2927),
(29, 'Alaimia', 'العلايمية', 2928),
(29, 'El Gaada', 'القعدة', 2929),
(29, 'Zahana', 'زهانة', 2930),
(29, 'Mohammadia', 'المحمدية', 2931),
(29, 'Sidi Abdelmoumene', 'سيدي عبد المومن', 2932),
(29, 'Ferraguig', 'فراقيق', 2933),
(29, 'El Ghomri', 'الغمري', 2934),
(29, 'Sedjerara', 'سجرارة', 2935),
(29, 'Moctadouz', 'مقطع الدوز', 2936),
(29, 'Bou Henni', 'بوهني', 2937),
(29, 'Guettena', 'القطنة', 2938),
(29, 'El Mamounia', 'المأمونية', 2939),
(29, 'El Keurt', 'القرط', 2940),
(29, 'Gharrous', 'غريس', 2941),
(29, 'Gherdjoum', 'قرجوم', 2942),
(29, 'Chorfa', 'الشرفات', 2943),
(29, 'Ras Ain Amirouche', 'رأس عين عميروش', 2944),
(29, 'Nesmot', 'نسموط', 2945),
(29, 'Sidi Abdeldjebar', 'سيدي عبد الجبار', 2946),
(29, 'Sehailia', 'السحايلية', 2947),
(30, 'Ouargla', 'ورقلة', 3001),
(30, 'Ain Beida', 'عين البيضات', 3002),
(30, 'Ngoussa', 'نقوسة', 3003),
(30, 'Hassi Messaoud', 'حاسي مسعود', 3004),
(30, 'Rouissat', 'الرويسات', 3005),
(30, 'Balidat Ameur', 'بلدية عامر', 3006),
(30, 'Tebesbest', 'تبسبست', 3007),
(30, 'Nezla', 'نزلة', 3008),
(30, 'Zaouia El Abidia', 'الزاوية العابدية', 3009),
(30, 'Sidi Slimane', 'سيدي سليمان', 3010),
(30, 'Sidi Khouiled', 'سيدي خويلد', 3011),
(30, 'Hassi Ben Abdellah', 'حاسي بن عبد الله', 3012),
(30, 'Touggourt', 'توقرت', 3013),
(30, 'El Hadjira', 'الحجيرة', 3014),
(30, 'Taibet', 'الطيبات', 3015),
(30, 'Tamacine', 'تماسين', 3016),
(30, 'Benaceur', 'ابن ناصر', 3017),
(30, 'Mnaguer', 'المنقر', 3018),
(30, 'Megarine', 'المقارين', 3019),
(30, 'El Allia', 'العالية', 3020),
(30, 'El Borma', 'البرمة', 3021),
(31, 'Oran', 'وهران', 3101),
(31, 'Gdyel', 'قديل', 3102),
(31, 'Bir El Djir', 'بئر الجير', 3103),
(31, 'Hassi Bounif', 'حاسي بونيف', 3104),
(31, 'Es Senia', 'السانية', 3105),
(31, 'Arzew', 'ارزيو', 3106),
(31, 'Bethioua', 'بطيوة', 3107),
(31, 'Marsat El Hadjadj', 'مرسى الحجاج', 3108),
(31, 'Ain Turk', 'عين الترك', 3109),
(31, 'El Ancar', 'العنصر', 3110),
(31, 'Oued Tlelat', 'وادي تليلات', 3111),
(31, 'Tafraoui', 'طفراوي', 3112),
(31, 'Sidi Chami', 'سيدي الشحمي', 3113),
(31, 'Boufatis', 'بوفاتيس', 3114),
(31, 'Mers El Kebir', 'المرسى الكبير', 3115),
(31, 'Bousfer', 'بوصفر', 3116),
(31, 'El Karma', 'الكرمة', 3117),
(31, 'El Braya', 'البرية', 3118),
(31, 'Hassi Ben Okba', 'حاسي بن عقبة', 3119),
(31, 'Ben Freha', 'بن فريحة', 3120),
(31, 'Hassi Mefsoukh', 'حاسي مفسوخ', 3121),
(31, 'Sidi Ben Yabka', 'سيدي بن يبقى', 3122),
(31, 'Messerghin', 'مسرغين', 3123),
(31, 'Boutlelis', 'بوتليليس', 3124),
(31, 'Ain Kerma', 'عين الكرمة', 3125),
(31, 'Ain Biya', 'عين البية', 3126),
(32, 'El Bayadh', 'البيض', 3201),
(32, 'Rogassa', 'روقاصة', 3202),
(32, 'Stitten', 'ستيتن', 3203),
(32, 'Brezina', 'بريزينة', 3204),
(32, 'Ghassoul', 'غسول', 3205),
(32, 'Boualem', 'بوعلام', 3206),
(32, 'El Abiodh Sidi Cheikh', 'الابيض سيدي الشيخ', 3207),
(32, 'Ain El Orak', 'عين العراك', 3208),
(32, 'Arbaouat', 'عرباوة', 3209),
(32, 'Bougtoub', 'بوقطب', 3210),
(32, 'El Kheither', 'الخثير', 3211),
(32, 'Kef El Ahmar', 'كاف الاحمر', 3212),
(32, 'Boussemghoun', 'بوسمغون', 3213),
(32, 'Chellala', 'شلالة', 3214),
(32, 'Krakda', 'كراكدة', 3215),
(32, 'El Bnoud', 'البنود', 3216),
(32, 'Cheguig', 'الشقيق', 3217),
(32, 'Sidi Ameur', 'سيدي عامر', 3218),
(32, 'El Mehara', 'المهارة', 3219),
(32, 'Tousmouline', 'توسمولين', 3220),
(32, 'Sidi Slimane', 'سيدي سليمان', 3221),
(32, 'Sidi Tifour', 'سيدي تيفور', 3222),
(33, 'Illizi', 'إليزي', 3301),
(33, 'Djanet', 'جانت', 3302),
(33, 'Debdeb', 'دبداب', 3303),
(33, 'Bordj Omar Driss', 'برج عمردريس', 3304),
(33, 'Bordj El Haouasse', 'برج الحواس', 3305),
(33, 'In Amenas', 'ان اميناس', 3306),
(34, 'Bordj Bou Arreridj', 'برج بوعريريج', 3401),
(34, 'Ras El Oued', 'راس الوادي', 3402),
(34, 'Bordj Zemoura', 'برج زمورة', 3403),
(34, 'Mansoura', 'المنصورة', 3404),
(34, 'El Mhir', 'المهير', 3405),
(34, 'Ben Daoud', 'بن داود', 3406),
(34, 'El Achir', 'الياشير', 3407),
(34, 'Ain Taghrout', 'عين تاغروت', 3408),
(34, 'Bordj Ghdir', 'برج غدير', 3409),
(34, 'Sidi Embarek', 'سيدي مبارك', 3410),
(34, 'El Hamadia', 'الحمادية', 3411),
(34, 'Belimour', 'بليمور', 3412),
(34, 'Medjana', 'مجانة', 3413),
(34, 'Teniet En Nasr', 'ثنية النصر', 3414),
(34, 'Djaafra', 'الجعافيرة', 3415),
(34, 'El Main', 'الماين', 3416),
(34, 'Ouled Brahem', 'اولاد إبراهيم', 3417),
(34, 'Ouled Dahmane', 'اولاد دحمان', 3418),
(34, 'Hasnaoua', 'حساوة', 3419),
(34, 'Khelil', 'خليل', 3420),
(34, 'Taglait', 'تقلعيت', 3421),
(34, 'Ksour', 'القصور', 3422),
(34, 'Ouled Sidi Brahim', 'اولاد سيدي إبراهيم', 3423),
(34, 'Tafreg', 'تفرق', 3424),
(34, 'Colla', 'القلة', 3425),
(34, 'Tixter', 'تيكستير', 3426),
(34, 'El Ach', 'العش', 3427),
(34, 'El Anseur', 'العنصر', 3428),
(34, 'Tesmart', 'تسمرت', 3429),
(34, 'Ain Tesra', 'عين تسرت', 3430),
(34, 'Bir Kasdali', 'بئر قصد علي', 3431),
(34, 'Ghilassa', 'غيلاسة', 3432),
(34, 'Rabta', 'الرابطة', 3433),
(34, 'Haraza', 'حرازة', 3434),
(35, 'Boumerdes', 'بومرداس', 3501),
(35, 'Boudouaou', 'بودواو', 3502),
(35, 'Afir', 'افير', 3503),
(35, 'Bordj Menaiel', 'برج منايل', 3504),
(35, 'Baghlia', 'بغلية', 3505),
(35, 'Sidi Daoud', 'سيدي داود', 3506),
(35, 'Naciria', 'الناصرية', 3507),
(35, 'Djinet', 'جينات', 3508),
(35, 'Isser', 'يسر', 3509),
(35, 'Zemmouri', 'زموري', 3510),
(35, 'Si Mustapha', 'سي مصطفى', 3511),
(35, 'Tidjelabine', 'تجلبين', 3512),
(35, 'Chabet El Ameur', 'شعبة العامر', 3513),
(35, 'Thenia', 'الثنية', 3514),
(35, 'Timezrit', 'تمزريت', 3515),
(35, 'Corso', 'قورصو', 3516),
(35, 'Ouled Moussa', 'اولاد موسى', 3517),
(35, 'Larbatache', 'الاربعطاش', 3518),
(35, 'Bouzegza Keddara', 'بوزقزة قدارة', 3519),
(35, 'Taourga', 'تورقة', 3520),
(35, 'Ouled Aissa', 'اولاد عيسى', 3521),
(35, 'Ben Choud', 'بني شود', 3522),
(35, 'Dellys', 'دلس', 3523),
(35, 'Ammal', 'عمال', 3524),
(35, 'Beni Amrane', 'بني عمران', 3525),
(35, 'Souk El Had', 'سوق الاحد', 3526),
(35, 'Boudouaou El Bahri', 'بدواو البحري', 3527),
(35, 'Ouled Hedadj', 'اولاد هداج', 3528),
(35, 'Laghata', 'لقاطة', 3529),
(35, 'Hammedi', 'حمادي', 3530),
(35, 'Khemis El Khechna', 'خميس الخشنة', 3531),
(35, 'El Kharrouba', 'الخروبة', 3532),
(36, 'El Tarf', 'الطارف', 3601),
(36, 'Bouhadjar', 'بوحجار', 3602),
(36, 'Ben Mhidi', 'ابن مهيدي', 3603),
(36, 'Bougous', 'بوقوس', 3604),
(36, 'El Kala', 'القالة', 3605),
(36, 'Ain El Assel', 'عين العسل', 3606),
(36, 'El Aioun', 'العيون', 3607),
(36, 'Bouteldja', 'بوثلجة', 3608),
(36, 'Souarekh', 'السوارخ', 3609),
(36, 'Berrihane', 'برحال', 3610),
(36, 'Lac Des Oiseaux', 'بحيرة الطيور', 3611),
(36, 'Chefia', 'الشافية', 3612),
(36, 'Drean', 'الذرعان', 3613),
(36, 'Chihani', 'شهاني', 3614),
(36, 'Chebaita Mokhtar', 'شبايطة مختار', 3615),
(36, 'Besbes', 'البسباس', 3616),
(36, 'Asfour', 'عصفور', 3617),
(36, 'Echatt', 'بني عمار', 3618),
(36, 'Zerizer', 'زريزر', 3619),
(36, 'Zitouna', 'الزيتونة', 3620),
(36, 'Ain Kerma', 'عين الكرمة', 3621),
(36, 'Oued Zitoun', 'وادي الزيتون', 3622),
(36, 'Hammam Beni Salah', 'حمام بن صالح', 3623),
(36, 'Raml Souk', 'رمل السوق', 3624),
(37, 'Tindouf', 'تيندوف', 3701),
(37, 'Oum El Assel', 'ام العسل', 3702),
(38, 'Tissemsilt', 'تيسمسيلت', 3801),
(38, 'Bordj Bou Naama', 'برج بونعامة', 3802),
(38, 'Theniet El Had', 'ثنية الحد', 3803),
(38, 'Lazharia', 'الأزهرية', 3804),
(38, 'Beni Chaib', 'بني شعيب', 3805),
(38, 'Lardjem', 'الأرجم', 3806),
(38, 'Melaab', 'ملعب', 3807),
(38, 'Sidi Lantri', 'سيدي العنتري', 3808),
(38, 'Bordj El Emir Abdelkader', 'برج الامير عبد القاد', 3809),
(38, 'Layoune', 'العيون', 3810),
(38, 'Khemisti', 'خميستي', 3811),
(38, 'Ouled Bessem', 'اولاد بسام', 3812),
(38, 'Ammari', 'عماري', 3813),
(38, 'Youssoufia', 'وادي الغرقة', 3814),
(38, 'Sidi Boutouchent', 'سيدي بوتوشنت', 3815),
(38, 'Larbaa', 'الأربعات', 3816),
(38, 'Maasem', 'المعاصم', 3817),
(38, 'Sidi Abed', 'سيدي عابد', 3818),
(38, 'Tamalaht', 'تاملاحت', 3819),
(38, 'Sidi Slimane', 'سيدي سليمان', 3820),
(38, 'Boucaid', 'بوقايد', 3821),
(38, 'Beni Lahcene', 'بني الحسن', 3822),
(39, 'El Oued', 'الوادي', 3901),
(39, 'Robbah', 'رباح', 3902),
(39, 'Oued El Alenda', 'وادي العلندة', 3903),
(39, 'Bayadha', 'البياضة', 3904),
(39, 'Nakhla', 'النخلة', 3905),
(39, 'Guemar', 'قمار', 3906),
(39, 'Kouinine', 'كوينين', 3907),
(39, 'Reguiba', 'الرقيبة', 3908),
(39, 'Hamraia', 'حمراية', 3909),
(39, 'Taghzout', 'تاغزوت', 3910),
(39, 'Debila', 'الدبيلة', 3911),
(39, 'Hassani Abdelkrim', 'حساني عبد الكريم', 3912),
(39, 'Hassi Khelifa', 'حاسي خليفة', 3913),
(39, 'Taleb Larbi', 'طالب العربي', 3914),
(39, 'Douar El Ma', 'دوار المات', 3915),
(39, 'Sidi Aoun', 'سيدي عون', 3916),
(39, 'Trifaoui', 'تريفاوي', 3917),
(39, 'Magrane', 'المقرن', 3918),
(39, 'Beni Guecha', 'بني قشة', 3919),
(39, 'Ourmas', 'ورماس', 3920),
(39, 'Still', 'سطيل', 3921),
(39, 'Mrara', 'مرارة', 3922),
(39, 'Sidi Khellil', 'سيدي خليل', 3923),
(39, 'Tendla', 'تندلة', 3924),
(39, 'El Ogla', 'العقلة', 3925),
(39, 'Mih Ouansa', 'ميه ونسى', 3926),
(39, 'El Mghair', 'المغير', 3927),
(39, 'Djamaa', 'جامعة', 3928),
(39, 'Oum Touyour', 'أم الطيور', 3929),
(39, 'Sidi Amrane', 'سيدي عمران', 3930),
(40, 'Khenchela', 'خنشلة', 4001),
(40, 'Mtoussa', 'متوسطة', 4002),
(40, 'Kais', 'قايس', 4003),
(40, 'Baghai', 'بغاي', 4004),
(40, 'El Hamma', 'الحامة', 4005),
(40, 'Ain Touila', 'عين الطويلة', 4006),
(40, 'Taouzianat', 'تاوزيانت', 4007),
(40, 'Bouhmama', 'بوحمامة', 4008),
(40, 'El Oueldja', 'الولجة', 4009),
(40, 'Remila', 'الريملة', 4010),
(40, 'Cherchar', 'ششار', 4011),
(40, 'Djellal', 'جلال', 4012),
(40, 'Babar', 'ببار', 4013),
(40, 'Tamza', 'تامزة', 4014),
(40, 'Ensigha', 'انسيغة', 4015),
(40, 'Ouled Rechache', 'أولاد رشاش', 4016),
(40, 'El Mahmal', 'المحمل', 4017),
(40, 'Msara', 'مصارة', 4018),
(40, 'Yabous', 'يابوس', 4019),
(40, 'Khirane', 'خيران', 4020),
(40, 'Chelia', 'شلية', 4021),
(41, 'Souk Ahras', 'سوق اهراس', 4101),
(41, 'Sedrata', 'سدراتة', 4102),
(41, 'Hanancha', 'الحنانشة', 4103),
(41, 'Mechroha', 'مشروحة', 4104),
(41, 'Ouled Driss', 'أولاد ادريس', 4105),
(41, 'Tiffech', 'تيفاش', 4106),
(41, 'Zaarouria', 'الزعرورية', 4107),
(41, 'Taoura', 'تاورة', 4108),
(41, 'Drea', 'الدريعة', 4109),
(41, 'Haddada', 'الحدادة', 4110),
(41, 'Khedara', 'لخضارة', 4111),
(41, 'Merahna', 'المراهنة', 4112),
(41, 'Ouled Moumen', 'أولاد مومن', 4113),
(41, 'Bir Bouhouche', 'بئر بوحوش', 4114),
(41, 'Mdaourouche', 'مداوروش', 4115),
(41, 'Oum El Adhaim', 'أم العظايم', 4116),
(41, 'Ain Zana', 'عين الزانة', 4117),
(41, 'Ain Soltane', 'عين السلطان', 4118),
(41, 'Quillen', 'ويلان', 4119),
(41, 'Sidi Fredj', 'سيدي فرج', 4120),
(41, 'Safel El Ouiden', 'سافل الويدان', 4121),
(41, 'Ragouba', 'الرقوبة', 4122),
(41, 'Khemissa', 'خميسة', 4123),
(41, 'Oued Keberit', 'وادي الكبريت', 4124),
(41, 'Terraguelt', 'ترقالت', 4125),
(41, 'Zouabi', 'الزوابي', 4126),
(42, 'Tipaza', 'تيبازة', 4201),
(42, 'Menaceur', 'مناصر', 4202),
(42, 'Larhat', 'الارهاط', 4203),
(42, 'Douaouda', 'دواودة', 4204),
(42, 'Bourkika', 'بورقيقة', 4205),
(42, 'Khemisti', 'خميستي', 4206),
(42, 'Aghabal', 'اغبال', 4207),
(42, 'Hadjout', 'حجوط', 4208),
(42, 'Sidi Amar', 'سيد عامر', 4209),
(42, 'Gouraya', 'قوراية', 4210),
(42, 'Nodor', 'الناظور', 4211),
(42, 'Chaiba', 'الشعيبة', 4212),
(42, 'Ain Tagourait', 'عين تاقورايت', 4213),
(42, 'Cherchel', 'شرشال', 4214),
(42, 'Damous', 'الداموس', 4215),
(42, 'Meurad', 'مراد', 4216),
(42, 'Fouka', 'فوكة', 4217),
(42, 'Bou Ismail', 'بواسماعيل', 4218),
(42, 'Ahmer El Ain', 'أحمر العين', 4219),
(42, 'Bou Haroun', 'بوهارون', 4220),
(42, 'Sidi Ghiles', 'سيدي غيلاس', 4221),
(42, 'Messelmoun', 'مسلمون', 4222),
(42, 'Sidi Rached', 'سيدي راشد', 4223),
(42, 'Kolea', 'القليعة', 4224),
(42, 'Attatba', 'الحطاطبة', 4225),
(42, 'Sidi Semiane', 'سيدي سميان', 4226),
(42, 'Beni Milleuk', 'بني ميلك', 4227),
(42, 'Hadjerat Ennous', 'حجرة النص', 4228),
(43, 'Mila', 'ميلة', 4301),
(43, 'Ferdjioua', 'فرجيوة', 4302),
(43, 'Chelghoum Laid', 'شلغوم العيد', 4303),
(43, 'Oued Athmenia', 'واد العثمانية', 4304),
(43, 'Ain Mellouk', 'عين ملوك', 4305),
(43, 'Telerghma', 'تلاغمة', 4306),
(43, 'Oued Seguen', 'وادي سقان', 4307),
(43, 'Tadjenanet', 'تاجنانت', 4308),
(43, 'Benyahia Abderrahmane', 'ابن يحي عبد الرحمان', 4309),
(43, 'Oued Endja', 'وادي النجات', 4310),
(43, 'Ahmed Rachedi', 'احمد راشدي', 4311),
(43, 'Ouled Khalouf', 'وادي خلوف', 4312),
(43, 'Tiberguent', 'تيبرقنت', 4313),
(43, 'Bouhatem', 'بوحاتم', 4314),
(43, 'Rouached', 'الرواشد', 4315),
(43, 'Tessala Lamatai', 'تسالة المطاعي', 4316),
(43, 'Grarem Gouga', 'قرارم قوقة', 4317),
(43, 'Sidi Merouane', 'سيدي مروان', 4318),
(43, 'Tassadane Haddada', 'تسادان حدادة', 4319),
(43, 'Derradji Bousselah', 'دراجي بوصالح', 4320),
(43, 'Minar Zarza', 'مينار زرزة', 4321),
(43, 'Amira Arras', 'عميرة اراس', 4322),
(43, 'Terrai Bainen', 'ترعى باينات', 4323),
(43, 'Hamala', 'حمالة', 4324),
(43, 'Ain Tine', 'عين التين', 4325),
(43, 'El Mechira', 'المشيرة', 4326),
(43, 'Sidi Khelifa', 'سيدي خليفة', 4327),
(43, 'Zeghaia', 'الزرغاية', 4328),
(43, 'Elayadi Barbes', 'العياضي برباس', 4329),
(43, 'Ain Beida Harriche', 'عين البيضات حريش', 4330),
(43, 'Yahia Beniguecha', 'يحي بن قشة', 4331),
(43, 'Chigara', 'الشيقارة', 4332),
(44, 'Ain Defla', 'عين الدفلى', 4401),
(44, 'Miliana', 'مليانة', 4402),
(44, 'Boumedfaa', 'بومدفع', 4403),
(44, 'Khemis Miliana', 'خميس مليانة', 4404),
(44, 'Hammam Righa', 'حمام ريغة', 4405),
(44, 'Arib', 'عريب', 4406),
(44, 'Djelida', 'جليدة', 4407),
(44, 'El Amra', 'العامرة', 4408),
(44, 'Bourached', 'بوراشد', 4409),
(44, 'El Attaf', 'العطاف', 4410),
(44, 'El Abadia', 'العبادية', 4411),
(44, 'Djendel', 'جندل', 4412),
(44, 'Oued Chorfa', 'وادي الشرفات', 4413),
(44, 'Ain Lechiakh', 'عين الاشياخ', 4414),
(44, 'Oued Djemaa', 'وادي جمعة', 4415),
(44, 'Rouina', 'روينة', 4416),
(44, 'Zeddine', 'زدين', 4417),
(44, 'El Hassania', 'الحسنية', 4418),
(44, 'Bir Ouled Khelifa', 'بئر اولاد خليفة', 4419);
INSERT INTO `commune` (`CODE_W`, `COMMUNE`, `COMMUNEA`, `CODE_C`) VALUES
(44, 'Ain Soltane', 'عين السلطان', 4420),
(44, 'Tarik Ibn Ziad', 'طارق بن زياد', 4421),
(44, 'Bordj Emir Khaled', 'برج الامير خالد', 4422),
(44, 'Ain Torki', 'عين الترك', 4423),
(44, 'Sidi Lakhdar', 'سيدي الاخضر', 4424),
(44, 'Ben Allal', 'ابن علال', 4425),
(44, 'Ain Benian', 'عين البنيان', 4426),
(44, 'Hoceinia', 'الحسينية', 4427),
(44, 'Barbouche', 'بربوش', 4428),
(44, 'Djemaa Ouled Chikh', 'جمعة اولاد الشيخ', 4429),
(44, 'Mekhatria', 'المختارية', 4430),
(44, 'Bathia', 'بطحية', 4431),
(44, 'Tachta Zegagha', 'تشتة زقاغة', 4432),
(44, 'Ain Bouyahia', 'عين بويحي', 4433),
(44, 'El Maine', 'الماين', 4434),
(44, 'Tiberkanine', 'تبركانين', 4435),
(44, 'Belaas', 'بالعاص', 4436),
(45, 'Naama', 'النعامة', 4501),
(45, 'Mechria', 'مشرية', 4502),
(45, 'Ain Sefra', 'عين الصفرات', 4503),
(45, 'Tiout', 'تيوت', 4504),
(45, 'Sfissifa', 'سفيسيفة', 4505),
(45, 'Moghrar', 'مغرار', 4506),
(45, 'Assela', 'عسلة', 4507),
(45, 'Djeniane Bourzeg', 'جنين بورزق', 4508),
(45, 'Ain Ben Khelil', 'عين بن خليل', 4509),
(45, 'Makman Ben Amer', 'مكمن بن عمرو', 4510),
(45, 'Kasdir', 'قصدير', 4511),
(45, 'El Biod', 'البيوض', 4512),
(46, 'Ain Temouchent', 'عين تموشنت', 4601),
(46, 'Chaabet El Ham', 'شعبة اللحم', 4602),
(46, 'Ain Kihal', 'عين الكيحل', 4603),
(46, 'Hammam Bouhadjar', 'حمام بوحجر', 4604),
(46, 'Bou Zedjar', 'بوزجار', 4605),
(46, 'Oued Berkeche', 'وادي برقش', 4606),
(46, 'Aghlal', 'أغلال', 4607),
(46, 'Terga', 'تارقة', 4608),
(46, 'Ain El Arbaa', 'عين الاربعات', 4609),
(46, 'Tamzoura', 'تامزورة', 4610),
(46, 'Chentouf', 'شنتوف', 4611),
(46, 'Sidi Ben Adda', 'سيدي بن عدة', 4612),
(46, 'Aoubellil', 'عقب الليل', 4613),
(46, 'El Malah', 'المالح', 4614),
(46, 'Sidi Boumediene', 'سيدي بومدين', 4615),
(46, 'Oued Sabah', 'وادي الصباح', 4616),
(46, 'Ouled Boudjemaa', 'أولاد بوجمعة', 4617),
(46, 'Ain Tolba', 'عين الطلبة', 4618),
(46, 'El Amria', 'العامرية', 4619),
(46, 'Hassi El Ghella', 'حاسي الغلة', 4620),
(46, 'Hassasna', 'الحساسنة', 4621),
(46, 'Ouled Kihal', 'اولاد كيحل', 4622),
(46, 'Beni Saf', 'بني صاف', 4623),
(46, 'Sidi Safi', 'سيدي الصافي', 4624),
(46, 'Oulhaca El Gheraba', 'ولهاصة', 4625),
(46, 'Tadmaya', 'تادمايت', 4626),
(46, 'El Emir Abdelkader', 'الأمير عبد القادر', 4627),
(46, 'El Messaid', 'المساعيد', 4628),
(47, 'Ghardaia', 'غرداية', 4701),
(47, 'El Meniaa', 'المنيعة', 4702),
(47, 'Dhayet Bendhahoua', 'ضاية بن ضحوة', 4703),
(47, 'Berriane', 'بريان', 4704),
(47, 'Metlili', 'متليلي', 4705),
(47, 'El Guerrara', 'القرارة', 4706),
(47, 'El Atteuf', 'العطف', 4707),
(47, 'Zelfana', 'زلفانة', 4708),
(47, 'Sebseb', 'سبسب', 4709),
(47, 'Bounoura', 'بونورة', 4710),
(47, 'Hassi Fehal', 'حاسي الفحل', 4711),
(47, 'Hassi Gara', 'حاسي القارة', 4712),
(47, 'Mansoura', 'المنصورة', 4713),
(48, 'Relizane', 'غليزان', 4801),
(48, 'Oued Rhiou', 'وادي رهيو', 4802),
(48, 'Belaassel Bouzegza', 'بلعسل بوزقزة', 4803),
(48, 'Sidi Saada', 'سيدي سعادة', 4804),
(48, 'Ouled Aiche', 'اولاد عيش', 4805),
(48, 'Sidi Lazreg', 'سيدي لزرق', 4806),
(48, 'El Hamadna', 'الحمادنة', 4807),
(48, 'Sidi Mhamed Ben Ali', 'سيدي محمد بن علي', 4808),
(48, 'Mediouna', 'مديونة', 4809),
(48, 'Sidi Khettab', 'سيدي خطاب', 4810),
(48, 'Ammi Moussa', 'عمي موسى', 4811),
(48, 'Zemmoura', 'زمورة', 4812),
(48, 'Beni Dergoun', 'بني درقن', 4813),
(48, 'Djidiouia', 'جديوية', 4814),
(48, 'El Guettar', 'القطار', 4815),
(48, 'Hamri', 'الحمري', 4816),
(48, 'El Matmar', 'المطمر', 4817),
(48, 'Sidi Mhamed Ben Aouda', 'سيدي محمد بن عودة', 4818),
(48, 'Ain Tarek', 'عين طارق', 4819),
(48, 'Oued Essalem', 'وادي السلام', 4820),
(48, 'Ouarizane', 'ورزان', 4821),
(48, 'Mazouna', 'مازونة', 4822),
(48, 'Kalaa', 'القلعة', 4823),
(48, 'Ain Rahma', 'عين الرحمة', 4824),
(48, 'Yellel', 'يلل', 4825),
(48, 'Oued El Djemaa', 'وادي الجمعة', 4826),
(48, 'Ramka', 'الرمكة', 4827),
(48, 'Mendes', 'منداس', 4828),
(48, 'Lahlef', 'لحلاف', 4829),
(48, 'Beni Zentis', 'بني زنطيس', 4830),
(48, 'Souk El Haad', 'سوق الاحد', 4831),
(48, 'Dar Ben Abdellah', 'دار بن عبدالله', 4832),
(48, 'El Hassi', 'الحاسي', 4833),
(48, 'Had Echkalla', 'حدالشكالة', 4834),
(48, 'Bendaoud', 'بن داود', 4835),
(48, 'El Ouldja', 'الولجة', 4836),
(48, 'Merdja Sidi Abed', 'مرجة سيدي عابد', 4837),
(48, 'Ouled Sidi Mihoub', 'أولاد سيدي ميهوب', 4838);

-- --------------------------------------------------------

--
-- Structure de la table `contact`
--

CREATE TABLE `contact` (
  `id` int(11) NOT NULL,
  `dat` datetime NOT NULL,
  `nom` varchar(200) NOT NULL,
  `mail` varchar(50) NOT NULL,
  `content_text` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `contact`
--

INSERT INTO `contact` (`id`, `dat`, `nom`, `mail`, `content_text`) VALUES
(1, '2020-10-08 19:17:21', 'TAIBI Khaled', 'taibikhaled1982@gmail.com', 'TEST'),
(2, '2020-10-13 19:39:44', 'kamel', 'taibikhaled1982@gmail.com', 'hhgyg gjh gjgjhg hg\r\n\r\nkkhkl kl\r\n\r\nnknlk');

-- --------------------------------------------------------

--
-- Structure de la table `cour_document`
--

CREATE TABLE `cour_document` (
  `id` int(11) NOT NULL,
  `dat` datetime NOT NULL,
  `lib_doc` varchar(200) NOT NULL,
  `lien` varchar(200) NOT NULL,
  `etablissement` varchar(30) NOT NULL,
  `cldem` varchar(30) NOT NULL,
  `codmat` varchar(30) NOT NULL,
  `nom_ens` varchar(60) NOT NULL,
  `active` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `cour_document`
--

INSERT INTO `cour_document` (`id`, `dat`, `lib_doc`, `lien`, `etablissement`, `cldem`, `codmat`, `nom_ens`, `active`) VALUES
(1, '2020-10-08 11:06:03', 'LE JOURNAL GÉNÉRAL', 'PJ1.DOC', 'EFPG', 'CAP', 'CG', 'HACHEMI Mohamed', 1),
(2, '2020-10-08 11:07:13', 'les emballages commerciaux', 'PJ2.DOC', 'EFPG', 'CAP', 'CG', 'HACHEMI Mohamed', 1),
(3, '2020-10-08 11:08:36', 'Les opérations de ventes', 'PJ3.DOC', 'EFPG', 'CMTC', 'CG', 'HACHEMI Mohamed', 1),
(4, '2020-10-08 11:10:04', 'LE COMPTE', 'PJ4.DOC', 'EFPG', 'CMTC', 'CG', 'HACHEMI Mohamed', 1),
(5, '2020-10-08 11:12:44', 'COMPTABILITÉ GÉNÉRALE INTRODUCTION', 'PJ5.DOC', 'EFPG', 'CMTC', 'CG', 'HACHEMI Mohamed', 1),
(6, '2020-10-08 17:25:56', 'COMPTABILITÉ GÉNÉRALE INTRODUCTION', 'PJ6.DOC', 'IFG', 'CAP', 'CG', 'HACHEMI Mohamed', 0),
(7, '2020-10-14 12:59:19', 'Registre de commerce', 'PJ7.DOC', 'IFG', 'CMTC', 'CG', 'HACHEMI Mohamed', 1),
(8, '2020-10-08 11:08:36', 'Les opérations de ventes', 'PJ3.DOC', 'EES', '3ALF', 'math', 'HACHEMI Mohamed', 1);

-- --------------------------------------------------------

--
-- Structure de la table `cour_video`
--

CREATE TABLE `cour_video` (
  `id` int(11) NOT NULL,
  `dat` datetime NOT NULL,
  `lib_doc` varchar(200) NOT NULL,
  `url_youtube` varchar(200) DEFAULT NULL,
  `lien` varchar(200) NOT NULL,
  `etablissement` varchar(30) NOT NULL,
  `cldem` varchar(30) NOT NULL,
  `codmat` varchar(30) NOT NULL,
  `nom_ens` varchar(60) NOT NULL,
  `active` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `cour_video`
--

INSERT INTO `cour_video` (`id`, `dat`, `lib_doc`, `url_youtube`, `lien`, `etablissement`, `cldem`, `codmat`, `nom_ens`, `active`) VALUES
(1, '2020-10-13 16:40:41', 'COMPTABILITÉ GÉNÉRALE INTRODUCTION', 'youtube.com/vjjgfd', 'V001.MP4', 'EFPG', 'CAP', 'CG', 'HACHEMI Mohamed', 1),
(2, '2020-10-13 16:40:41', 'COMPTABILITÉ GÉNÉRALE INTRODUCTION', 'youtube.com/vjjgfd', 'V001.MP4', 'EES', '3ALF', 'math', 'HACHEMI Mohamed', 1);

-- --------------------------------------------------------

--
-- Structure de la table `enseignants_bejaia`
--

CREATE TABLE `enseignants_bejaia` (
  `id` int(11) NOT NULL,
  `nom` varchar(60) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `enseignants_bejaia`
--

INSERT INTO `enseignants_bejaia` (`id`, `nom`) VALUES
(1, 'mohamed');

-- --------------------------------------------------------

--
-- Structure de la table `enseignants_ecole`
--

CREATE TABLE `enseignants_ecole` (
  `id` int(11) NOT NULL,
  `nom` varchar(60) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `enseignants_ecole`
--

INSERT INTO `enseignants_ecole` (`id`, `nom`) VALUES
(1, 'TAIBI Khaled'),
(2, 'HACHEMI Mohamed');

-- --------------------------------------------------------

--
-- Structure de la table `enseignants_etablissement`
--

CREATE TABLE `enseignants_etablissement` (
  `id` int(11) NOT NULL,
  `nom` varchar(60) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Structure de la table `enseignants_institut`
--

CREATE TABLE `enseignants_institut` (
  `id` int(11) NOT NULL,
  `nom` varchar(60) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Structure de la table `enseignants_oran`
--

CREATE TABLE `enseignants_oran` (
  `id` int(11) NOT NULL,
  `nom` varchar(60) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_formation_bejaia`
--

CREATE TABLE `equivalent_formation_bejaia` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_formation_bejaia`
--

INSERT INTO `equivalent_formation_bejaia` (`id`, `designation`, `niveau`) VALUES
(1, 'CMP Comptabilité ou CAP', 1),
(2, 'CMTC', 3),
(3, 'CED', 4),
(4, 'TS Education des Jeunes Enfants', 4),
(5, 'TS en Comptabilité et Gestion', 4),
(6, 'TS en Informatique', 4);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_formation_ecole`
--

CREATE TABLE `equivalent_formation_ecole` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_formation_ecole`
--

INSERT INTO `equivalent_formation_ecole` (`id`, `designation`, `niveau`) VALUES
(1, 'CMP Comptabilité ou CAP', 1),
(2, 'CMTC', 3),
(3, 'CED', 4),
(4, 'Master Finance et comptabilité', 5),
(5, 'Master Management', 5);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_formation_etablissement`
--

CREATE TABLE `equivalent_formation_etablissement` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_formation_etablissement`
--

INSERT INTO `equivalent_formation_etablissement` (`id`, `designation`, `niveau`) VALUES
(2, 'السنة الأولى ثانوي جذع مشترك آداب', 2),
(3, 'السنة الأولى ثانوي جذع مشترك علوم و تكنولوجيا', 2),
(4, 'السنة الثانية ثانوي آداب و لغات', 3),
(5, 'السنة الثانية ثانوي آداب و فلسفة', 3),
(6, 'السنة الثانية تسيير و اقتصاد', 4),
(7, 'السنة الثانية ثانوي علوم تجريبية', 4),
(8, 'السنة الثالثة ثانوي آداب و لغات', 5),
(9, 'السنة الثالثة ثانوي آداب و فلسفة', 6),
(10, 'السنة الثالثة تسيير و اقتصاد', 7),
(11, 'السنة الثالثة ثانوي علوم تجريبية', 8);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_formation_institut`
--

CREATE TABLE `equivalent_formation_institut` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_formation_institut`
--

INSERT INTO `equivalent_formation_institut` (`id`, `designation`, `niveau`) VALUES
(1, 'CMP Comptabilité ou CAP', 1),
(2, 'CMTC', 3),
(3, 'TS  Commerce International', 4),
(4, 'TS  Gestion Ressource Humaines', 4),
(5, 'TS  Comptabilité de Gestion', 4),
(6, 'TS  Tourisme', 4),
(7, 'Master Finance et comptabilité', 5),
(8, 'Master Administration des Affaires', 5),
(9, 'Master Gestion Ressource Humaines', 5);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_formation_oran`
--

CREATE TABLE `equivalent_formation_oran` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_formation_oran`
--

INSERT INTO `equivalent_formation_oran` (`id`, `designation`, `niveau`) VALUES
(1, 'CMP Comptabilité ou CAP', 1),
(2, 'CMTC', 3),
(3, 'Technicien Supérieur en Informatique', 4),
(4, 'TS  Commerce International', 4),
(5, 'TS en Gestion des Ressources Humaines', 4),
(6, 'TS Secrétariat', 4),
(7, 'TS Education des Jeunes Enfants', 4),
(8, 'Master Professionnel en Management', 5);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_niveau_bejaia`
--

CREATE TABLE `equivalent_niveau_bejaia` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_niveau_bejaia`
--

INSERT INTO `equivalent_niveau_bejaia` (`id`, `designation`, `niveau`) VALUES
(1, '4eme AM ou 9eme AF', 1),
(2, '1er AS science', 2),
(3, '2eme AS science', 3),
(4, '3eme AS science', 4),
(5, 'BAC+2', 5),
(6, 'TS  métiers de gestion', 5),
(7, 'TS  métiers de GRH', 5),
(8, 'CED', 5);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_niveau_ecole`
--

CREATE TABLE `equivalent_niveau_ecole` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_niveau_ecole`
--

INSERT INTO `equivalent_niveau_ecole` (`id`, `designation`, `niveau`) VALUES
(1, '4eme AM ou 9eme AF', 1),
(2, '1er AS science', 2),
(3, '2eme AS science', 3),
(4, '3eme AS science', 4),
(5, 'BAC+2', 5),
(6, 'TS  métiers de gestion', 5),
(7, 'TS  métiers de GRH', 5),
(8, 'CED', 5);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_niveau_etablissement`
--

CREATE TABLE `equivalent_niveau_etablissement` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_niveau_etablissement`
--

INSERT INTO `equivalent_niveau_etablissement` (`id`, `designation`, `niveau`) VALUES
(1, 'السنة الرابعة متوسط', 2),
(2, 'السنة الأولى ثانوي جذع مشترك آداب', 2),
(3, 'السنة الأولى ثانوي جذع مشترك علوم و تكنولوجيا', 2),
(4, 'السنة الثانية ثانوي آداب و لغات', 3),
(5, 'السنة الثانية ثانوي آداب و فلسفة', 3),
(6, 'السنة الثانية تسيير و اقتصاد', 4),
(7, 'السنة الثانية ثانوي علوم تجريبية', 4),
(8, 'السنة الثالثة ثانوي آداب و لغات', 5),
(9, 'السنة الثالثة ثانوي آداب و فلسفة', 6),
(10, 'السنة الثالثة تسيير و اقتصاد', 7),
(11, 'السنة الثالثة ثانوي علوم تجريبية', 8);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_niveau_institut`
--

CREATE TABLE `equivalent_niveau_institut` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_niveau_institut`
--

INSERT INTO `equivalent_niveau_institut` (`id`, `designation`, `niveau`) VALUES
(1, '4eme AM ou 9eme AF', 1),
(2, '1er AS science', 2),
(3, '2eme AS science', 3),
(4, '3eme AS science', 4),
(5, 'BAC+2', 5),
(6, 'TS  métiers de gestion', 5),
(7, 'TS  métiers de GRH', 5),
(8, 'CED', 5);

-- --------------------------------------------------------

--
-- Structure de la table `equivalent_niveau_oran`
--

CREATE TABLE `equivalent_niveau_oran` (
  `id` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `niveau` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `equivalent_niveau_oran`
--

INSERT INTO `equivalent_niveau_oran` (`id`, `designation`, `niveau`) VALUES
(1, '4eme AM ou 9eme AF', 1),
(2, '1er AS science', 2),
(3, '2eme AS science', 3),
(4, '3eme AS science', 4),
(5, 'BAC+2', 5),
(6, 'TS  métiers de gestion', 5),
(7, 'TS  métiers de GRH', 5),
(8, 'CED', 5);

-- --------------------------------------------------------

--
-- Structure de la table `evenement`
--

CREATE TABLE `evenement` (
  `id` int(11) NOT NULL,
  `ref` varchar(100) NOT NULL,
  `titre` varchar(200) NOT NULL,
  `content` text NOT NULL,
  `dat` datetime NOT NULL,
  `f_img` varchar(50) DEFAULT NULL,
  `f_pj` varchar(50) DEFAULT NULL,
  `content_text` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `evenement`
--

INSERT INTO `evenement` (`id`, `ref`, `titre`, `content`, `dat`, `f_img`, `f_pj`, `content_text`) VALUES
(1, '001', 'انطلاق التسجيلات عبر النت ابتداء من  28 اكتوبر 2020  <br> Début des inscriptions pour l\'année 2020/2021,  via le net à partir du 28 octobre 2020', '<p><span style=\"font-size:20px\">انطلاق التسجيلات عبر النت ابتداء من 28 اكتوبر&nbsp;2020 &nbsp;</span></p>\r\n\r\n<p><span style=\"font-size:20px\">D&eacute;but des inscriptions pour l&#39;ann&eacute;e 2020/2021, &nbsp;via le net &agrave; partir du 28 octobre 2020</span></p>', '2020-10-13 19:31:54', 'img1.JPG', '', 'انطلاق التسجيلات عبر النت ابتداء من 28 اكتوبر 2020  \r\n\r\nDébut des inscriptions pour l\'année 2020/2021,  via le net à partir du 28 octobre 2020'),
(2, '002', 'المذكرة الإعلامية الخاصة بشروط التسجيل ، للسنة الدراسية 2020/2021 <br> Note d’information  relative aux modalités d’inscriptions 2020/2021', '<p><span style=\"color:#000000\"><span style=\"font-size:22px\">المذكرة الإعلامية الخاصة بشروط التسجيل ، للسنة الدراسية 2020/2021 </span></span></p>\r\n\r\n<p><span style=\"color:#000000\"><span style=\"font-size:22px\">Note d&rsquo;information &nbsp;relative aux modalit&eacute;s d&rsquo;inscriptions 2020/2021</span></span></p>', '2020-09-12 20:18:01', 'img2.PNG', '', 'المذكرة الإعلامية الخاصة بشروط التسجيل ، للسنة الدراسية 2020/2021 \r\n\r\nNote d’information  relative aux modalités d’inscriptions 2020/2021'),
(3, '003', 'تحظير الدخول المدرسي باحترام البروتوكول المضاد لوباء كوفيد 19 <br> Nos établissements se préparent pour une rentrée avec les protocoles anti-COVID 19.', '<p><span style=\"color:#000000\"><span style=\"font-size:22px\">تحظير&nbsp;الدخول&nbsp;المدرسي&nbsp;باحترام&nbsp;البروتوكول&nbsp;المضاد&nbsp;لوباء&nbsp;كوفيد&nbsp;19&nbsp;Nos&nbsp;&eacute;tablissements&nbsp;se&nbsp;pr&eacute;parent&nbsp;pour&nbsp;une&nbsp;rentr&eacute;e&nbsp;avec&nbsp;les&nbsp;protocoles&nbsp;anti-COVID&nbsp;19.</span></span></p>', '2020-09-12 19:29:20', 'img3.JPG', '', 'تحظير الدخول المدرسي باحترام البروتوكول المضاد لوباء كوفيد 19 Nos établissements se préparent pour une rentrée avec les protocoles anti-COVID 19.');

-- --------------------------------------------------------

--
-- Structure de la table `inscription_bejaia`
--

CREATE TABLE `inscription_bejaia` (
  `ID` int(11) NOT NULL,
  `DAT` datetime DEFAULT NULL,
  `NOMA` varchar(30) DEFAULT NULL,
  `PRENOMA` varchar(30) DEFAULT NULL,
  `LIP` varchar(2) DEFAULT NULL,
  `FONC` varchar(30) DEFAULT NULL,
  `MATA` varchar(16) DEFAULT NULL,
  `DIRA` varchar(30) DEFAULT NULL,
  `ENTRA` varchar(30) DEFAULT NULL,
  `ADRA` varchar(60) DEFAULT NULL,
  `NPHA` varchar(15) DEFAULT NULL,
  `NOME` varchar(30) DEFAULT NULL,
  `PRENOME` varchar(30) DEFAULT NULL,
  `NOMAR` varchar(30) DEFAULT NULL,
  `PRENOMAR` varchar(30) DEFAULT NULL,
  `SEXE` varchar(1) DEFAULT NULL,
  `DATN` date DEFAULT NULL,
  `LIEU` varchar(30) DEFAULT NULL,
  `ADR` varchar(60) DEFAULT NULL,
  `MAIL` varchar(40) DEFAULT NULL,
  `NPHE` varchar(15) DEFAULT NULL,
  `NPHT` varchar(15) DEFAULT NULL,
  `NPHF` varchar(15) DEFAULT NULL,
  `ANNEE` varchar(9) DEFAULT NULL,
  `NIVS` varchar(6) DEFAULT NULL,
  `PHOTO` varchar(50) DEFAULT NULL,
  `WILAYA_N` varchar(50) DEFAULT NULL,
  `COMMUNE_N` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_bejaia`
--

INSERT INTO `inscription_bejaia` (`ID`, `DAT`, `NOMA`, `PRENOMA`, `LIP`, `FONC`, `MATA`, `DIRA`, `ENTRA`, `ADRA`, `NPHA`, `NOME`, `PRENOME`, `NOMAR`, `PRENOMAR`, `SEXE`, `DATN`, `LIEU`, `ADR`, `MAIL`, `NPHE`, `NPHT`, `NPHF`, `ANNEE`, `NIVS`, `PHOTO`, `WILAYA_N`, `COMMUNE_N`) VALUES
(1, '2020-10-08 15:44:39', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', NULL, 'DIRECTION', 'SOTRAZ', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2002-12-31', 'Kouba - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '6', 'img1.JPG', '16', '1618'),
(2, '2020-10-13 23:00:06', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'COGIZ', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2000-12-25', 'Guernini - Djelfa', 'cite 385 log', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img2.JPG', '14', '1414'),
(3, '2020-10-17 22:25:06', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', NULL, 'GSP - MCA', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1998-12-29', 'Iloula Oumalou - Tizi Ouzou', 'cite 385 log', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '1', 'img3.JPG', '17', '1713');

-- --------------------------------------------------------

--
-- Structure de la table `inscription_bejaia_choix`
--

CREATE TABLE `inscription_bejaia_choix` (
  `id` int(11) NOT NULL,
  `id_formation` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `id_inscription` int(11) NOT NULL,
  `choix` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_bejaia_choix`
--

INSERT INTO `inscription_bejaia_choix` (`id`, `id_formation`, `designation`, `id_inscription`, `choix`) VALUES
(6, 1, 'CMP Comptabilité ou CAP', 1, 1),
(7, 2, 'CMTC', 1, 2),
(8, 3, 'CED', 1, 3),
(9, 4, 'TS Education des Jeunes Enfants', 1, 4),
(10, 5, 'TS en Comptabilité et Gestion', 1, 5),
(11, 6, 'TS en Informatique', 1, 6),
(12, 1, 'CMP Comptabilité ou CAP', 2, 1),
(13, 2, 'CMTC', 2, 2),
(17, 1, 'CMP Comptabilité ou CAP', 3, 1);

-- --------------------------------------------------------

--
-- Structure de la table `inscription_ecole`
--

CREATE TABLE `inscription_ecole` (
  `ID` int(11) NOT NULL,
  `DAT` datetime DEFAULT NULL,
  `NOMA` varchar(30) DEFAULT NULL,
  `PRENOMA` varchar(30) DEFAULT NULL,
  `LIP` varchar(2) DEFAULT NULL,
  `FONC` varchar(30) DEFAULT NULL,
  `MATA` varchar(16) DEFAULT NULL,
  `DIRA` varchar(30) DEFAULT NULL,
  `ENTRA` varchar(30) DEFAULT NULL,
  `ADRA` varchar(60) DEFAULT NULL,
  `NPHA` varchar(15) DEFAULT NULL,
  `NOME` varchar(30) DEFAULT NULL,
  `PRENOME` varchar(30) DEFAULT NULL,
  `NOMAR` varchar(30) DEFAULT NULL,
  `PRENOMAR` varchar(30) DEFAULT NULL,
  `SEXE` varchar(1) DEFAULT NULL,
  `DATN` date DEFAULT NULL,
  `LIEU` varchar(30) DEFAULT NULL,
  `ADR` varchar(60) DEFAULT NULL,
  `MAIL` varchar(40) DEFAULT NULL,
  `NPHE` varchar(15) DEFAULT NULL,
  `NPHT` varchar(15) DEFAULT NULL,
  `NPHF` varchar(15) DEFAULT NULL,
  `ANNEE` varchar(9) DEFAULT NULL,
  `NIVS` varchar(6) DEFAULT NULL,
  `PHOTO` varchar(50) DEFAULT NULL,
  `WILAYA_N` varchar(50) DEFAULT NULL,
  `COMMUNE_N` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_ecole`
--

INSERT INTO `inscription_ecole` (`ID`, `DAT`, `NOMA`, `PRENOMA`, `LIP`, `FONC`, `MATA`, `DIRA`, `ENTRA`, `ADRA`, `NPHA`, `NOME`, `PRENOME`, `NOMAR`, `PRENOMAR`, `SEXE`, `DATN`, `LIEU`, `ADR`, `MAIL`, `NPHE`, `NPHT`, `NPHF`, `ANNEE`, `NIVS`, `PHOTO`, `WILAYA_N`, `COMMUNE_N`) VALUES
(1, '2020-10-08 14:44:01', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'HELIOS SPA', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2001-02-17', 'El Harrach - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '4', 'img1.JPG', '16', '1619'),
(2, '2020-10-13 18:28:11', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1998-10-29', 'El Khemis - Djelfa', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '3', 'img2.JPG', '15', '1514'),
(3, '2020-10-13 22:56:37', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'HELIOS SPA', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2000-07-26', 'Hussein Dey - Alger', 'cite 385 log', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img3.JPG', '16', '1618'),
(4, '2020-10-17 22:46:11', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1999-03-29', 'Bouira - bouira', 'cite 385 log', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '4', 'img4.JPG', '16', '1617');

-- --------------------------------------------------------

--
-- Structure de la table `inscription_ecole_choix`
--

CREATE TABLE `inscription_ecole_choix` (
  `id` int(11) NOT NULL,
  `id_formation` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `id_inscription` int(11) NOT NULL,
  `choix` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_ecole_choix`
--

INSERT INTO `inscription_ecole_choix` (`id`, `id_formation`, `designation`, `id_inscription`, `choix`) VALUES
(9, 1, 'CMP Comptabilité ou CAP', 1, 1),
(10, 2, 'CMTC', 1, 2),
(11, 3, 'CED', 1, 3),
(15, 1, 'CMP Comptabilité ou CAP', 2, 1),
(16, 1, 'CMP Comptabilité ou CAP', 3, 1),
(17, 2, 'CMTC', 3, 2),
(20, 1, 'CMP Comptabilité ou CAP', 4, 1),
(21, 2, 'CMTC', 4, 2),
(22, 3, 'CED', 4, 3);

-- --------------------------------------------------------

--
-- Structure de la table `inscription_etablissement`
--

CREATE TABLE `inscription_etablissement` (
  `ID` int(11) NOT NULL,
  `DAT` datetime DEFAULT NULL,
  `NOMA` varchar(30) DEFAULT NULL,
  `PRENOMA` varchar(30) DEFAULT NULL,
  `LIP` varchar(2) DEFAULT NULL,
  `FONC` varchar(30) DEFAULT NULL,
  `MATA` varchar(16) DEFAULT NULL,
  `DIRA` varchar(30) DEFAULT NULL,
  `ENTRA` varchar(30) DEFAULT NULL,
  `ADRA` varchar(60) DEFAULT NULL,
  `NPHA` varchar(15) DEFAULT NULL,
  `NOME` varchar(30) DEFAULT NULL,
  `PRENOME` varchar(30) DEFAULT NULL,
  `NOMAR` varchar(30) DEFAULT NULL,
  `PRENOMAR` varchar(30) DEFAULT NULL,
  `SEXE` varchar(1) DEFAULT NULL,
  `DATN` date DEFAULT NULL,
  `LIEU` varchar(30) DEFAULT NULL,
  `ADR` varchar(60) DEFAULT NULL,
  `MAIL` varchar(40) DEFAULT NULL,
  `NPHE` varchar(15) DEFAULT NULL,
  `NPHT` varchar(15) DEFAULT NULL,
  `NPHF` varchar(15) DEFAULT NULL,
  `ANNEE` varchar(9) DEFAULT NULL,
  `NIVS` varchar(6) DEFAULT NULL,
  `PHOTO` varchar(50) DEFAULT NULL,
  `WILAYA_N` varchar(50) DEFAULT NULL,
  `COMMUNE_N` varchar(50) DEFAULT NULL,
  `MOYENNE` varchar(5) DEFAULT NULL,
  `MOYENNE_BEM` varchar(5) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_etablissement`
--

INSERT INTO `inscription_etablissement` (`ID`, `DAT`, `NOMA`, `PRENOMA`, `LIP`, `FONC`, `MATA`, `DIRA`, `ENTRA`, `ADRA`, `NPHA`, `NOME`, `PRENOME`, `NOMAR`, `PRENOMAR`, `SEXE`, `DATN`, `LIEU`, `ADR`, `MAIL`, `NPHE`, `NPHT`, `NPHF`, `ANNEE`, `NIVS`, `PHOTO`, `WILAYA_N`, `COMMUNE_N`, `MOYENNE`, `MOYENNE_BEM`) VALUES
(1, '2020-09-13 14:45:38', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SONATRACH', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2005-04-16', 'القبة - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '023603870', '2020', '3', 'img1.JPG', '16', '1618', '11.19', NULL),
(2, '2020-09-13 15:22:49', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SONATRACH', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2004-03-15', 'بوروبة - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '023806022', '2020', '3', 'img2.JPG', '16', '1617', '11.19', NULL),
(3, '2020-09-13 15:39:33', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SOTRAZ', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '1997-04-20', 'بئر مراد رايس - الجزائر العاصم', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img3.JPG', '16', '1613', '11.19', NULL),
(4, '2020-09-24 16:11:12', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'NAFTAL', 'SONATRACH', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2003-06-27', 'باش جراح - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '1', 'img4.JPG', '16', '1616', '10', '10'),
(5, '2020-10-08 17:14:23', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SOMIK', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2001-07-31', 'بوروبة - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '22121212', '2020', '1', 'img5.JPG', '16', '1615', '11.19', '10'),
(6, '2020-10-08 18:27:31', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', 'بولوغين - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '1', 'img6.JPG', '16', '1616', '9.25', '8.25'),
(7, '2020-10-08 18:35:38', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img7.JPG', '16', NULL, '8.25', '8.25'),
(8, '2020-10-08 18:40:26', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img8.JPG', '16', NULL, '8.8', '8.25'),
(9, '2020-10-08 18:40:58', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img9.JPG', '16', NULL, '10', '8.25'),
(10, '2020-10-08 18:42:40', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img10.JPG', '16', NULL, '10', '8.25'),
(11, '2020-10-08 18:43:36', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img11.JPG', '16', NULL, '10', '8.25'),
(12, '2020-10-08 18:44:24', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img12.JPG', '16', NULL, '8.5', '8.25'),
(13, '2020-10-08 18:45:20', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img13.JPG', '16', NULL, '8.49', '8.25'),
(14, '2020-10-08 18:51:58', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img14.JPG', '16', NULL, '8.49', '8.25'),
(15, '2020-10-08 19:00:54', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img15.JPG', '16', NULL, '7.25', '8.25'),
(16, '2020-10-08 19:07:17', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img16.JPG', '16', NULL, '8.99', '8.25'),
(17, '2020-10-08 19:09:08', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img17.JPG', '16', NULL, '9', '8.25'),
(18, '2020-10-08 19:10:24', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '10', 'img18.JPG', '16', NULL, '7', '8.25'),
(19, '2020-10-08 19:11:48', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2005-04-16', ' - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img19.JPG', '16', NULL, '9', '8.25'),
(20, '2020-10-09 13:52:58', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2005-04-16', 'Kouba - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img20.JPG', '16', '1618', '11.19', NULL),
(21, '2020-10-09 16:30:32', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2005-04-16', 'باش جراح - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '2', 'img21.JPG', '16', '1618', '8.49', NULL),
(22, '2020-10-09 17:27:22', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2006-04-16', 'Guidjel - Sétif', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '15', '1520', '8.49', NULL),
(23, '2020-10-09 17:44:48', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2001-04-16', 'Hussein Dey - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '16', '1618', '8.49', NULL),
(24, '2020-10-09 17:55:20', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2000-04-16', 'Hussein Dey - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '16', '1616', '8.49', NULL),
(25, '2020-10-09 18:02:46', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1998-04-16', 'Oued Koriche - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '16', '1621', '8.48', NULL),
(26, '2020-10-09 18:13:57', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1997-04-16', ' - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '16', NULL, '8.48', NULL),
(27, '2020-10-09 18:23:29', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1996-04-16', 'Ain El Hadjar - Saida', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '18', '1816', '8.33', NULL),
(28, '2020-10-09 18:32:07', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1996-04-17', 'Hussein Dey - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '16', '1615', '8.33', NULL),
(29, '2020-10-09 18:37:38', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'COGIZ', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1994-09-24', 'Kouba - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '12', '1214', '8.49', NULL),
(30, '2020-10-09 18:39:02', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'COGIZ', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1994-08-24', 'Oued Smar - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '2', 'img1.JPG', '16', '1617', '8.49', NULL),
(31, '2020-10-09 18:45:35', 'taibi', 'khaled', 'DD', '<br /><b>Notice</b>:  Undefine', '121212122DD', 'DIRECTION', 'COGIZ', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1993-08-24', 'Casbah - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '2', 'img1.JPG', '16', '1618', '8.49', NULL),
(32, '2020-10-09 18:55:54', 'taibi', 'khaled', 'DD', '<br /><b>Notice</b>:  Undefine', '121212122DD', 'DIRECTION', 'COGIZ', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1993-08-25', 'Casbah - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '2', 'img32.JPG', '16', '1618', '8.49', NULL),
(33, '2020-10-09 19:13:30', 'taibi', 'khaled', 'DD', 'DG', '121212122DD', 'DIRECTION', 'COGIZ', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1993-08-25', 'القصبة - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '2', 'img33.JPG', '16', '1618', '9.25', NULL),
(34, '2020-10-13 18:51:35', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', '2 SP', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2000-10-18', 'Kouba - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '6', 'img34.JPG', '16', '1614', '11.19', NULL),
(35, '2020-10-13 23:24:30', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2002-10-30', 'Kouba - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img35.JPG', '16', '1617', '8.49', NULL),
(36, '2020-10-13 23:26:45', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2000-08-30', 'Kouba - Alger', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img36.JPG', '16', '1618', '8.49', NULL),
(37, '2020-10-13 23:32:01', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2000-09-30', 'Erg Ferradj - Béchar', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img37.JPG', '17', '1716', '8.49', NULL),
(38, '2020-10-13 23:34:43', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '1999-09-30', 'بوروبة - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '4', 'img38.JPG', '16', '1616', '8.49', NULL),
(39, '2020-10-13 23:36:15', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '1998-09-30', 'بوروبة - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '4', 'img39.JPG', '16', '1616', '8.49', NULL),
(40, '2020-10-17 22:54:00', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2005-05-30', 'القبة - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '1', 'img40.JPG', '16', '1613', '11.19', '10'),
(41, '2020-10-17 22:56:07', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'TASSILI AIRLINES', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2005-05-30', 'رحوية - تيارت', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '1', 'img41.JPG', '15', '1517', '11.19', '10'),
(42, '2020-10-18 11:55:43', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2001-04-23', 'حسين داي - الجزائر العاصمة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '7', 'img42.JPG', '16', '1617', '10', NULL),
(43, '2020-10-18 12:08:08', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2000-04-23', 'قطارة - الجلفة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '1', 'img43.JPG', '22', '2217', '10', '11'),
(44, '2020-10-18 12:11:34', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '1999-04-23', 'الجزائر الوسطى - الجزائر العاص', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img44.JPG', '16', '1618', '12', '11'),
(45, '2020-10-18 12:14:34', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'NAFTAL', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '1998-04-23', 'عين السخونة - سعيدة', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '7', 'img45.JPG', '14', '1415', '12', '11');

-- --------------------------------------------------------

--
-- Structure de la table `inscription_etablissement_choix`
--

CREATE TABLE `inscription_etablissement_choix` (
  `id` int(11) NOT NULL,
  `id_formation` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `id_inscription` int(11) NOT NULL,
  `choix` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_etablissement_choix`
--

INSERT INTO `inscription_etablissement_choix` (`id`, `id_formation`, `designation`, `id_inscription`, `choix`) VALUES
(1, 6, 'السنة الثانية تسيير و اقتصاد', 1, 2),
(2, 7, 'السنة الثانية ثانوي علوم تجريبية', 1, 1),
(3, 6, 'السنة الثانية تسيير و اقتصاد', 2, 2),
(4, 7, 'السنة الثانية ثانوي علوم تجريبية', 2, 1),
(5, 6, 'السنة الثانية تسيير و اقتصاد', 3, 1),
(6, 7, 'السنة الثانية ثانوي علوم تجريبية', 3, 2),
(7, 6, 'السنة الثانية تسيير و اقتصاد', 3, 2),
(8, 7, 'السنة الثانية ثانوي علوم تجريبية', 3, 1),
(9, 6, 'السنة الثانية تسيير و اقتصاد', 3, 2),
(10, 7, 'السنة الثانية ثانوي علوم تجريبية', 3, 1),
(11, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 4, 1),
(12, 3, 'السنة الأولى ثانوي جذع مشترك علوم و تكنولوجيا', 4, 2),
(13, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 4, 2),
(14, 3, 'السنة الأولى ثانوي جذع مشترك علوم و تكنولوجيا', 4, 1),
(15, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 5, 1),
(16, 3, 'السنة الأولى ثانوي جذع مشترك علوم و تكنولوجيا', 5, 2),
(17, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 6, 2),
(18, 3, 'السنة الأولى ثانوي جذع مشترك علوم و تكنولوجيا', 6, 1),
(19, 7, 'السنة الثانية ثانوي علوم تجريبية', 19, 1),
(20, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 21, 1),
(21, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 32, 1),
(22, 4, 'السنة الثانية ثانوي آداب و لغات', 33, 1),
(23, 5, 'السنة الثانية ثانوي آداب و فلسفة', 33, 2),
(24, 10, 'السنة الثالثة تسيير و اقتصاد', 34, 1),
(25, 4, 'السنة الثانية ثانوي آداب و لغات', 35, 1),
(26, 4, 'السنة الثانية ثانوي آداب و لغات', 36, 1),
(27, 4, 'السنة الثانية ثانوي آداب و لغات', 37, 1),
(28, 4, 'السنة الثانية ثانوي آداب و لغات', 38, 1),
(29, 4, 'السنة الثانية ثانوي آداب و لغات', 39, 1),
(30, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 40, 1),
(31, 3, 'السنة الأولى ثانوي جذع مشترك علوم و تكنولوجيا', 40, 2),
(32, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 41, 1),
(33, 11, 'السنة الثالثة ثانوي علوم تجريبية', 42, 1),
(34, 2, 'السنة الأولى ثانوي جذع مشترك آداب', 43, 2),
(35, 3, 'السنة الأولى ثانوي جذع مشترك علوم و تكنولوجيا', 43, 1),
(36, 6, 'السنة الثانية تسيير و اقتصاد', 44, 1),
(37, 7, 'السنة الثانية ثانوي علوم تجريبية', 44, 2),
(38, 11, 'السنة الثالثة ثانوي علوم تجريبية', 45, 1);

-- --------------------------------------------------------

--
-- Structure de la table `inscription_institut`
--

CREATE TABLE `inscription_institut` (
  `ID` int(11) NOT NULL,
  `DAT` datetime DEFAULT NULL,
  `NOMA` varchar(30) DEFAULT NULL,
  `PRENOMA` varchar(30) DEFAULT NULL,
  `LIP` varchar(2) DEFAULT NULL,
  `FONC` varchar(30) DEFAULT NULL,
  `MATA` varchar(16) DEFAULT NULL,
  `DIRA` varchar(30) DEFAULT NULL,
  `ENTRA` varchar(30) DEFAULT NULL,
  `ADRA` varchar(60) DEFAULT NULL,
  `NPHA` varchar(15) DEFAULT NULL,
  `NOME` varchar(30) DEFAULT NULL,
  `PRENOME` varchar(30) DEFAULT NULL,
  `NOMAR` varchar(30) DEFAULT NULL,
  `PRENOMAR` varchar(30) DEFAULT NULL,
  `SEXE` varchar(1) DEFAULT NULL,
  `DATN` date DEFAULT NULL,
  `LIEU` varchar(30) DEFAULT NULL,
  `ADR` varchar(60) DEFAULT NULL,
  `MAIL` varchar(40) DEFAULT NULL,
  `NPHE` varchar(15) DEFAULT NULL,
  `NPHT` varchar(15) DEFAULT NULL,
  `NPHF` varchar(15) DEFAULT NULL,
  `ANNEE` varchar(9) DEFAULT NULL,
  `NIVS` varchar(6) DEFAULT NULL,
  `PHOTO` varchar(50) DEFAULT NULL,
  `WILAYA_N` varchar(50) DEFAULT NULL,
  `COMMUNE_N` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_institut`
--

INSERT INTO `inscription_institut` (`ID`, `DAT`, `NOMA`, `PRENOMA`, `LIP`, `FONC`, `MATA`, `DIRA`, `ENTRA`, `ADRA`, `NPHA`, `NOME`, `PRENOME`, `NOMAR`, `PRENOMAR`, `SEXE`, `DATN`, `LIEU`, `ADR`, `MAIL`, `NPHE`, `NPHT`, `NPHF`, `ANNEE`, `NIVS`, `PHOTO`, `WILAYA_N`, `COMMUNE_N`) VALUES
(1, '2020-10-08 15:05:32', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SOTRAZ', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2000-09-10', 'Kouba - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '4', 'img1.JPG', '16', '1618'),
(2, '2020-09-02 18:27:37', 'taibi', 'mohamed', 'DD', 'CHEF DE SERVICE', '12121GGJJ12', 'DIRECTION', 'SONATRACH', 'CITE 385 LOG', '12111222', 'TAIBI', 'KHALED', 'طابي', 'خالد', 'M', '1979-09-24', '1654 - 16', 'CITE 385 LOG', 'taibikhaled@gmail.com', '02112121', '0553286245', '02155517', '2020', '5', 'img2.JPG', '16', '1614'),
(3, '2020-09-13 16:41:23', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'MIP', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2001-04-25', 'Kouba - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '22121212', '2020', '5', 'img3.JPG', '16', '1618'),
(4, '2020-09-24 15:00:47', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SONATRACH', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2001-09-23', 'Kouba - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '22121212', '2020', '5', 'img4.JPG', '16', '1613'),
(5, '2020-10-08 16:14:26', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', '2 SP', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '2003-01-01', 'Kouba - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img5.JPG', '16', '1616'),
(6, '2020-10-13 22:52:21', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SOMIK', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'M', '2000-12-23', 'Ahl El Ksar - bouira', 'حي المنظر الجميل عمارة ا1 مدخل ا رقم 11', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img6.JPG', '15', '1519'),
(7, '2020-10-14 11:53:37', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'SONATRACH', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1999-05-20', 'Kouba - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '4', 'img7.JPG', '16', '1616'),
(8, '2020-10-15 11:14:08', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SONATRACH', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1999-05-30', 'Birkhadem - Alger', 'cite 385 log', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '5', 'img8.JPG', '18', '1819'),
(9, '2020-10-17 19:39:33', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'GSP - MCA', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '2002-01-23', 'Kouba - Alger', 'cite 385 log', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img9.JPG', '16', '1618'),
(10, '2020-10-17 21:15:56', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'HELIOS SPA', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '1984-09-22', 'Baraki - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '22121212', '2020', '4', 'img10.JPG', '16', '1618'),
(11, '2020-10-17 22:08:21', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'HELIOS SPA', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '1981-09-22', 'Hussein Dey - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '5', 'img11.JPG', '19', '1935');

-- --------------------------------------------------------

--
-- Structure de la table `inscription_institut_choix`
--

CREATE TABLE `inscription_institut_choix` (
  `id` int(11) NOT NULL,
  `id_formation` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `id_inscription` int(11) NOT NULL,
  `choix` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_institut_choix`
--

INSERT INTO `inscription_institut_choix` (`id`, `id_formation`, `designation`, `id_inscription`, `choix`) VALUES
(3, 2, 'CMTC', 2, 5),
(4, 3, 'TS  Commerce International', 2, 9),
(5, 4, 'TS  Gestion Ressource Humaines', 2, 1),
(6, 5, 'TS  Comptabilité de Gestion', 2, 4),
(7, 6, 'TS  Tourisme', 2, 3),
(8, 7, 'Master Finance et comptabilité', 2, 2),
(9, 1, 'CMP Comptabilité ou CAP', 3, 2),
(10, 3, 'TS  Commerce International', 3, 1),
(11, 5, 'TS  Comptabilité de Gestion', 3, 4),
(12, 1, 'CMP Comptabilité ou CAP', 4, 8),
(13, 2, 'CMTC', 4, 3),
(14, 4, 'TS  Gestion Ressource Humaines', 4, 2),
(15, 8, 'Master Administration des Affaires', 4, 1),
(16, 1, 'CMP Comptabilité ou CAP', 1, 6),
(17, 2, 'CMTC', 1, 5),
(18, 3, 'TS  Commerce International', 1, 4),
(19, 4, 'TS  Gestion Ressource Humaines', 1, 3),
(20, 5, 'TS  Comptabilité de Gestion', 1, 2),
(21, 6, 'TS  Tourisme', 1, 1),
(22, 1, 'CMP Comptabilité ou CAP', 5, 1),
(23, 2, 'CMTC', 5, 2),
(24, 1, 'CMP Comptabilité ou CAP', 6, 1),
(25, 2, 'CMTC', 6, 5),
(26, 3, 'TS  Commerce International', 6, 3),
(27, 4, 'TS  Gestion Ressource Humaines', 6, 2),
(28, 5, 'TS  Comptabilité de Gestion', 6, 4),
(29, 6, 'TS  Tourisme', 6, 6),
(30, 3, 'TS  Commerce International', 7, 3),
(31, 4, 'TS  Gestion Ressource Humaines', 7, 2),
(32, 5, 'TS  Comptabilité de Gestion', 7, 1),
(33, 1, 'CMP Comptabilité ou CAP', 8, 1),
(34, 2, 'CMTC', 8, 3),
(35, 3, 'TS  Commerce International', 8, 4),
(36, 5, 'TS  Comptabilité de Gestion', 8, 2),
(37, 7, 'Master Finance et comptabilité', 8, 6),
(38, 1, 'CMP Comptabilité ou CAP', 9, 2),
(39, 2, 'CMTC', 9, 4),
(40, 3, 'TS  Commerce International', 9, 3),
(41, 4, 'TS  Gestion Ressource Humaines', 9, 5),
(42, 5, 'TS  Comptabilité de Gestion', 9, 6),
(43, 6, 'TS  Tourisme', 9, 1),
(44, 1, 'CMP Comptabilité ou CAP', 9, 1),
(45, 2, 'CMTC', 9, 2),
(46, 3, 'TS  Commerce International', 9, 3),
(47, 4, 'TS  Gestion Ressource Humaines', 9, 4),
(48, 5, 'TS  Comptabilité de Gestion', 9, 6),
(49, 1, 'CMP Comptabilité ou CAP', 10, 5),
(50, 2, 'CMTC', 10, 6),
(51, 3, 'TS  Commerce International', 10, 2),
(52, 4, 'TS  Gestion Ressource Humaines', 10, 1),
(53, 5, 'TS  Comptabilité de Gestion', 10, 3),
(54, 6, 'TS  Tourisme', 10, 4),
(59, 1, 'CMP Comptabilité ou CAP', 11, 1),
(60, 7, 'Master Finance et comptabilité', 11, 5),
(61, 8, 'Master Administration des Affaires', 11, 4);

-- --------------------------------------------------------

--
-- Structure de la table `inscription_oran`
--

CREATE TABLE `inscription_oran` (
  `ID` int(11) NOT NULL,
  `DAT` datetime DEFAULT NULL,
  `NOMA` varchar(30) DEFAULT NULL,
  `PRENOMA` varchar(30) DEFAULT NULL,
  `LIP` varchar(2) DEFAULT NULL,
  `FONC` varchar(30) DEFAULT NULL,
  `MATA` varchar(16) DEFAULT NULL,
  `DIRA` varchar(30) DEFAULT NULL,
  `ENTRA` varchar(30) DEFAULT NULL,
  `ADRA` varchar(60) DEFAULT NULL,
  `NPHA` varchar(15) DEFAULT NULL,
  `NOME` varchar(30) DEFAULT NULL,
  `PRENOME` varchar(30) DEFAULT NULL,
  `NOMAR` varchar(30) DEFAULT NULL,
  `PRENOMAR` varchar(30) DEFAULT NULL,
  `SEXE` varchar(1) DEFAULT NULL,
  `DATN` date DEFAULT NULL,
  `LIEU` varchar(30) DEFAULT NULL,
  `ADR` varchar(60) DEFAULT NULL,
  `MAIL` varchar(40) DEFAULT NULL,
  `NPHE` varchar(15) DEFAULT NULL,
  `NPHT` varchar(15) DEFAULT NULL,
  `NPHF` varchar(15) DEFAULT NULL,
  `ANNEE` varchar(9) DEFAULT NULL,
  `NIVS` varchar(6) DEFAULT NULL,
  `PHOTO` varchar(50) DEFAULT NULL,
  `WILAYA_N` varchar(50) DEFAULT NULL,
  `COMMUNE_N` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_oran`
--

INSERT INTO `inscription_oran` (`ID`, `DAT`, `NOMA`, `PRENOMA`, `LIP`, `FONC`, `MATA`, `DIRA`, `ENTRA`, `ADRA`, `NPHA`, `NOME`, `PRENOME`, `NOMAR`, `PRENOMAR`, `SEXE`, `DATN`, `LIEU`, `ADR`, `MAIL`, `NPHE`, `NPHT`, `NPHF`, `ANNEE`, `NIVS`, `PHOTO`, `WILAYA_N`, `COMMUNE_N`) VALUES
(1, '2020-10-08 16:02:41', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'SOMIK', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '1982-09-20', 'Kouba - Alger', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '3', 'img1.JPG', '16', '1618'),
(2, '2020-10-13 23:03:45', 'taibi', 'khaled', 'DD', 'CHEF DE SCE', '121212122DD', 'DIRECTION', 'COGIZ', 'CITE MAYA', '0553286246', 'ghennai', 'chaima', 'غناي', 'شيماء', 'F', '1998-11-26', 'Kouba - Alger', 'cite 385 log', 'ghennaiassilo@gmail.com', '0782821545', '0553286246', '22121212', '2020', '3', 'img2.JPG', '16', '1618'),
(3, '2020-10-17 22:36:54', 'taibi', 'khaled', 'DD', 'CHEF DE SCE INFORM', '121212122DD', 'DIRECTION', 'COGIZ', 'CITE MAYA', '0553286246', 'taibi', 'khaled', 'طايبي', 'خالد', 'M', '1993-06-29', 'Mers El Kebir - Oran', 'cite 385 log', 'taibikhaled1982@gmail.com', '0782821545', '0553286246', '0553286246', '2020', '7', 'img3.JPG', '31', '3114');

-- --------------------------------------------------------

--
-- Structure de la table `inscription_oran_choix`
--

CREATE TABLE `inscription_oran_choix` (
  `id` int(11) NOT NULL,
  `id_formation` int(11) NOT NULL,
  `designation` varchar(200) NOT NULL,
  `id_inscription` int(11) NOT NULL,
  `choix` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `inscription_oran_choix`
--

INSERT INTO `inscription_oran_choix` (`id`, `id_formation`, `designation`, `id_inscription`, `choix`) VALUES
(8, 1, 'CMP Comptabilité ou CAP', 1, 1),
(9, 2, 'CMTC', 1, 2),
(10, 1, 'CMP Comptabilité ou CAP', 2, 1),
(11, 2, 'CMTC', 2, 2),
(15, 8, 'Master Professionnel en Management', 3, 1);

-- --------------------------------------------------------

--
-- Structure de la table `matiere`
--

CREATE TABLE `matiere` (
  `id` int(11) NOT NULL,
  `code_mat` varchar(20) NOT NULL,
  `lib_matiere` varchar(200) NOT NULL,
  `cat_formation` varchar(30) NOT NULL,
  `id_niveau_filialle` int(11) DEFAULT NULL,
  `id_specialite` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `matiere`
--

INSERT INTO `matiere` (`id`, `code_mat`, `lib_matiere`, `cat_formation`, `id_niveau_filialle`, `id_specialite`) VALUES
(1, 'INF', 'INFORMATIQUE', 'FP', 1, 0),
(2, 'CG', 'COMPTABILITE GENERALE', 'FP', 1, 0),
(3, 'LG', 'LIGISLATION', 'FP', 1, 0),
(4, 'COM', 'COMMERCE', 'FP', 1, 0);

-- --------------------------------------------------------

--
-- Structure de la table `matiere_bejaia`
--

CREATE TABLE `matiere_bejaia` (
  `id` int(11) NOT NULL,
  `CLDEM` varchar(30) NOT NULL,
  `CODMAT` varchar(30) NOT NULL,
  `DESIGNATION` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `matiere_bejaia`
--

INSERT INTO `matiere_bejaia` (`id`, `CLDEM`, `CODMAT`, `DESIGNATION`) VALUES
(38, 'CAP', 'AC', 'Arithmétiques Commerciales'),
(39, 'CAP', 'CC', 'Correspondance Commerciale'),
(40, 'CAP', 'CG', 'Comptabilité Générale'),
(41, 'CAP', 'CL', 'Classement'),
(42, 'CAP', 'CMC', 'Commerce'),
(43, 'CAP', 'CR', 'Calcul Rapide'),
(44, 'CAP', 'CU', 'Comptabilité Usuelle'),
(45, 'CAP', 'DCM', 'Droit Commercial'),
(46, 'CAP', 'EE', 'Economie d Entreprise'),
(47, 'CAP', 'FRA', 'Langue Française'),
(48, 'CAP', 'INF', 'Informatique'),
(49, 'CAP', 'LEG', 'Législation du Travail'),
(50, 'CAP', 'MF', 'Mathématiques Financières'),
(51, 'CAP', 'MG', 'Mathématiques Générales'),
(52, 'CED', 'ARB', 'Langue Arabe'),
(53, 'CED', 'DCM', 'Droit Commercial'),
(54, 'CED', 'DCV', 'Droit Civil'),
(55, 'CED', 'DPN', 'Droit Pénal'),
(56, 'CED', 'DRI', 'Droit International'),
(57, 'CED', 'DSL', 'Droit Social'),
(58, 'CED', 'EE', 'Economie d Entreprise'),
(59, 'CED', 'EG', 'Economie Générale'),
(60, 'CED', 'EPF', 'Economie Politique et Financière'),
(61, 'CED', 'FSC', 'Fiscalité'),
(62, 'CED', 'PBS', 'Probabilités et Statistiques'),
(107, 'CMTC', 'ANG', 'Langue Anglaise'),
(108, 'CMTC', 'CA', 'Comptabilité Analytique'),
(109, 'CMTC', 'CC', 'Correspondance Commerciale'),
(110, 'CMTC', 'CG', 'Comptabilité Générale'),
(111, 'CMTC', 'CMC', 'Commerce'),
(112, 'CMTC', 'CU', 'Comptabilité Usuelle'),
(113, 'CMTC', 'EE', 'Economie d Entreprise'),
(114, 'CMTC', 'EG', 'Economie Générale'),
(115, 'CMTC', 'FR', 'Techniques d Expression'),
(116, 'CMTC', 'FSC', 'Fiscalité'),
(117, 'CMTC', 'INF', 'Informatique'),
(118, 'CMTC', 'LEG', 'Législation du Travail'),
(119, 'CMTC', 'MF', 'Mathématiques Financières'),
(120, 'CMTC', 'MG', 'Mathématiques Générales'),
(121, 'CMTC', 'ST', 'Statistiques'),
(141, 'EE', 'ADP', 'Application Démarche Pédagogique'),
(142, 'EE', 'AERP', 'Accueil Enfants & Réception Parents'),
(143, 'EE', 'ANBY', 'Application Notions de Base de l Hygiène'),
(144, 'EE', 'APAE', 'Adaptation Programme Annuel Educatif'),
(145, 'EE', 'COM', 'Communication'),
(146, 'EE', 'DNBP', 'Développement Notions de Bases de la Psychologie'),
(147, 'EE', 'DTV', 'Droit du Travail'),
(148, 'EE', 'ERPE', 'Etablissement Relations Parents & Enfants'),
(149, 'EE', 'EVA', 'Evaluation des Activités'),
(150, 'EE', 'FR', 'Techniques d Expression'),
(151, 'EE', 'IBE', 'Identification des Besoins de l Enfant'),
(152, 'EE', 'INF', 'Informatique'),
(153, 'EE', 'IPE', 'Initiation é la Psychologie de l Enfant'),
(154, 'EE', 'IPS', 'Initiation é la Psychologie'),
(155, 'EE', 'LEG', 'Législation du Travail'),
(156, 'EE', 'MET', 'Méthodologie de Recherche'),
(157, 'EE', 'MG', 'Mathématiques Générales'),
(158, 'EE', 'NBY', 'Notions de Bases de l Hygiène'),
(159, 'EE', 'OAQ', 'Organisation des Activités Quotidiennes'),
(160, 'EE', 'ORP', 'Organisation des Repas'),
(161, 'EE', 'PEVS', 'Préparation de l Enfant é la Vie Scolaire'),
(162, 'EE', 'PSE', 'Psychologie de l Enfant'),
(163, 'EE', 'PSU', 'Premiers Soins d Urgence'),
(164, 'EE', 'RHY', 'Règles d Hygiène'),
(165, 'EE', 'TEEC', 'Techniques d Expression et Education Civique'),
(241, 'INF', 'ACC', 'Access'),
(242, 'INF', 'ALG', 'Algorithme'),
(243, 'INF', 'ANG', 'Langue Anglaise'),
(244, 'INF', 'BUR', 'Bureautique'),
(245, 'INF', 'DLP', 'Delphi'),
(246, 'INF', 'DLPR', 'Delphi  Réseau'),
(247, 'INF', 'FIC', 'Fichier'),
(248, 'INF', 'FPG', 'Finalisation Programmes'),
(249, 'INF', 'FR', 'Techniques d Expression'),
(250, 'INF', 'OGE', 'Organisation et Gestion des Entreprises'),
(251, 'INF', 'PAS', 'Pascal'),
(252, 'INF', 'PBS', 'Probabilités et Statistiques'),
(253, 'INF', 'RES', 'Réseau'),
(254, 'INF', 'RO', 'Recherche Opérationnelle'),
(255, 'INF', 'SDD', 'Structure de Données'),
(256, 'INF', 'SGBD', 'Système Gestion des Bases de Données'),
(257, 'INF', 'SM', 'Structure Machines'),
(258, 'INF', 'SQL', 'S.Q.L'),
(259, 'INF', 'SQLS', 'SQL Server'),
(260, 'INF', 'ST', 'Statistiques'),
(429, 'TSC', 'AEF', 'Analyse des Etats Financiers'),
(430, 'TSC', 'ANG', 'Langue Anglaise'),
(431, 'TSC', 'CA', 'Comptabilité Analytique'),
(432, 'TSC', 'COM', 'Communication'),
(433, 'TSC', 'CPS', 'Comptabilisation des Salaires'),
(434, 'TSC', 'CTP', 'Comptabilité Publique'),
(435, 'TSC', 'CTS', 'Comptabilité des Sociétés'),
(436, 'TSC', 'DMC', 'Documents Commerciaux'),
(437, 'TSC', 'EEF', 'Elaboration des Etats Financiers'),
(438, 'TSC', 'EVE', 'Environnement Economique'),
(439, 'TSC', 'EVJ', 'Environnement Juridique'),
(440, 'TSC', 'FR', 'Techniques d Expression'),
(441, 'TSC', 'GB', 'Gestion Budgétaire'),
(442, 'TSC', 'GCOC', 'Gestion Comptable des Opérations Commerciales'),
(443, 'TSC', 'GFS', 'Gestion Fiscale'),
(444, 'TSC', 'GIM', 'Gestion des Immobilisations'),
(445, 'TSC', 'GST', 'Gestion de la Trésorerie'),
(446, 'TSC', 'INF', 'Informatique'),
(447, 'TSC', 'MET', 'Méthodologie de Recherche'),
(448, 'TSC', 'MF', 'Mathématiques Financières'),
(449, 'TSC', 'MG', 'Mathématiques Générales'),
(450, 'TSC', 'STD', 'Statistiques Descriptives'),
(451, 'TSC', 'TFE', 'Travaux de Fin d Exercice');

-- --------------------------------------------------------

--
-- Structure de la table `matiere_ecole`
--

CREATE TABLE `matiere_ecole` (
  `id` int(11) NOT NULL,
  `CLDEM` varchar(30) NOT NULL,
  `CODMAT` varchar(30) NOT NULL,
  `DESIGNATION` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `matiere_ecole`
--

INSERT INTO `matiere_ecole` (`id`, `CLDEM`, `CODMAT`, `DESIGNATION`) VALUES
(2, 'CAP', 'AC', 'Arithmétique Commerciale'),
(3, 'CAP', 'CC', 'Correspondance Commerciale'),
(4, 'CAP', 'CG', 'Comptabilité Générale'),
(5, 'CAP', 'CL', 'Classement'),
(6, 'CAP', 'COM', 'Commerce et Documents Commerciaux'),
(7, 'CAP', 'INF', 'Informatique'),
(8, 'CAP', 'LEG', 'Législation'),
(9, 'CED', 'DCM', 'Droit Commercial'),
(10, 'CED', 'DCV', 'Droit Civil et Pénal'),
(11, 'CED', 'DS', 'Droit Social'),
(12, 'CED', 'EE', 'Economie d\'Entreprise'),
(13, 'CED', 'EG', 'Economie Générale'),
(14, 'CED', 'FISC', 'Fiscalité'),
(15, 'CMTC', 'CAE', 'Comptabilité  Analytique'),
(16, 'CMTC', 'CG', 'Comptabilité Générale'),
(17, 'CMTC', 'DC', 'Documents Commerciaux'),
(18, 'CMTC', 'INF', 'Informatique'),
(19, 'CMTC', 'MF', 'Mathématiques Financières'),
(20, 'DESS', 'ACF', 'Audit Comptable et Financier'),
(21, 'DESS', 'CMG', 'Comptabilité de Gestion'),
(22, 'DESS', 'CTR', 'Contrôle de Gestion'),
(23, 'DESS', 'DIF', 'Diagnostic Financier'),
(24, 'DESS', 'DPS', 'Droit Pénal des Sociétés'),
(25, 'DESS', 'DRS', 'Droit des Sociétés'),
(26, 'DESS', 'PPM', 'Principes et Pratique du Management'),
(27, 'DESS', 'PRA', 'Principes de l\'Audit et de Contrôle Interne'),
(28, 'DESS', 'SCG', 'Stratégie et Contrôle de Gestion'),
(29, 'ING', 'AGF', 'Analyse et Gestion Financière'),
(30, 'ING', 'CEN', 'Création d\'Entreprise'),
(31, 'ING', 'CMG', 'Comptabilité de Gestion'),
(32, 'ING', 'COMN', 'Communication et Négociation'),
(33, 'ING', 'CTR', 'Contrôle de Gestion'),
(34, 'ING', 'DAF', 'Droit des Affaires'),
(35, 'ING', 'DRC', 'Droit des Contrats'),
(36, 'ING', 'GRH', 'Gestion des Ressources Humaines'),
(37, 'ING', 'ISI', 'Informatique et Système d\'Information'),
(38, 'ING', 'MARK', 'Marketing et Gestion Commerciale'),
(39, 'ING', 'MET', 'Méthodologie'),
(40, 'ING', 'MGI', 'Management Industriel'),
(41, 'ING', 'MGP', 'Management de Projet'),
(42, 'ING', 'MGS', 'Management Stratégique'),
(43, 'ING', 'MKI', 'Marketing Industriel'),
(44, 'ING', 'MNG', 'Management Général'),
(45, 'ING', 'STG', 'Statistiques de Gestion'),
(46, 'ING2', 'AGF', 'Analyse et Gestion Financière'),
(47, 'ING2', 'CEN', 'Création d\'Entreprise'),
(48, 'ING2', 'CMG', 'Comptabilité de Gestion'),
(49, 'ING2', 'COMN', 'Communication et Négociation'),
(50, 'ING2', 'CTR', 'Contrôle de Gestion'),
(51, 'ING2', 'DAF', 'Droit des Affaires'),
(52, 'ING2', 'DRC', 'Droit des Contrats'),
(53, 'ING2', 'ECO', 'Economie'),
(54, 'ING2', 'GRH', 'Gestion des Ressources Humaines'),
(55, 'ING2', 'ISI', 'Informatique et Système d\'Information'),
(56, 'ING2', 'MARK', 'Marketing et Gestion Commerciale'),
(57, 'ING2', 'MET', 'Méthodologie'),
(58, 'ING2', 'MGP', 'Management de Projet'),
(59, 'ING2', 'MGS', 'Management Stratégique'),
(60, 'ING2', 'MKI', 'Marketing Industriel'),
(61, 'ING2', 'MNG', 'Management Général'),
(62, 'ING2', 'RO', 'Recherche Opérationnelle'),
(63, 'ING2', 'STG', 'Statistiques de Gestion'),
(64, 'ING3', 'AGF', 'Analyse et Gestion Financière'),
(65, 'ING3', 'CEN', 'Création d\'Entreprise'),
(66, 'ING3', 'CMG', 'Comptabilité de Gestion'),
(67, 'ING3', 'COMN', 'Communication et Négociation'),
(68, 'ING3', 'CTR', 'Contrôle de Gestion'),
(69, 'ING3', 'DAF', 'Droit des Affaires'),
(70, 'ING3', 'DRC', 'Droit des Contrats'),
(71, 'ING3', 'ECO', 'Economie'),
(72, 'ING3', 'GRH', 'Gestion des Ressources Humaines'),
(73, 'ING3', 'ISI', 'Informatique et Système d\'Information'),
(74, 'ING3', 'MARK', 'Marketing et Gestion Commerciale'),
(75, 'ING3', 'MET', 'Méthodologie'),
(76, 'ING3', 'MGI', 'Management Industriel'),
(77, 'ING3', 'MGP', 'Management de Projet'),
(78, 'ING3', 'MGS', 'Management Stratégique'),
(79, 'ING3', 'MKI', 'Marketing Industriel'),
(80, 'ING3', 'MNG', 'Management Général'),
(81, 'ING3', 'STG', 'Statistiques de Gestion'),
(82, 'ING4', 'AGF', 'Analyse et Gestion Financière'),
(83, 'ING4', 'ANG', 'Langue Anglaise'),
(84, 'ING4', 'CEN', 'Création d\'Entreprise'),
(85, 'ING4', 'CMG', 'Comptabilité de Gestion'),
(86, 'ING4', 'COMN', 'Communication et Négociation'),
(87, 'ING4', 'CTR', 'Contrôle de Gestion'),
(88, 'ING4', 'DAF', 'Droit des Affaires'),
(89, 'ING4', 'DRC', 'Droit des Contrats'),
(90, 'ING4', 'GRH', 'Gestion des Ressources Humaines'),
(91, 'ING4', 'ISI', 'Informatique et Système d\'Information'),
(92, 'ING4', 'MARK', 'Marketing et Gestion Commerciale'),
(93, 'ING4', 'MET', 'Méthodologie'),
(94, 'ING4', 'MGI', 'Management Industriel'),
(95, 'ING4', 'MGP', 'Management de Projet'),
(96, 'ING4', 'MGS', 'Management Stratégique'),
(97, 'ING4', 'MKI', 'Marketing Industriel'),
(98, 'ING4', 'MNG', 'Management Général'),
(99, 'ING4', 'STG', 'Statistiques de Gestion'),
(100, 'MCF', 'ADD', 'Analyse des Données'),
(101, 'MCF', 'ADF', 'Audit Financier'),
(102, 'MCF', 'AEP', 'Analyse et Evaluation des Projets'),
(103, 'MCF', 'AGF', 'Analyse et Gestion Financière'),
(104, 'MCF', 'CMG', 'Comptabilité de Gestion'),
(105, 'MCF', 'CPAP', 'Comptabilité Approfondie'),
(106, 'MCF', 'CTR', 'Contrôle de Gestion'),
(107, 'MCF', 'DRC', 'Droit des Contrats'),
(108, 'MCF', 'EE', 'Economie d\'Entreprise'),
(109, 'MCF', 'FMNG', 'Fondamentaux du Management'),
(110, 'MCF', 'FSR', 'Fiscalité et Réglementation'),
(111, 'MCF', 'MET', 'Méthodologie'),
(112, 'MCF', 'MGP', 'Management de Projet'),
(113, 'MCF', 'MGS', 'Management Stratégique'),
(114, 'MCF', 'MNG', 'Management Général'),
(115, 'MCF', 'TB', 'Techniques Bancaires'),
(116, 'MMG', 'ADD', 'Analyse des Données'),
(117, 'MMG', 'ANG', 'Langue Anglaise'),
(118, 'MMG', 'AUE', 'Audit d\'Entreprise'),
(119, 'MMG', 'CEN', 'Création d\'Entreprise'),
(120, 'MMG', 'CTR', 'Contrôle de Gestion'),
(121, 'MMG', 'DAF', 'Droit des Affaires'),
(122, 'MMG', 'DRC', 'Droit des Contrats'),
(123, 'MMG', 'GOE', 'Gouvernance d\'Entreprise'),
(124, 'MMG', 'GTF', 'Gestion Financière'),
(125, 'MMG', 'MET', 'Méthodologie'),
(126, 'MMG', 'MGP', 'Management de Projet'),
(127, 'MMG', 'MKI', 'Marketing Industriel'),
(128, 'MMG', 'MNG', 'Management Général'),
(129, 'MMG', 'MRH', 'Management des Ressources Humaines'),
(130, 'MMG', 'MSO', 'Marketing Stratégique et Opérationnel'),
(131, 'MMG', 'PMNG', 'Pratiques de Management'),
(132, 'MMG', 'STE', 'Stratégie d\'Entreprise'),
(133, 'MMG', 'TPD', 'Techniques d\'Aide é la Prise de Décision'),
(134, 'MRH', 'ANG', 'Langue Anglaise'),
(135, 'MRH', 'CMRH', 'Communication RH'),
(136, 'MRH', 'COG', 'Comportement Organisationnel'),
(137, 'MRH', 'DSS', 'Droit de la Sécurité Sociale'),
(138, 'MRH', 'DTOL', 'Droit du Travail et Obligations Légales'),
(139, 'MRH', 'ECT', 'Economie du Travail'),
(140, 'MRH', 'GCC', 'Gestion des Compétences et des Carrières'),
(141, 'MRH', 'GRH', 'Gestion des Ressources Humaines'),
(142, 'MRH', 'GTF', 'Gestion Financière'),
(143, 'MRH', 'MNP', 'Management de Projet RH et de Changement'),
(144, 'MRH', 'MNR', 'Management de la Rémunération'),
(145, 'MRH', 'PMNG', 'Pratiques de Management'),
(146, 'MRH', 'RICT', 'Relation Individuelle et Collective du Travail'),
(147, 'MRH', 'SIRH', 'Système d\'\'Information des Ressources Humaines'),
(148, 'MRH', 'STRH', 'Statistiques Appliquée aux Ressources Humaines');

-- --------------------------------------------------------

--
-- Structure de la table `matiere_etablissement`
--

CREATE TABLE `matiere_etablissement` (
  `id` int(11) NOT NULL,
  `CLDEM` varchar(30) NOT NULL,
  `CODMAT` varchar(30) NOT NULL,
  `DESIGNATION` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `matiere_etablissement`
--

INSERT INTO `matiere_etablissement` (`id`, `CLDEM`, `CODMAT`, `DESIGNATION`) VALUES
(1, '3ALF', 'math', 'رياضيات');

-- --------------------------------------------------------

--
-- Structure de la table `matiere_institut`
--

CREATE TABLE `matiere_institut` (
  `id` int(11) NOT NULL,
  `CLDEM` varchar(30) NOT NULL,
  `CODMAT` varchar(30) NOT NULL,
  `DESIGNATION` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `matiere_institut`
--

INSERT INTO `matiere_institut` (`id`, `CLDEM`, `CODMAT`, `DESIGNATION`) VALUES
(2, 'BPA', 'ARB', 'Langue Arabe'),
(3, 'BPA', 'BRA', 'Branche des Assurances'),
(4, 'BPA', 'BTA', 'Bases Techniques de l Assurance'),
(5, 'BPA', 'CG', 'Comptabilité Générale'),
(6, 'BPA', 'CGA', 'Comptabilité des Assurances'),
(7, 'BPA', 'DAS', 'Droit des Assurances'),
(8, 'BPA', 'DCM', 'Droit Commercial'),
(9, 'BPA', 'DCMC', 'Droit Commercial et Civil'),
(10, 'BPA', 'DCV', 'Droit Civil'),
(11, 'BPA', 'EG', 'Economie Générale'),
(12, 'BPA', 'MAP', 'Mathématiques Appliquées'),
(13, 'BPA', 'MRKA', 'Marketing des Assurances'),
(14, 'BPA', 'MST', 'Mathématiques & Statistiques'),
(15, 'BPA', 'OCA', 'Organisation des Compagnies d Assurance'),
(16, 'BPB', 'ACT', 'Accueil de la Clientèle'),
(17, 'BPB', 'ADV', 'Achat de la Devise'),
(18, 'BPB', 'ANG', 'Langue Anglaise'),
(19, 'BPB', 'CG', 'Comptabilité Générale'),
(20, 'BPB', 'DCM', 'Droit Commercial'),
(21, 'BPB', 'DCMC', 'Droit Commercial et Civil'),
(22, 'BPB', 'EECC', 'Encaissement des Effets de Commerce et des Chéques'),
(23, 'BPB', 'EG', 'Economie Générale'),
(24, 'BPB', 'EMFB', 'Economie Monétaire, Financière et Bancaire'),
(25, 'BPB', 'EOAV', 'Exécution des Opérations liées à l Achat ou à la Vente'),
(26, 'BPB', 'ESEC', 'Escompte des Effets de Commerce et des Chéques'),
(27, 'BPB', 'INF', 'Informatique'),
(28, 'BPB', 'MF', 'Mathématiques Financières'),
(29, 'BPB', 'MG', 'Mathématiques Générales'),
(30, 'BPB', 'PGOC', 'Participation é la Gestion des Opérations du Commerce'),
(31, 'BPB', 'ROD', 'Réalisation des Opérations de Dépôt'),
(32, 'BPB', 'ROPF', 'Réalisation des Opérations de Paiement de Fonds'),
(33, 'BPB', 'ROV', 'Réalisation des Opérations de Virement'),
(34, 'BPB', 'ST', 'Statistiques'),
(35, 'BPB', 'TEC', 'Techniques d Expression et de Communication'),
(36, 'BPB', 'TOI', 'Traitement des Opérations Internes'),
(37, 'BPB', 'VDV', 'Vente de la Devise'),
(38, 'CAP', 'AC', 'Arithmétiques Commerciales'),
(39, 'CAP', 'CC', 'Correspondance Commerciale'),
(40, 'CAP', 'CG', 'Comptabilité Générale'),
(41, 'CAP', 'CL', 'Classement'),
(42, 'CAP', 'CMC', 'Commerce'),
(43, 'CAP', 'CR', 'Calcul Rapide'),
(44, 'CAP', 'CU', 'Comptabilité Usuelle'),
(45, 'CAP', 'DCM', 'Droit Commercial'),
(46, 'CAP', 'EE', 'Economie d Entreprise'),
(47, 'CAP', 'FRA', 'Langue Française'),
(48, 'CAP', 'INF', 'Informatique'),
(49, 'CAP', 'LEG', 'Législation du Travail'),
(50, 'CAP', 'MF', 'Mathématiques Financières'),
(51, 'CAP', 'MG', 'Mathématiques Générales'),
(52, 'CED', 'ARB', 'Langue Arabe'),
(53, 'CED', 'DCM', 'Droit Commercial'),
(54, 'CED', 'DCV', 'Droit Civil'),
(55, 'CED', 'DPN', 'Droit Pénal'),
(56, 'CED', 'DRI', 'Droit International'),
(57, 'CED', 'DSL', 'Droit Social'),
(58, 'CED', 'EE', 'Economie d Entreprise'),
(59, 'CED', 'EG', 'Economie Générale'),
(60, 'CED', 'EPF', 'Economie Politique et Financière'),
(61, 'CED', 'FSC', 'Fiscalité'),
(62, 'CED', 'PBS', 'Probabilités et Statistiques'),
(63, 'CI', 'ANG', 'Langue Anglaise'),
(64, 'CI', 'CA', 'Comptabilité Analytique'),
(65, 'CI', 'CC', 'Correspondance Commerciale'),
(66, 'CI', 'CG', 'Comptabilité Générale'),
(67, 'CI', 'CI', 'Commerce International'),
(68, 'CI', 'COM', 'Communication'),
(69, 'CI', 'DCM', 'Droit Commercial'),
(70, 'CI', 'DMC', 'Documents Commerciaux'),
(71, 'CI', 'DSL', 'Droit Social'),
(72, 'CI', 'EE', 'Economie d Entreprise'),
(73, 'CI', 'EG', 'Economie Générale'),
(74, 'CI', 'EVE', 'Environnement Economique'),
(75, 'CI', 'EVJ', 'Environnement Juridique'),
(76, 'CI', 'EXMC', 'Exploitation des Moyens de Communication'),
(77, 'CI', 'FI', 'Finance Internationale'),
(78, 'CI', 'FOC', 'Financement des Opérations du Commerce International'),
(79, 'CI', 'FPV', 'Fixation des Prix de Vente'),
(80, 'CI', 'FR', 'Techniques d Expression'),
(81, 'CI', 'GF', 'Gestion Financière'),
(82, 'CI', 'GQT', 'Gestion de la Qualité'),
(83, 'CI', 'INF', 'Informatique'),
(84, 'CI', 'IPD', 'Imposition Douanière'),
(85, 'CI', 'LCI', 'Logistique du Commerce International'),
(86, 'CI', 'MET', 'Méthodologie de Recherche'),
(87, 'CI', 'MF', 'Mathématiques Financières'),
(88, 'CI', 'MG', 'Mathématiques Générales'),
(89, 'CI', 'MRK', 'Marketing'),
(90, 'CI', 'MRKI', 'Marketing International'),
(91, 'CI', 'MYP', 'Moyens de Paiement'),
(92, 'CI', 'NGC', 'Négociation Commerciale'),
(93, 'CI', 'OTG', 'Outils de Gestion'),
(94, 'CI', 'PCI', 'Pratique du Commerce International'),
(95, 'CI', 'PEX', 'Prospection à l Exportation'),
(96, 'CI', 'PIM', 'Prospection à l Importation'),
(97, 'CI', 'REI', 'Relations Economiques Internationales'),
(98, 'CI', 'SOE', 'Sélection de l Offre Etrangère'),
(99, 'CI', 'ST', 'Statistiques'),
(100, 'CI', 'STD', 'Statistiques Descriptives'),
(101, 'CI', 'TAS', 'Techniques d Assurance'),
(102, 'CI', 'TC', 'Techniques Commerciales'),
(103, 'CI', 'TCVR', 'Techniques de Couverture de Risque'),
(104, 'CI', 'TDF', 'Techniques Douanières et Fiscales'),
(105, 'CI', 'TMI', 'Transport de Marchandises é l International'),
(106, 'CI', 'TRS', 'Transport et Assurance'),
(107, 'CMTC', 'ANG', 'Langue Anglaise'),
(108, 'CMTC', 'CA', 'Comptabilité Analytique'),
(109, 'CMTC', 'CC', 'Correspondance Commerciale'),
(110, 'CMTC', 'CG', 'Comptabilité Générale'),
(111, 'CMTC', 'CMC', 'Commerce'),
(112, 'CMTC', 'CU', 'Comptabilité Usuelle'),
(113, 'CMTC', 'EE', 'Economie d Entreprise'),
(114, 'CMTC', 'EG', 'Economie Générale'),
(115, 'CMTC', 'FR', 'Techniques d Expression'),
(116, 'CMTC', 'FSC', 'Fiscalité'),
(117, 'CMTC', 'INF', 'Informatique'),
(118, 'CMTC', 'LEG', 'Législation du Travail'),
(119, 'CMTC', 'MF', 'Mathématiques Financières'),
(120, 'CMTC', 'MG', 'Mathématiques Générales'),
(121, 'CMTC', 'ST', 'Statistiques'),
(122, 'CP2', 'ARB', 'Langue Arabe'),
(123, 'CP2', 'CC', 'Correspondance Commerciale'),
(124, 'CP2', 'CG', 'Comptabilité Générale'),
(125, 'CP2', 'FRA', 'Langue Française'),
(126, 'CP2', 'HGO', 'Histoire & Géographie'),
(127, 'CP2', 'MAT', 'Mathématiques'),
(128, 'CP2', 'PHY', 'Physique'),
(129, 'CP2', 'SCI', 'Sciences'),
(130, 'DED', 'ACA', 'Assurances, Communication et Techniques d Accueil'),
(131, 'DED', 'ANG', 'Langue Anglaise'),
(132, 'DED', 'CI', 'Commerce International'),
(133, 'DED', 'DMC', 'Documents Commerciaux'),
(134, 'DED', 'FR', 'Techniques d Expression'),
(135, 'DED', 'INF', 'Informatique'),
(136, 'DED', 'LTA', 'Législation, Transport et Assurances'),
(137, 'DED', 'MF', 'Mathématiques Financières'),
(138, 'DED', 'TAD', 'Techniques Administratives'),
(139, 'DED', 'TB', 'Techniques Bancaires'),
(140, 'DED', 'TCD', 'Techniques Douanières'),
(141, 'EE', 'ADP', 'Application Démarche Pédagogique'),
(142, 'EE', 'AERP', 'Accueil Enfants & Réception Parents'),
(143, 'EE', 'ANBY', 'Application Notions de Base de l Hygiène'),
(144, 'EE', 'APAE', 'Adaptation Programme Annuel Educatif'),
(145, 'EE', 'COM', 'Communication'),
(146, 'EE', 'DNBP', 'Développement Notions de Bases de la Psychologie'),
(147, 'EE', 'DTV', 'Droit du Travail'),
(148, 'EE', 'ERPE', 'Etablissement Relations Parents & Enfants'),
(149, 'EE', 'EVA', 'Evaluation des Activités'),
(150, 'EE', 'FR', 'Techniques d Expression'),
(151, 'EE', 'IBE', 'Identification des Besoins de l Enfant'),
(152, 'EE', 'INF', 'Informatique'),
(153, 'EE', 'IPE', 'Initiation é la Psychologie de l Enfant'),
(154, 'EE', 'IPS', 'Initiation é la Psychologie'),
(155, 'EE', 'LEG', 'Législation du Travail'),
(156, 'EE', 'MET', 'Méthodologie de Recherche'),
(157, 'EE', 'MG', 'Mathématiques Générales'),
(158, 'EE', 'NBY', 'Notions de Bases de l Hygiène'),
(159, 'EE', 'OAQ', 'Organisation des Activités Quotidiennes'),
(160, 'EE', 'ORP', 'Organisation des Repas'),
(161, 'EE', 'PEVS', 'Préparation de l Enfant é la Vie Scolaire'),
(162, 'EE', 'PSE', 'Psychologie de l Enfant'),
(163, 'EE', 'PSU', 'Premiers Soins d Urgence'),
(164, 'EE', 'RHY', 'Règles d Hygiène'),
(165, 'EE', 'TEEC', 'Techniques d Expression et Education Civique'),
(166, 'GRH', 'ANG', 'Langue Anglaise'),
(167, 'GRH', 'ARB', 'Langue Arabe'),
(168, 'GRH', 'ARE', 'Absentéisme et Roulement des Effectifs'),
(169, 'GRH', 'ARP', 'Absentéisme et Roulement du Personnel'),
(170, 'GRH', 'CDC', 'Commerce et Documents Commerciaux'),
(171, 'GRH', 'CG', 'Comptabilité Générale'),
(172, 'GRH', 'CMP', 'Communication Professionnelle'),
(173, 'GRH', 'COM', 'Communication'),
(174, 'GRH', 'DCM', 'Droit Commercial'),
(175, 'GRH', 'DFP', 'Droit de la Fonction Publique'),
(176, 'GRH', 'DSL', 'Droit Social'),
(177, 'GRH', 'DSS', 'Droit de la Sécurité Sociale'),
(178, 'GRH', 'DTV', 'Droit du Travail'),
(179, 'GRH', 'DYG', 'Dynamique de Groupe'),
(180, 'GRH', 'EPT', 'Etude de Postes de Travail'),
(181, 'GRH', 'ERH', 'Evolution des Ressources Humaines'),
(182, 'GRH', 'ETP', 'Etudes de Postes'),
(183, 'GRH', 'EVP', 'Evaluation du Personnel'),
(184, 'GRH', 'EVRH', 'Evaluation des Ressources Humaines'),
(185, 'GRH', 'FDP', 'Formation et Développement du Personnel'),
(186, 'GRH', 'FDRH', 'Formation et Développement des Ressources Humaines'),
(187, 'GRH', 'FR', 'Techniques d Expression'),
(188, 'GRH', 'GCF', 'Gestion des Conflits'),
(189, 'GRH', 'GPEP', 'Gestion Prévisionnelle des Emplois et des Personnes'),
(190, 'GRH', 'GPRH', 'Gestion Prévisionnelle des Ressources Humaines'),
(191, 'GRH', 'GRH', 'Gestion des Ressources Humaines'),
(192, 'GRH', 'HYS', 'Hygiène et Sécurité'),
(193, 'GRH', 'INF', 'Informatique'),
(194, 'GRH', 'MET', 'Méthodologie de Recherche'),
(195, 'GRH', 'MF', 'Mathématiques Financières'),
(196, 'GRH', 'MG', 'Mathématiques Générales'),
(197, 'GRH', 'MGO', 'Management des Organismes'),
(198, 'GRH', 'MTV', 'Motivation'),
(199, 'GRH', 'OAM', 'Organisation Administrative'),
(200, 'GRH', 'OGE', 'Organisation et Gestion des Entreprises'),
(201, 'GRH', 'PDS', 'Prise de Décision'),
(202, 'GRH', 'PGRH', 'Politique de la Gestion des Ressources Humaines'),
(203, 'GRH', 'PHR', 'Phases de Recrutement'),
(204, 'GRH', 'PLF', 'Plan de Formation'),
(205, 'GRH', 'PYT', 'Psychologie du Travail'),
(206, 'GRH', 'RAD', 'Rédaction Administrative'),
(207, 'GRH', 'RLH', 'Relations Humaines'),
(208, 'GRH', 'RRH', 'Recrutement des Ressources Humaines'),
(209, 'GRH', 'RTP', 'Recrutement du Personnel'),
(210, 'GRH', 'SEP', 'Sécurité Professionnelle'),
(211, 'GRH', 'SRH', 'Stimulation des Ressources Humaines'),
(212, 'GRH', 'SSLT', 'Suivi Salariés en Matiére de la Législation du Travail'),
(213, 'GRH', 'ST', 'Statistiques'),
(214, 'GRH', 'STD', 'Statistiques Descriptives'),
(215, 'GRH', 'STP', 'Stimulation du Personnel'),
(216, 'GRH', 'TCR', 'Technique Rédactionnelle'),
(217, 'GRH', 'TEP', 'Traitement des Eléments de la Paie'),
(218, 'HTL', 'ANG', 'Langue Anglaise'),
(219, 'HTL', 'CG', 'Comptabilité Générale'),
(220, 'HTL', 'CHT', 'Correspondance Hôtelière'),
(221, 'HTL', 'CTL', 'Contrôle'),
(222, 'HTL', 'GET', 'Gestion des Etages'),
(223, 'HTL', 'GRV', 'Gestion de la Réservation'),
(224, 'HTL', 'GSR', 'Gestion de la Salle de Restaurant'),
(225, 'HTL', 'PLM', 'Planification des Menus'),
(226, 'HTL', 'RCP', 'Réception'),
(227, 'HTL', 'THC', 'Techniques d Accueil'),
(228, 'IAI', 'DLP', 'Delphi'),
(229, 'IAI', 'OGE', 'Organisation et Gestion des Entreprises'),
(230, 'IAI', 'ORA', 'Oracle'),
(231, 'IAI', 'PRB', 'Probabilités'),
(232, 'IAI', 'RES2', 'Réseau II'),
(233, 'IAI', 'RESI', 'Réseau I'),
(234, 'IAI', 'RO', 'Recherche Opérationnelle'),
(235, 'IAI', 'SDD', 'Structure de Données'),
(236, 'IAI', 'SE', 'Système d Exploitation'),
(237, 'IAI', 'SGBD', 'Système Gestion des Bases de Données'),
(238, 'IAI', 'SIM', 'Système d Information.  MERISE II'),
(239, 'IAI', 'SIU', 'Système d Information  U.M.L'),
(240, 'IAI', 'SQLS', 'SQL Server'),
(241, 'INF', 'ACC', 'Access'),
(242, 'INF', 'ALG', 'Algorithme'),
(243, 'INF', 'ANG', 'Langue Anglaise'),
(244, 'INF', 'BUR', 'Bureautique'),
(245, 'INF', 'DLP', 'Delphi'),
(246, 'INF', 'DLPR', 'Delphi  Réseau'),
(247, 'INF', 'FIC', 'Fichier'),
(248, 'INF', 'FPG', 'Finalisation Programmes'),
(249, 'INF', 'FR', 'Techniques d Expression'),
(250, 'INF', 'OGE', 'Organisation et Gestion des Entreprises'),
(251, 'INF', 'PAS', 'Pascal'),
(252, 'INF', 'PBS', 'Probabilités et Statistiques'),
(253, 'INF', 'RES', 'Réseau'),
(254, 'INF', 'RO', 'Recherche Opérationnelle'),
(255, 'INF', 'SDD', 'Structure de Données'),
(256, 'INF', 'SGBD', 'Système Gestion des Bases de Données'),
(257, 'INF', 'SM', 'Structure Machines'),
(258, 'INF', 'SQL', 'S.Q.L'),
(259, 'INF', 'SQLS', 'SQL Server'),
(260, 'INF', 'ST', 'Statistiques'),
(261, 'ING', 'AGF', 'Analyse & Gestion Financières'),
(262, 'ING', 'CGT', 'Contrôle de Gestion'),
(263, 'ING', 'CMG', 'Comptabilité de Gestion'),
(264, 'ING', 'CNG', 'Communication & Négociation'),
(265, 'ING', 'CSDP', 'Connaissance de Soi & Développement Personnel'),
(266, 'ING', 'DAF', 'Droit des Affaires'),
(267, 'ING', 'DCT', 'Droit des Contrats'),
(268, 'ING', 'EE', 'Economie d Entreprise'),
(269, 'ING', 'ESE', 'Entreprise et son Environnement'),
(270, 'ING', 'ETE', 'Entreprise et Environnement'),
(271, 'ING', 'FR', 'Techniques d Expression'),
(272, 'ING', 'GIO', 'Gestion Industrielle & Optimisation'),
(273, 'ING', 'GRH', 'Gestion des Ressources Humaines'),
(274, 'ING', 'ISI', 'Informatique et Système d Information'),
(275, 'ING', 'MGC', 'Marketing & Gestion Commerciale'),
(276, 'ING', 'MGML', 'Management Général & Organisation'),
(277, 'ING', 'MGP', 'Management de Projet'),
(278, 'ING', 'MKI', 'Marketing Industriel'),
(279, 'ING', 'MOP', 'Management Opérationnel'),
(280, 'ING', 'MSG', 'Management Stratégique'),
(281, 'ING', 'MTE', 'Méthodologie et Techniques d Expression'),
(282, 'ING', 'OML', 'Organisation, Management & Leadership'),
(283, 'ING', 'REI', 'Relations Economiques Internationales'),
(284, 'ING', 'STG', 'Statistiques de Gestion'),
(285, 'MAA', 'AGF', 'Analyse & Gestion Financières'),
(286, 'MAA', 'CGT', 'Contrôle de Gestion'),
(287, 'MAA', 'CMG', 'Comptabilité de Gestion'),
(288, 'MAA', 'CNG', 'Communication & Négociation'),
(289, 'MAA', 'CSDP', 'Connaissance de Soi & Développement Personnel'),
(290, 'MAA', 'DAF', 'Droit des Affaires'),
(291, 'MAA', 'EEE', 'Economie, Entreprise & Environnement'),
(292, 'MAA', 'EPBP', 'Evaluation de Projet & Business Plan'),
(293, 'MAA', 'ESE', 'Entreprise et son Environnement'),
(294, 'MAA', 'GIO', 'Gestion Industrielle & Optimisation'),
(295, 'MAA', 'GRHM', 'Gestion des Ressources Humaines & Motivation'),
(296, 'MAA', 'MBA', 'Marketing BtoB et Marketing des Achats'),
(297, 'MAA', 'MGC', 'Marketing & Gestion Commerciale'),
(298, 'MAA', 'MKI', 'Marketing Industriel'),
(299, 'MAA', 'MSG', 'Management Stratégique'),
(300, 'MAA', 'OML', 'Organisation, Management & Leadership'),
(301, 'MAA', 'STG', 'Statistiques de Gestion'),
(302, 'MARK', 'ANG', 'Langue Anglaise'),
(303, 'MARK', 'CA', 'Comptabilité Analytique'),
(304, 'MARK', 'CDC', 'Commerce et Documents Commerciaux'),
(305, 'MARK', 'CFM', 'Concepts Fondamentaux du Marketing'),
(306, 'MARK', 'CG', 'Comptabilité Générale'),
(307, 'MARK', 'CGT', 'Contrôle de Gestion'),
(308, 'MARK', 'COM', 'Communication'),
(309, 'MARK', 'CP', 'Comptabilité Prévisionnelle'),
(310, 'MARK', 'CPB', 'Campagne de Publicité'),
(311, 'MARK', 'DAF', 'Droit des Affaires'),
(312, 'MARK', 'DAM', 'Domaines d Application du Marketing'),
(313, 'MARK', 'DCM', 'Droit Commercial'),
(314, 'MARK', 'DMC', 'Documents Commerciaux'),
(315, 'MARK', 'EE', 'Economie d Entreprise'),
(316, 'MARK', 'EG', 'Economie Générale'),
(317, 'MARK', 'EVE', 'Environnement Economique'),
(318, 'MARK', 'EVJ', 'Environnement Juridique'),
(319, 'MARK', 'FR', 'Techniques d Expression'),
(320, 'MARK', 'GB', 'Gestion Budgétaire'),
(321, 'MARK', 'GFV', 'Gestion de la Force de Vente'),
(322, 'MARK', 'INF', 'Informatique'),
(323, 'MARK', 'LEG', 'Législation du Travail'),
(324, 'MARK', 'MET', 'Méthodologie de Recherche'),
(325, 'MARK', 'MF', 'Mathématiques Financières'),
(326, 'MARK', 'MG', 'Mathématiques Générales'),
(327, 'MARK', 'MKI', 'Marketing Industriel'),
(328, 'MARK', 'MKP', 'Marketing Prospectif'),
(329, 'MARK', 'MKS', 'Marketing Stratégique'),
(330, 'MARK', 'MRKS', 'Marketing de Service'),
(331, 'MARK', 'NRM', 'Négociation et Relation du Marketing'),
(332, 'MARK', 'PLC', 'Politique de Communication'),
(333, 'MARK', 'PLD', 'Politique de Distribution'),
(334, 'MARK', 'PMI', 'Prospection du Marché International'),
(335, 'MARK', 'PPP', 'Politique Produit Prix'),
(336, 'MARK', 'PPT', 'Politique de Produit'),
(337, 'MARK', 'PPX', 'Politique de Prix'),
(338, 'MARK', 'PYC', 'Psychologie du Comportement du Consommateur'),
(339, 'MARK', 'RO', 'Recherche Opérationnelle'),
(340, 'MARK', 'ST', 'Statistiques'),
(341, 'MARK', 'STD', 'Statistiques Descriptives'),
(342, 'MARK', 'TAPV', 'Techniques d Aménagement des Points de Vente'),
(343, 'MARK', 'TC', 'Techniques Commerciales'),
(344, 'MARK', 'TEM', 'Techniques d Enquête du Marketing'),
(345, 'MGRH', 'AS', 'Audit Social'),
(346, 'MGRH', 'CIIP', 'Communication Interne et Interpersonnelle'),
(347, 'MGRH', 'DTV', 'Droit du Travail'),
(348, 'MGRH', 'EEGR', 'Environnement de l Entreprise et Gestion des Ressources Humaines'),
(349, 'MGRH', 'FNF', 'Finance pour Non Financiers'),
(350, 'MGRH', 'GPEC', 'Gestion Prévisionnelle de l Emploi et des Compétences'),
(351, 'MGRH', 'LME', 'Leadership et Management d Equipe'),
(352, 'MGRH', 'MARP', 'Méthodes d Analyse et de Résolution des Problèmes'),
(353, 'MGRH', 'PIF', 'Politique et Ingénierie de la Formation'),
(354, 'MGRH', 'PRIC', 'Politique de Recrutement, d Intégration et de Conservation'),
(355, 'MGRH', 'SAGC', 'Système d Appréciation et Gestion des Carrières'),
(356, 'MGRH', 'SRCP', 'Système de Rémunération et Calcul de la Paie'),
(357, 'MGRH', 'STRH', 'Statistiques Appliquées aux Ressources Humaines'),
(358, 'MGRH', 'TBRH', 'Tableau de Bord des Ressources Humaines'),
(359, 'MI', 'ARI', 'Administration Réseaux Informatiques'),
(360, 'MI', 'DWN1', 'Développement WEB  Niveau 1'),
(361, 'MI', 'DWN2', 'Développement WEB  Niveau 2'),
(362, 'MI', 'JAVA', 'Langage JAVA'),
(363, 'MI', 'LAN', 'Logiciel  ASP.NET  (C-SHARP)'),
(364, 'MI', 'MCPI', 'Méthodes de Conduite de Projets Informatiques'),
(365, 'MI', 'OAD', 'Outils d Aide é la Décision'),
(366, 'MI', 'ODAI', 'Outils de Développement d Applications Informatiques'),
(367, 'MI', 'ORL', 'SGBD Oracle'),
(368, 'MI', 'SDD', 'Structure de Données'),
(369, 'MI', 'SI', 'Système d Information'),
(370, 'MI', 'SIU', 'Système d Information  U.M.L'),
(371, 'MI', 'SQLS', 'SQL Server'),
(372, 'THL', 'ACL', 'Accueil des Clients'),
(373, 'THL', 'ANG', 'Langue Anglaise'),
(374, 'THL', 'CG', 'Comptabilité Générale'),
(375, 'THL', 'CPT', 'Conception de Produits Touristiques'),
(376, 'THL', 'CSD', 'Création & Suivi des Dossiers'),
(377, 'THL', 'CST', 'Commentaire d un Site Touristique'),
(378, 'THL', 'CTL', 'Contrôle'),
(379, 'THL', 'DVG', 'Documents de Voyage'),
(380, 'THL', 'EMC', 'Etude du Marché'),
(381, 'THL', 'FR', 'Techniques d Expression'),
(382, 'THL', 'GCS', 'Gestion de la Caisse'),
(383, 'THL', 'GRT', 'Gestion de la Restauration'),
(384, 'THL', 'HAT', 'Histoire de l Art'),
(385, 'THL', 'HYS', 'Hygiène et Sécurité'),
(386, 'THL', 'INV', 'Inventaires'),
(387, 'THL', 'IPT', 'Inventaire Potentialités Touristiques'),
(388, 'THL', 'MET', 'Méthodologie de Recherche'),
(389, 'THL', 'MRKH', 'Marketing Hôtelier'),
(390, 'THL', 'MRKT', 'Marketing Touristique'),
(391, 'THL', 'NGN', 'Négociation'),
(392, 'THL', 'NGT', 'Négociation et Tarification'),
(393, 'THL', 'RCP', 'Réception'),
(394, 'THL', 'RGH', 'Réglementation Hôtelière'),
(395, 'THL', 'RGT', 'Réglementation Touristique'),
(396, 'THL', 'SCT', 'Suivi des Contrats'),
(397, 'THL', 'TAC', 'Techniques d Accompagnement'),
(398, 'THL', 'TRF', 'Tarification'),
(399, 'THL', 'VPT', 'Vente Produits Touristiques'),
(400, 'THP', 'ACL', 'Accueil des Clients'),
(401, 'THP', 'ANG', 'Langue Anglaise'),
(402, 'THP', 'CPT', 'Conception de Produits Touristiques'),
(403, 'THP', 'CST', 'Commentaire d un Site Touristique'),
(404, 'THP', 'DVG', 'Documents de Voyage'),
(405, 'THP', 'EMC', 'Etude du Marché'),
(406, 'THP', 'HAT', 'Histoire de l Art'),
(407, 'THP', 'IPT', 'Inventaire Potentialités Touristiques'),
(408, 'THP', 'NGN', 'Négociation'),
(409, 'TSA', 'ANG', 'Langue Anglaise'),
(410, 'TSA', 'CG', 'Comptabilité Générale'),
(411, 'TSA', 'CGA', 'Comptabilité des Assurances'),
(412, 'TSA', 'DAS', 'Droit des Assurances'),
(413, 'TSA', 'DCA', 'Droit Commercial & Droit des Assurances'),
(414, 'TSA', 'DCM', 'Droit Commercial'),
(415, 'TSA', 'DCV', 'Droit Civil'),
(416, 'TSA', 'EE', 'Economie d Entreprise'),
(417, 'TSA', 'EG', 'Economie Générale'),
(418, 'TSA', 'FR', 'Techniques d Expression'),
(419, 'TSA', 'INF', 'Informatique'),
(420, 'TSA', 'MET', 'Méthodologie de Recherche'),
(421, 'TSA', 'MF', 'Mathématiques Financières'),
(422, 'TSA', 'MG', 'Mathématiques Générales'),
(423, 'TSA', 'MRKA', 'Marketing des Assurances'),
(424, 'TSA', 'MRKS', 'Marketing de Service'),
(425, 'TSA', 'MST', 'Mathématiques & Statistiques'),
(426, 'TSA', 'OCA', 'Organisation des Compagnies d Assurance'),
(427, 'TSA', 'ST', 'Statistiques'),
(428, 'TSA', 'TAS', 'Techniques d Assurance'),
(429, 'TSC', 'AEF', 'Analyse des Etats Financiers'),
(430, 'TSC', 'ANG', 'Langue Anglaise'),
(431, 'TSC', 'CA', 'Comptabilité Analytique'),
(432, 'TSC', 'COM', 'Communication'),
(433, 'TSC', 'CPS', 'Comptabilisation des Salaires'),
(434, 'TSC', 'CTP', 'Comptabilité Publique'),
(435, 'TSC', 'CTS', 'Comptabilité des Sociétés'),
(436, 'TSC', 'DMC', 'Documents Commerciaux'),
(437, 'TSC', 'EEF', 'Elaboration des Etats Financiers'),
(438, 'TSC', 'EVE', 'Environnement Economique'),
(439, 'TSC', 'EVJ', 'Environnement Juridique'),
(440, 'TSC', 'FR', 'Techniques d Expression'),
(441, 'TSC', 'GB', 'Gestion Budgétaire'),
(442, 'TSC', 'GCOC', 'Gestion Comptable des Opérations Commerciales'),
(443, 'TSC', 'GFS', 'Gestion Fiscale'),
(444, 'TSC', 'GIM', 'Gestion des Immobilisations'),
(445, 'TSC', 'GST', 'Gestion de la Trésorerie'),
(446, 'TSC', 'INF', 'Informatique'),
(447, 'TSC', 'MET', 'Méthodologie de Recherche'),
(448, 'TSC', 'MF', 'Mathématiques Financières'),
(449, 'TSC', 'MG', 'Mathématiques Générales'),
(450, 'TSC', 'STD', 'Statistiques Descriptives'),
(451, 'TSC', 'TFE', 'Travaux de Fin d Exercice');

-- --------------------------------------------------------

--
-- Structure de la table `matiere_oran`
--

CREATE TABLE `matiere_oran` (
  `id` int(11) NOT NULL,
  `CLDEM` varchar(30) NOT NULL,
  `CODMAT` varchar(30) NOT NULL,
  `DESIGNATION` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `matiere_oran`
--

INSERT INTO `matiere_oran` (`id`, `CLDEM`, `CODMAT`, `DESIGNATION`) VALUES
(38, 'CAP', 'AC', 'Arithmétiques Commerciales'),
(39, 'CAP', 'CC', 'Correspondance Commerciale'),
(40, 'CAP', 'CG', 'Comptabilité Générale'),
(41, 'CAP', 'CL', 'Classement'),
(42, 'CAP', 'CMC', 'Commerce'),
(43, 'CAP', 'CR', 'Calcul Rapide'),
(44, 'CAP', 'CU', 'Comptabilité Usuelle'),
(45, 'CAP', 'DCM', 'Droit Commercial'),
(46, 'CAP', 'EE', 'Economie d Entreprise'),
(47, 'CAP', 'FRA', 'Langue Française'),
(48, 'CAP', 'INF', 'Informatique'),
(49, 'CAP', 'LEG', 'Législation du Travail'),
(50, 'CAP', 'MF', 'Mathématiques Financières'),
(51, 'CAP', 'MG', 'Mathématiques Générales'),
(63, 'CI', 'ANG', 'Langue Anglaise'),
(64, 'CI', 'CA', 'Comptabilité Analytique'),
(65, 'CI', 'CC', 'Correspondance Commerciale'),
(66, 'CI', 'CG', 'Comptabilité Générale'),
(67, 'CI', 'CI', 'Commerce International'),
(68, 'CI', 'COM', 'Communication'),
(69, 'CI', 'DCM', 'Droit Commercial'),
(70, 'CI', 'DMC', 'Documents Commerciaux'),
(71, 'CI', 'DSL', 'Droit Social'),
(72, 'CI', 'EE', 'Economie d Entreprise'),
(73, 'CI', 'EG', 'Economie Générale'),
(74, 'CI', 'EVE', 'Environnement Economique'),
(75, 'CI', 'EVJ', 'Environnement Juridique'),
(76, 'CI', 'EXMC', 'Exploitation des Moyens de Communication'),
(77, 'CI', 'FI', 'Finance Internationale'),
(78, 'CI', 'FOC', 'Financement des Opérations du Commerce International'),
(79, 'CI', 'FPV', 'Fixation des Prix de Vente'),
(80, 'CI', 'FR', 'Techniques d Expression'),
(81, 'CI', 'GF', 'Gestion Financière'),
(82, 'CI', 'GQT', 'Gestion de la Qualité'),
(83, 'CI', 'INF', 'Informatique'),
(84, 'CI', 'IPD', 'Imposition Douanière'),
(85, 'CI', 'LCI', 'Logistique du Commerce International'),
(86, 'CI', 'MET', 'Méthodologie de Recherche'),
(87, 'CI', 'MF', 'Mathématiques Financières'),
(88, 'CI', 'MG', 'Mathématiques Générales'),
(89, 'CI', 'MRK', 'Marketing'),
(90, 'CI', 'MRKI', 'Marketing International'),
(91, 'CI', 'MYP', 'Moyens de Paiement'),
(92, 'CI', 'NGC', 'Négociation Commerciale'),
(93, 'CI', 'OTG', 'Outils de Gestion'),
(94, 'CI', 'PCI', 'Pratique du Commerce International'),
(95, 'CI', 'PEX', 'Prospection à l Exportation'),
(96, 'CI', 'PIM', 'Prospection à l Importation'),
(97, 'CI', 'REI', 'Relations Economiques Internationales'),
(98, 'CI', 'SOE', 'Sélection de l Offre Etrangère'),
(99, 'CI', 'ST', 'Statistiques'),
(100, 'CI', 'STD', 'Statistiques Descriptives'),
(101, 'CI', 'TAS', 'Techniques d Assurance'),
(102, 'CI', 'TC', 'Techniques Commerciales'),
(103, 'CI', 'TCVR', 'Techniques de Couverture de Risque'),
(104, 'CI', 'TDF', 'Techniques Douanières et Fiscales'),
(105, 'CI', 'TMI', 'Transport de Marchandises é l International'),
(106, 'CI', 'TRS', 'Transport et Assurance'),
(107, 'CMTC', 'ANG', 'Langue Anglaise'),
(108, 'CMTC', 'CA', 'Comptabilité Analytique'),
(109, 'CMTC', 'CC', 'Correspondance Commerciale'),
(110, 'CMTC', 'CG', 'Comptabilité Générale'),
(111, 'CMTC', 'CMC', 'Commerce'),
(112, 'CMTC', 'CU', 'Comptabilité Usuelle'),
(113, 'CMTC', 'EE', 'Economie d Entreprise'),
(114, 'CMTC', 'EG', 'Economie Générale'),
(115, 'CMTC', 'FR', 'Techniques d Expression'),
(116, 'CMTC', 'FSC', 'Fiscalité'),
(117, 'CMTC', 'INF', 'Informatique'),
(118, 'CMTC', 'LEG', 'Législation du Travail'),
(119, 'CMTC', 'MF', 'Mathématiques Financières'),
(120, 'CMTC', 'MG', 'Mathématiques Générales'),
(121, 'CMTC', 'ST', 'Statistiques'),
(141, 'EE', 'ADP', 'Application Démarche Pédagogique'),
(142, 'EE', 'AERP', 'Accueil Enfants & Réception Parents'),
(143, 'EE', 'ANBY', 'Application Notions de Base de l Hygiène'),
(144, 'EE', 'APAE', 'Adaptation Programme Annuel Educatif'),
(145, 'EE', 'COM', 'Communication'),
(146, 'EE', 'DNBP', 'Développement Notions de Bases de la Psychologie'),
(147, 'EE', 'DTV', 'Droit du Travail'),
(148, 'EE', 'ERPE', 'Etablissement Relations Parents & Enfants'),
(149, 'EE', 'EVA', 'Evaluation des Activités'),
(150, 'EE', 'FR', 'Techniques d Expression'),
(151, 'EE', 'IBE', 'Identification des Besoins de l Enfant'),
(152, 'EE', 'INF', 'Informatique'),
(153, 'EE', 'IPE', 'Initiation é la Psychologie de l Enfant'),
(154, 'EE', 'IPS', 'Initiation é la Psychologie'),
(155, 'EE', 'LEG', 'Législation du Travail'),
(156, 'EE', 'MET', 'Méthodologie de Recherche'),
(157, 'EE', 'MG', 'Mathématiques Générales'),
(158, 'EE', 'NBY', 'Notions de Bases de l Hygiène'),
(159, 'EE', 'OAQ', 'Organisation des Activités Quotidiennes'),
(160, 'EE', 'ORP', 'Organisation des Repas'),
(161, 'EE', 'PEVS', 'Préparation de l Enfant é la Vie Scolaire'),
(162, 'EE', 'PSE', 'Psychologie de l Enfant'),
(163, 'EE', 'PSU', 'Premiers Soins d Urgence'),
(164, 'EE', 'RHY', 'Règles d Hygiène'),
(165, 'EE', 'TEEC', 'Techniques d Expression et Education Civique'),
(166, 'GRH', 'ANG', 'Langue Anglaise'),
(167, 'GRH', 'ARB', 'Langue Arabe'),
(168, 'GRH', 'ARE', 'Absentéisme et Roulement des Effectifs'),
(169, 'GRH', 'ARP', 'Absentéisme et Roulement du Personnel'),
(170, 'GRH', 'CDC', 'Commerce et Documents Commerciaux'),
(171, 'GRH', 'CG', 'Comptabilité Générale'),
(172, 'GRH', 'CMP', 'Communication Professionnelle'),
(173, 'GRH', 'COM', 'Communication'),
(174, 'GRH', 'DCM', 'Droit Commercial'),
(175, 'GRH', 'DFP', 'Droit de la Fonction Publique'),
(176, 'GRH', 'DSL', 'Droit Social'),
(177, 'GRH', 'DSS', 'Droit de la Sécurité Sociale'),
(178, 'GRH', 'DTV', 'Droit du Travail'),
(179, 'GRH', 'DYG', 'Dynamique de Groupe'),
(180, 'GRH', 'EPT', 'Etude de Postes de Travail'),
(181, 'GRH', 'ERH', 'Evolution des Ressources Humaines'),
(182, 'GRH', 'ETP', 'Etudes de Postes'),
(183, 'GRH', 'EVP', 'Evaluation du Personnel'),
(184, 'GRH', 'EVRH', 'Evaluation des Ressources Humaines'),
(185, 'GRH', 'FDP', 'Formation et Développement du Personnel'),
(186, 'GRH', 'FDRH', 'Formation et Développement des Ressources Humaines'),
(187, 'GRH', 'FR', 'Techniques d Expression'),
(188, 'GRH', 'GCF', 'Gestion des Conflits'),
(189, 'GRH', 'GPEP', 'Gestion Prévisionnelle des Emplois et des Personnes'),
(190, 'GRH', 'GPRH', 'Gestion Prévisionnelle des Ressources Humaines'),
(191, 'GRH', 'GRH', 'Gestion des Ressources Humaines'),
(192, 'GRH', 'HYS', 'Hygiène et Sécurité'),
(193, 'GRH', 'INF', 'Informatique'),
(194, 'GRH', 'MET', 'Méthodologie de Recherche'),
(195, 'GRH', 'MF', 'Mathématiques Financières'),
(196, 'GRH', 'MG', 'Mathématiques Générales'),
(197, 'GRH', 'MGO', 'Management des Organismes'),
(198, 'GRH', 'MTV', 'Motivation'),
(199, 'GRH', 'OAM', 'Organisation Administrative'),
(200, 'GRH', 'OGE', 'Organisation et Gestion des Entreprises'),
(201, 'GRH', 'PDS', 'Prise de Décision'),
(202, 'GRH', 'PGRH', 'Politique de la Gestion des Ressources Humaines'),
(203, 'GRH', 'PHR', 'Phases de Recrutement'),
(204, 'GRH', 'PLF', 'Plan de Formation'),
(205, 'GRH', 'PYT', 'Psychologie du Travail'),
(206, 'GRH', 'RAD', 'Rédaction Administrative'),
(207, 'GRH', 'RLH', 'Relations Humaines'),
(208, 'GRH', 'RRH', 'Recrutement des Ressources Humaines'),
(209, 'GRH', 'RTP', 'Recrutement du Personnel'),
(210, 'GRH', 'SEP', 'Sécurité Professionnelle'),
(211, 'GRH', 'SRH', 'Stimulation des Ressources Humaines'),
(212, 'GRH', 'SSLT', 'Suivi Salariés en Matiére de la Législation du Travail'),
(213, 'GRH', 'ST', 'Statistiques'),
(214, 'GRH', 'STD', 'Statistiques Descriptives'),
(215, 'GRH', 'STP', 'Stimulation du Personnel'),
(216, 'GRH', 'TCR', 'Technique Rédactionnelle'),
(217, 'GRH', 'TEP', 'Traitement des Eléments de la Paie'),
(219, 'MMG', 'ADD', 'Analyse des Données'),
(220, 'MMG', 'ANG', 'Langue Anglaise'),
(221, 'MMG', 'AUE', 'Audit d\'Entreprise'),
(222, 'MMG', 'CEN', 'Création d\'Entreprise'),
(223, 'MMG', 'CTR', 'Contrôle de Gestion'),
(224, 'MMG', 'DAF', 'Droit des Affaires'),
(225, 'MMG', 'DRC', 'Droit des Contrats'),
(226, 'MMG', 'GOE', 'Gouvernance d\'Entreprise'),
(227, 'MMG', 'GTF', 'Gestion Financière'),
(228, 'MMG', 'MET', 'Méthodologie'),
(229, 'MMG', 'MGP', 'Management de Projet'),
(230, 'MMG', 'MKI', 'Marketing Industriel'),
(231, 'MMG', 'MNG', 'Management Général'),
(232, 'MMG', 'MRH', 'Management des Ressources Humaines'),
(233, 'MMG', 'MSO', 'Marketing Stratégique et Opérationnel'),
(234, 'MMG', 'PMNG', 'Pratiques de Management'),
(235, 'MMG', 'STE', 'Stratégie d\'Entreprise'),
(236, 'MMG', 'TPD', 'Techniques d\'Aide é la Prise de Décision'),
(241, 'INF', 'ACC', 'Access'),
(242, 'INF', 'ALG', 'Algorithme'),
(243, 'INF', 'ANG', 'Langue Anglaise'),
(244, 'INF', 'BUR', 'Bureautique'),
(245, 'INF', 'DLP', 'Delphi'),
(246, 'INF', 'DLPR', 'Delphi  Réseau'),
(247, 'INF', 'FIC', 'Fichier'),
(248, 'INF', 'FPG', 'Finalisation Programmes'),
(249, 'INF', 'FR', 'Techniques d Expression'),
(250, 'INF', 'OGE', 'Organisation et Gestion des Entreprises'),
(251, 'INF', 'PAS', 'Pascal'),
(252, 'INF', 'PBS', 'Probabilités et Statistiques'),
(253, 'INF', 'RES', 'Réseau'),
(254, 'INF', 'RO', 'Recherche Opérationnelle'),
(255, 'INF', 'SDD', 'Structure de Données'),
(256, 'INF', 'SGBD', 'Système Gestion des Bases de Données'),
(257, 'INF', 'SM', 'Structure Machines'),
(258, 'INF', 'SQL', 'S.Q.L'),
(259, 'INF', 'SQLS', 'SQL Server'),
(260, 'INF', 'ST', 'Statistiques');

-- --------------------------------------------------------

--
-- Structure de la table `message`
--

CREATE TABLE `message` (
  `id_msg` int(11) NOT NULL,
  `id` int(11) NOT NULL,
  `nom` varchar(50) NOT NULL,
  `from_id` int(11) NOT NULL,
  `from_nom` varchar(50) NOT NULL,
  `objet` text NOT NULL,
  `dat` datetime NOT NULL,
  `body` text,
  `active` varchar(20) NOT NULL,
  `vue` varchar(20) NOT NULL,
  `f_pj` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `message`
--

INSERT INTO `message` (`id_msg`, `id`, `nom`, `from_id`, `from_nom`, `objet`, `dat`, `body`, `active`, `vue`, `f_pj`) VALUES
(1, 1, 'TAIBI Khaled', 2, 'AREZKI Kamel', 'salam', '2020-09-02 18:39:20', '<p>salam&nbsp;</p>', 'false', 'true', ''),
(2, 1, 'TAIBI Khaled', 2, 'AREZKI Kamel', 'salam', '2020-09-13 14:48:25', '<p>ouch rak</p>', 'false', 'true', ''),
(3, 1, 'TAIBI Khaled', 2, 'AREZKI Kamel', 'test', '2020-09-24 15:42:21', '<p>jhgj ghjgjhg jhg jh gjh</p>', 'true', 'false', ''),
(4, 1, 'TAIBI Khaled', 1, 'TAIBI Khaled', 'RE : salam', '2020-10-14 12:42:51', '<p>-----------------------------------------------------<br />\r\nDe : TAIBI Khaled<br />\r\nDate : 2020-09-02 18:39:20<br />\r\nObjet : salam</p>\r\n\r\n<p>salam&nbsp;</p>\r\n\r\n<p>-----------------------------------------------------</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>TEST</p>', 'false', 'true', '');

-- --------------------------------------------------------

--
-- Structure de la table `message_envoye`
--

CREATE TABLE `message_envoye` (
  `id_msg` int(11) NOT NULL,
  `id` int(11) NOT NULL,
  `nom` varchar(50) NOT NULL,
  `from_id` int(11) NOT NULL,
  `from_nom` varchar(50) NOT NULL,
  `objet` text NOT NULL,
  `dat` datetime NOT NULL,
  `body` text,
  `active` varchar(20) NOT NULL,
  `vue` varchar(20) NOT NULL,
  `f_pj` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `message_envoye`
--

INSERT INTO `message_envoye` (`id_msg`, `id`, `nom`, `from_id`, `from_nom`, `objet`, `dat`, `body`, `active`, `vue`, `f_pj`) VALUES
(1, 1, 'TAIBI Khaled', 2, 'AREZKI Kamel', 'salam', '2020-09-02 18:39:20', '<p>salam&nbsp;</p>', 'false', 'true', ''),
(2, 1, 'TAIBI Khaled', 2, 'AREZKI Kamel', 'salam', '2020-09-13 14:48:25', '<p>ouch rak</p>', 'false', 'true', ''),
(3, 1, 'TAIBI Khaled', 2, 'AREZKI Kamel', 'test', '2020-09-24 15:42:21', '<p>jhgj ghjgjhg jhg jh gjh</p>', 'false', 'true', ''),
(4, 1, 'TAIBI Khaled', 1, 'TAIBI Khaled', 'RE : salam', '2020-10-14 12:42:51', '<p>-----------------------------------------------------<br />\r\nDe : TAIBI Khaled<br />\r\nDate : 2020-09-02 18:39:20<br />\r\nObjet : salam</p>\r\n\r\n<p>salam&nbsp;</p>\r\n\r\n<p>-----------------------------------------------------</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>TEST</p>', 'true', 'false', '');

-- --------------------------------------------------------

--
-- Structure de la table `moyenne_etablissement`
--

CREATE TABLE `moyenne_etablissement` (
  `moy_adm` float NOT NULL,
  `moy_cneg` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `moyenne_etablissement`
--

INSERT INTO `moyenne_etablissement` (`moy_adm`, `moy_cneg`) VALUES
(10, 9.35);

-- --------------------------------------------------------

--
-- Structure de la table `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `ref` varchar(100) NOT NULL,
  `titre` varchar(200) NOT NULL,
  `content` text NOT NULL,
  `dat` datetime NOT NULL,
  `f_img` varchar(50) DEFAULT NULL,
  `f_pj` varchar(50) DEFAULT NULL,
  `content_text` text,
  `active` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `news`
--

INSERT INTO `news` (`id`, `ref`, `titre`, `content`, `dat`, `f_img`, `f_pj`, `content_text`, `active`) VALUES
(1, 'E.F.P.G / 001', 'NOTE D\'INFORMATION : INSCRIPTION 2020-2021', '<p>test</p>', '2020-10-08 10:47:27', '', '', 'test', 1),
(2, 'I.F.G / 001', 'NOTE D\'INFORMATION : INSCRIPTION 2020-2021', '<p>HGYGIUGGG&nbsp; G</p>', '2020-10-08 17:34:20', '', '', 'HGYGIUGGG  G', 0);

-- --------------------------------------------------------

--
-- Structure de la table `niveau_filialle`
--

CREATE TABLE `niveau_filialle` (
  `id` int(11) NOT NULL,
  `niveau_filialle` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `niveau_filialle`
--

INSERT INTO `niveau_filialle` (`id`, `niveau_filialle`) VALUES
(1, '1ER AS SCIENCE'),
(2, '1ER AS LETTRE');

-- --------------------------------------------------------

--
-- Structure de la table `specialite`
--

CREATE TABLE `specialite` (
  `id` int(11) NOT NULL,
  `specialite` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `specialite`
--

INSERT INTO `specialite` (`id`, `specialite`) VALUES
(1, 'CAP'),
(2, 'CED');

-- --------------------------------------------------------

--
-- Structure de la table `specialite_bejaia`
--

CREATE TABLE `specialite_bejaia` (
  `id` int(11) NOT NULL,
  `CLE` varchar(2) DEFAULT NULL,
  `SPEC` varchar(80) DEFAULT NULL,
  `CLDEM` varchar(5) DEFAULT NULL,
  `CPT` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `specialite_bejaia`
--

INSERT INTO `specialite_bejaia` (`id`, `CLE`, `SPEC`, `CLDEM`, `CPT`) VALUES
(1, '11', 'Certificat de Maîtrise Professionnelle en Comptabilité', 'CAP', NULL),
(3, '21', 'Certificat de Maîtrise des Techniques Comptables', 'CMTC', 82),
(4, '31', 'Certificat d\'Economie et de Droit', 'CED', 36),
(6, '33', 'Technicien Supérieur en Comptabilité et Gestion', 'TSC', NULL),
(8, '42', 'Technicienne Supérieure Education des Jeunes Enfants', 'EE', 34),
(13, '65', 'Technicien Supérieur en Informatique. Option:  Base de Données', 'INF', 75);

-- --------------------------------------------------------

--
-- Structure de la table `specialite_ecole`
--

CREATE TABLE `specialite_ecole` (
  `id` int(11) NOT NULL,
  `CLE` varchar(2) DEFAULT NULL,
  `SPEC` varchar(80) DEFAULT NULL,
  `CLDEM` varchar(5) DEFAULT NULL,
  `CPT` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `specialite_ecole`
--

INSERT INTO `specialite_ecole` (`id`, `CLE`, `SPEC`, `CLDEM`, `CPT`) VALUES
(1, '11', 'Certificat de Maîtrise Professionnel en Comptabilité', 'CAP', 48),
(2, '21', 'Certificat de Maîtrise des Techniques Comptables', 'CMTC', 118),
(3, '31', 'Certificat d\'Economie et de Droit', 'CED', 46),
(4, '79', 'Ingénieur d\'Affaires', 'ING', 1),
(5, '81', 'Master Professionnel en Ressources Humaines', 'MRH', 1),
(6, '82', 'Master Professionnel en Comptabilité et Finances', 'MCF', 27),
(7, '83', 'Master Professionnel en Management', 'MMG', 68),
(8, '84', 'DESS Audit et Contrôle de Gestion', 'DESS', 1),
(9, '91', 'Langue Anglaise', 'ANG', 1);

-- --------------------------------------------------------

--
-- Structure de la table `specialite_etablissement`
--

CREATE TABLE `specialite_etablissement` (
  `id` int(11) NOT NULL,
  `CLE` varchar(2) DEFAULT NULL,
  `SPEC` varchar(80) DEFAULT NULL,
  `CLDEM` varchar(5) DEFAULT NULL,
  `CPT` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `specialite_etablissement`
--

INSERT INTO `specialite_etablissement` (`id`, `CLE`, `SPEC`, `CLDEM`, `CPT`) VALUES
(1, NULL, 'السنة الثالثة ثانوي آداب و فلسفة', '3ALF', NULL);

-- --------------------------------------------------------

--
-- Structure de la table `specialite_institut`
--

CREATE TABLE `specialite_institut` (
  `id` int(11) NOT NULL,
  `CLE` varchar(2) DEFAULT NULL,
  `SPEC` varchar(80) DEFAULT NULL,
  `CLDEM` varchar(5) DEFAULT NULL,
  `CPT` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `specialite_institut`
--

INSERT INTO `specialite_institut` (`id`, `CLE`, `SPEC`, `CLDEM`, `CPT`) VALUES
(1, '11', 'Certificat de Maîtrise Professionnelle en Comptabilité', 'CAP', NULL),
(2, '12', 'Cycle Préparatoire aux Formations de niveau 2', 'CP2', 1),
(3, '21', 'Certificat de Maîtrise des Techniques Comptables', 'CMTC', 82),
(4, '31', 'Certificat d\'Economie et de Droit', 'CED', 36),
(5, '32', 'Nouveau Système Comptable Financier Normes IAS-IFRS', 'IFRS', 1),
(6, '33', 'Technicien Supérieur en Comptabilité et Gestion', 'TSC', NULL),
(7, '39', 'Diplôme de Comptabilité et de Gestion', 'DCG', 1),
(8, '42', 'Technicienne Supérieure Education des Jeunes Enfants', 'EE', 34),
(9, '51', 'Brevet de Technicien  Agent de Transit et Dédouanement', 'DED', 1),
(10, '52', 'Brevet Professionnel en Banque', 'BPB', 1),
(11, '55', 'Technicien Supérieur en Tourisme. Option: Production et Commercialisation', 'THP', 1),
(12, '56', 'Technicien Supérieur en Hôtellerie. Option: Gestion et Administration Hôtelières', 'HTL', 1),
(13, '65', 'Technicien Supérieur en Informatique. Option:  Base de Données', 'INF', 75),
(14, '69', 'Ingénieur d\'Application en Informatique', 'IAI', 3),
(15, '71', 'Technicien Supérieur en Marketing', 'MARK', NULL),
(16, '72', 'Technicien Supérieur en  Commerce International', 'CI', NULL),
(17, '74', 'Technicien Supérieur en Banque', 'TSB', 1),
(18, '75', 'Brevet Professionnel en Assurances', 'BPA', 1),
(19, '76', 'Technicien Supérieur en Tourisme. Option: Production', 'THL', NULL),
(20, '77', 'Technicien Supérieur en Gestion des Ressources Humaines', 'GRH', NULL),
(21, '78', 'Technicien Supérieur en Assurances', 'TSA', 56),
(22, '79', 'Ingénieur d\'Affaires', 'ING', 1),
(23, '81', 'Master 1.  Administration des Affaires', 'MAA', 84),
(24, '82', 'Master 1.  Informatique', 'MI', 30),
(25, '83', 'Master 1.  Assurances', 'MAS', 1),
(26, '84', 'Master 1.  Gestion des Ressources Humaines', 'MGRH', 48),
(27, '85', 'Master 1.  Finance et Comptabilité', 'MFC', 39);

-- --------------------------------------------------------

--
-- Structure de la table `specialite_oran`
--

CREATE TABLE `specialite_oran` (
  `id` int(11) NOT NULL,
  `CLE` varchar(2) DEFAULT NULL,
  `SPEC` varchar(80) DEFAULT NULL,
  `CLDEM` varchar(5) DEFAULT NULL,
  `CPT` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `specialite_oran`
--

INSERT INTO `specialite_oran` (`id`, `CLE`, `SPEC`, `CLDEM`, `CPT`) VALUES
(1, '11', 'Certificat de Maîtrise Professionnelle en Comptabilité', 'CAP', NULL),
(3, '21', 'Certificat de Maîtrise des Techniques Comptables', 'CMTC', 82),
(8, '42', 'Technicienne Supérieure Education des Jeunes Enfants', 'EE', 34),
(13, '65', 'Technicien Supérieur en Informatique. Option:  Base de Données', 'INF', 75),
(16, '72', 'Technicien Supérieur en  Commerce International', 'CI', NULL),
(20, '77', 'Technicien Supérieur en Gestion des Ressources Humaines', 'GRH', NULL),
(22, '71', 'Technicien Supérieur en Secrétariat', 'SEC', NULL),
(27, '83', 'Master Professionnel en Management', 'MMG', 68);

-- --------------------------------------------------------

--
-- Structure de la table `users`
--

CREATE TABLE `users` (
  `user` varchar(30) NOT NULL,
  `password` varchar(30) NOT NULL,
  `nom` varchar(60) NOT NULL,
  `typ` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `users`
--

INSERT INTO `users` (`user`, `password`, `nom`, `typ`) VALUES
('khaled', 'taibi', 'TAIBI Khaled', 'ADMIN'),
('nadjib', 'athmani', 'ATHMANI Nadjib', 'IFG'),
('salim', 'salim', 'SALIM salim', 'EES'),
('kamel', 'arezki', 'AREZKI Kamel', 'EFPG'),
('bejaia', 'bejaia', 'bejaia', 'EFPG-BEJAIA'),
('oran', 'oran', 'oran', 'EFPG-ORAN');

-- --------------------------------------------------------

--
-- Structure de la table `users_membre`
--

CREATE TABLE `users_membre` (
  `id` int(11) NOT NULL,
  `user` varchar(30) NOT NULL,
  `password` varchar(30) NOT NULL,
  `matricule` varchar(30) NOT NULL,
  `nom` varchar(60) NOT NULL,
  `dat_nais` date NOT NULL,
  `categorie` varchar(200) NOT NULL,
  `institut` varchar(200) NOT NULL,
  `formation` varchar(200) NOT NULL,
  `active` varchar(20) NOT NULL,
  `img` varchar(200) NOT NULL,
  `sexe` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `users_membre`
--

INSERT INTO `users_membre` (`id`, `user`, `password`, `matricule`, `nom`, `dat_nais`, `categorie`, `institut`, `formation`, `active`, `img`, `sexe`) VALUES
(1, 'khaled', 'taibi', '000001', 'TAIBI Khaled', '1982-09-09', 'FP', 'IFG', 'CAP', 'false', 'img1.jpg', 'M'),
(2, 'kamel', '123', '00002', 'AREZKI Kamel', '1976-09-02', 'FP', 'IFG', 'CAP', 'false', 'img2.jpg', 'M'),
(3, 'salim', 'salim', '0004', 'Salim Salim', '1982-10-14', 'ES', 'EES', '3ALF', 'false', '', 'M');

-- --------------------------------------------------------

--
-- Structure de la table `wilaya`
--

CREATE TABLE `wilaya` (
  `CODE_W` int(11) NOT NULL,
  `WILAYA` varchar(100) DEFAULT NULL,
  `WILAYAA` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Déchargement des données de la table `wilaya`
--

INSERT INTO `wilaya` (`CODE_W`, `WILAYA`, `WILAYAA`) VALUES
(1, 'Adrar', 'أدرار'),
(2, 'Chlef', 'الشلف'),
(3, 'Laghouat', 'الاغواط'),
(4, 'Oum El Bouaghi', 'أم البواقي'),
(5, 'Batna', 'باتنة'),
(6, 'Béjaia', 'بجاية'),
(7, 'Biskra', 'بسكرة'),
(8, 'Béchar', 'بشار'),
(9, 'Blida', 'البليدة'),
(10, 'bouira', 'البويرة'),
(11, 'Tamanrasset', 'تامنغست'),
(12, 'Tébessa', 'تبسة'),
(13, 'Tlemcen', 'تلمسان'),
(14, 'Tiaret', 'تيارت'),
(15, 'Tizi Ouzou', 'تيزي وزو'),
(16, 'Alger', 'الجزائر العاصمة'),
(17, 'Djelfa', 'الجلفة'),
(18, 'Jijel', 'جيجل'),
(19, 'Sétif', 'سطيف'),
(20, 'Saida', 'سعيدة'),
(21, 'Skikda', 'سكيكدة'),
(22, 'Sidi Bel Abbès', 'سيدي بلعباس'),
(23, 'Annaba', 'عنابة'),
(24, 'Guelma', 'قالمة'),
(25, 'Constantine', 'قسنطينة'),
(26, 'Médéa', 'المدية'),
(27, 'Mostaganem', 'مستغانم'),
(28, 'M\'Sila', 'المسيلة'),
(29, 'Mascara', 'معسكر'),
(30, 'Ouargla', 'ورقلة'),
(31, 'Oran', 'وهران'),
(32, 'El Bayadh', 'البيض'),
(33, 'Illizi', 'إليزي'),
(34, 'Bordj Bou Arreridj', 'برج بوعريريج'),
(35, 'Boumerdès', 'بومرداس'),
(36, 'El Tarf', 'الطارف'),
(37, 'Tindouf', 'تيندوف'),
(38, 'Tissemsilt', 'تيسمسيلت'),
(39, 'El Oued', 'الوادي'),
(40, 'Khenchela', 'خنشلة'),
(41, 'Souk Ahras', 'سوق اهراس'),
(42, 'Tipaza', 'تيبازة'),
(43, 'Mila', 'ميلة'),
(44, 'Ain Defla', 'عين الدفلى'),
(45, 'Naâma', 'النعامة'),
(46, 'Ain Témouchent', 'عين تموشنت'),
(47, 'Ghardaia', 'غرداية'),
(48, 'Relizane', 'غليزان');

--
-- Index pour les tables déchargées
--

--
-- Index pour la table `alerte`
--
ALTER TABLE `alerte`
  ADD PRIMARY KEY (`id_msg`);

--
-- Index pour la table `contact`
--
ALTER TABLE `contact`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `cour_document`
--
ALTER TABLE `cour_document`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `cour_video`
--
ALTER TABLE `cour_video`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `enseignants_bejaia`
--
ALTER TABLE `enseignants_bejaia`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `enseignants_ecole`
--
ALTER TABLE `enseignants_ecole`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `enseignants_etablissement`
--
ALTER TABLE `enseignants_etablissement`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `enseignants_institut`
--
ALTER TABLE `enseignants_institut`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `enseignants_oran`
--
ALTER TABLE `enseignants_oran`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `evenement`
--
ALTER TABLE `evenement`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `inscription_bejaia`
--
ALTER TABLE `inscription_bejaia`
  ADD PRIMARY KEY (`ID`);

--
-- Index pour la table `inscription_bejaia_choix`
--
ALTER TABLE `inscription_bejaia_choix`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `inscription_ecole`
--
ALTER TABLE `inscription_ecole`
  ADD PRIMARY KEY (`ID`);

--
-- Index pour la table `inscription_ecole_choix`
--
ALTER TABLE `inscription_ecole_choix`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `inscription_etablissement`
--
ALTER TABLE `inscription_etablissement`
  ADD PRIMARY KEY (`ID`);

--
-- Index pour la table `inscription_etablissement_choix`
--
ALTER TABLE `inscription_etablissement_choix`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `inscription_institut`
--
ALTER TABLE `inscription_institut`
  ADD PRIMARY KEY (`ID`);

--
-- Index pour la table `inscription_institut_choix`
--
ALTER TABLE `inscription_institut_choix`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `inscription_oran`
--
ALTER TABLE `inscription_oran`
  ADD PRIMARY KEY (`ID`);

--
-- Index pour la table `inscription_oran_choix`
--
ALTER TABLE `inscription_oran_choix`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `matiere`
--
ALTER TABLE `matiere`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `matiere_bejaia`
--
ALTER TABLE `matiere_bejaia`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `matiere_ecole`
--
ALTER TABLE `matiere_ecole`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `matiere_etablissement`
--
ALTER TABLE `matiere_etablissement`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `matiere_institut`
--
ALTER TABLE `matiere_institut`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `matiere_oran`
--
ALTER TABLE `matiere_oran`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `message`
--
ALTER TABLE `message`
  ADD PRIMARY KEY (`id_msg`);

--
-- Index pour la table `message_envoye`
--
ALTER TABLE `message_envoye`
  ADD PRIMARY KEY (`id_msg`);

--
-- Index pour la table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `niveau_filialle`
--
ALTER TABLE `niveau_filialle`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `specialite`
--
ALTER TABLE `specialite`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `specialite_bejaia`
--
ALTER TABLE `specialite_bejaia`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `specialite_ecole`
--
ALTER TABLE `specialite_ecole`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `specialite_etablissement`
--
ALTER TABLE `specialite_etablissement`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `specialite_institut`
--
ALTER TABLE `specialite_institut`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `specialite_oran`
--
ALTER TABLE `specialite_oran`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `users_membre`
--
ALTER TABLE `users_membre`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT pour les tables déchargées
--

--
-- AUTO_INCREMENT pour la table `alerte`
--
ALTER TABLE `alerte`
  MODIFY `id_msg` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `contact`
--
ALTER TABLE `contact`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT pour la table `cour_document`
--
ALTER TABLE `cour_document`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT pour la table `cour_video`
--
ALTER TABLE `cour_video`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT pour la table `enseignants_bejaia`
--
ALTER TABLE `enseignants_bejaia`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT pour la table `enseignants_ecole`
--
ALTER TABLE `enseignants_ecole`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT pour la table `enseignants_etablissement`
--
ALTER TABLE `enseignants_etablissement`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `enseignants_institut`
--
ALTER TABLE `enseignants_institut`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `enseignants_oran`
--
ALTER TABLE `enseignants_oran`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `evenement`
--
ALTER TABLE `evenement`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT pour la table `inscription_bejaia`
--
ALTER TABLE `inscription_bejaia`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT pour la table `inscription_bejaia_choix`
--
ALTER TABLE `inscription_bejaia_choix`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT pour la table `inscription_ecole`
--
ALTER TABLE `inscription_ecole`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT pour la table `inscription_ecole_choix`
--
ALTER TABLE `inscription_ecole_choix`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT pour la table `inscription_etablissement`
--
ALTER TABLE `inscription_etablissement`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT pour la table `inscription_etablissement_choix`
--
ALTER TABLE `inscription_etablissement_choix`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT pour la table `inscription_institut`
--
ALTER TABLE `inscription_institut`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT pour la table `inscription_institut_choix`
--
ALTER TABLE `inscription_institut_choix`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- AUTO_INCREMENT pour la table `inscription_oran`
--
ALTER TABLE `inscription_oran`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT pour la table `inscription_oran_choix`
--
ALTER TABLE `inscription_oran_choix`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT pour la table `matiere`
--
ALTER TABLE `matiere`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT pour la table `matiere_bejaia`
--
ALTER TABLE `matiere_bejaia`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=452;

--
-- AUTO_INCREMENT pour la table `matiere_ecole`
--
ALTER TABLE `matiere_ecole`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=149;

--
-- AUTO_INCREMENT pour la table `matiere_etablissement`
--
ALTER TABLE `matiere_etablissement`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT pour la table `matiere_institut`
--
ALTER TABLE `matiere_institut`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=452;

--
-- AUTO_INCREMENT pour la table `matiere_oran`
--
ALTER TABLE `matiere_oran`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=261;

--
-- AUTO_INCREMENT pour la table `message`
--
ALTER TABLE `message`
  MODIFY `id_msg` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT pour la table `message_envoye`
--
ALTER TABLE `message_envoye`
  MODIFY `id_msg` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT pour la table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT pour la table `niveau_filialle`
--
ALTER TABLE `niveau_filialle`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT pour la table `specialite`
--
ALTER TABLE `specialite`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT pour la table `specialite_bejaia`
--
ALTER TABLE `specialite_bejaia`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT pour la table `specialite_ecole`
--
ALTER TABLE `specialite_ecole`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT pour la table `specialite_etablissement`
--
ALTER TABLE `specialite_etablissement`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT pour la table `specialite_institut`
--
ALTER TABLE `specialite_institut`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT pour la table `specialite_oran`
--
ALTER TABLE `specialite_oran`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT pour la table `users_membre`
--
ALTER TABLE `users_membre`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
